{
  "id": "1jkpqxx",
  "title": "i’m the reason my girlfriend killed herself. i can’t live with the guilt.",
  "selftext": "for 3 years i was in a relationship with my girlfriend A. For the last 3 months of our relationship, i was cheating on A for reasons i don’t even remember anymore. A found out and she took a fuck ton of pills and died.\n\neveryone found out that i cheated on her shortly after her death because of a note she wrote before taking her life. i was ridiculed, bullied, harassed, assaulted, you name it. everyone hated me. i couldn’t go anywhere without people knowing what i did. i got constant death threats everywhere i went. my family stopped talking to me.\n\nit has been a little over a year since this happened and i can’t move on. everytime i look at another girl i think of A. i can’t speak to another girl because i get flashbacks of A. \n\nshe is on my mind nearly 24/7 and because im a stupid fuck up, i’ll never see her again nor will i ever be able to forgive myself.\n\ni can’t live with this guilt. im all alone and nobody wants anything to do with me. i’m the worst fucking person ever.\n\nand yes this is a throwaway account. if you know who i am fuck off i don’t want to hear it.",
  "created_utc": 1743031062.0,
  "score": 493,
  "num_comments": 124,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1jkpqxx/im_the_reason_my_girlfriend_killed_herself_i_cant/",
  "comments": [
    {
      "id": "mjxnd0c",
      "body": "It's not a realistic possibility for the experience of betrayal in one relationship to be the whole reason someone dies by suicide.  There's a lot known about the necessary and sufficient factors for significant risk of death by suicide, and that is just not how it works.  This is true even if she implicitly or explicitly blamed you in the note.  \n\nThe [bereavement resources wiki](https://www.reddit.com/r/SuicideBereavement/wiki/online_resources) that we share with /r/SuicideBereavement includes [this resource specifically on healing from a spiteful suicide note](http://www.speakingofsuicide.com/2014/05/20/spiteful-suicide-notes/) because this type of experience isn't uncommon.  It's also very common for survivors to scapegoat someone in the aftermath of a suicide, and punish them in ways that are far out of proportion to their actual degree of responsibility.  \n\nOf course cheating on her was a terrible mistake, but if you're sincerely remorseful, then there is a path forward.  However, in this type of situation, most people need help and support in the healing process.  If you need help finding reputable mental-health crisis resources in your area, please feel welcome to [message the mod team here](https://www.reddit.com/message/compose/?to=/r/SuicideWatch) and we'll do our best to help.",
      "created_utc": 1743036396.0,
      "score": 1
    },
    {
      "id": "mjxoiz9",
      "body": "As someone who has attempted suicide, her suicide isn't your fault. \nBefore my suicide attempt my mom grounded me and that was the last thing that pushed me over the edge. What she grounded me for was warranted and children are grounded every day in the world, they don't kill themselves, but I did. Or I tried, anyways.\nGrounding me was not the reason I tried to do it, it was everything I had been through leading up to that, and that was the last thing I could handle. \nWhat you did was horrible but if it wasn't you, it would've been something else. If someone is set on their belief that the world would be better off without them, and that death is an ending to their suffering, nobody can keep them from killing themselves but them. \nPlease seek therapy. There's nothing wrong with asking for help. \nI also hope that this has made you realize your actions have consequences and you never hurt someone like you hurt her again.",
      "created_utc": 1743036794.0,
      "score": 282
    },
    {
      "id": "mjxfby1",
      "body": "In Germany, besides “suicide,” there is another word: “Selbstmord,” which translates to “self-murder” in English. I mention this in such detail because it highlights the two key components of suicide: “self” and “murder.”\n\nYou didn’t kill your girlfriend—she did it herself. You are not the perpetrator. (First component)\n\nAnd yes, cheating on someone and being unfaithful is terrible, but it does not “justify” murder. (Second component)\n\nThe punishment you are placing on yourself is too severe. It doesn’t match the „crime“.",
      "created_utc": 1743033683.0,
      "score": 271
    },
    {
      "id": "mjxb0h6",
      "body": "What you did was horrible but you can't take back what you did. The only thing you can do right now is try your best to move on. Take this as a hard lesson and become a better person",
      "created_utc": 1743032260.0,
      "score": 180
    },
    {
      "id": "mjxfwpf",
      "body": "I want to say that you are not the reason she killed herself. You were the brick that broke the camel’s back. I say brick instead of straw because what you did was heavy and would break anyone’s heart.  I don’t know how to say this properly but people who kill themselves have a long list of things they feel they can’t escape. I can almost guarantee that you were not the sole reason. Yes you contributed but there were other ways to escape that situation for her. You didn’t leave a lot to go off of but the way you’ve portrayed it, it doesn’t sound like you were keeping her in this relationship or that you were abusive. Just sounds like you made a really shitty decision and deeply wounded someone you love. Not that it’s right but this doesn’t make you an awful person. This is not an unredeemable act. There are always multiple factors including circumstance and untreated mental illness. You sound young. Go to therapy. Move to a different part of the country. Find some people that see you for who you are and not a mistake you made. You’ll be okay. The most important thing for you to do right now is seek professional help. This is not a situation that you can handle on your own. There are counselors at schools, jobs that offer free therapy like Lyra or Better Help. Also, if you live in the US and you feel the need to seek a psychiatrist or in patient care, you do not need to pay your medical bills right away. They will not go to collections. Pay them when you feel comfortable financially to do so. Please know that there is always a way out. Everything will turn out okay. You’re not a fuck up. You just fucked up. Everyone does.",
      "created_utc": 1743033877.0,
      "score": 104
    },
    {
      "id": "mjz6b4i",
      "body": "You probably need to join some grief groups.   There's over 8 billion people on earth and mathematically there's gonna people out there that experienced something like this.",
      "created_utc": 1743061762.0,
      "score": 6
    },
    {
      "id": "mjxg8w8",
      "body": "It’s good that you’re confronting yourself. That is very good. This is such a shit situation and I obviously feel for A and also for you. This is one of those insane situations where you obviously couldn’t have known what would happen. Most people don’t kill themselves after being cheated on, but that doesn’t make your case any better of course. You obviously shouldn’t have cheated. I’ve been cheated on in more than half of my relationships, which is really depressing and it feels like shit and I don’t want that to happen to anyone, but how could you have known A would kill themselves? I can’t say “don’t beat yourself up too much” because this is a serious tragedy, but I can say you must’ve not known what your actions could’ve caused. If you did know A would do that, that’s another thing, but I doubt you knew A was depressed and mentally ill. Talk to a therapist if you can. That can help a ton, especially after traumatic experiences. I hope A talked to a therapist, but maybe they didn’t. It’s good that you’re not making excuses or bullshitting it. That shows good self awareness. You’ve obviously grown from when the tragedy happened. That’s good. Continue to get better.",
      "created_utc": 1743033991.0,
      "score": 19
    },
    {
      "id": "mk3el57",
      "body": "[removed]",
      "created_utc": 1743117735.0,
      "score": 8
    },
    {
      "id": "mk2qjxt",
      "body": "It’s deeply disturbing how this post is centered entirely around your guilt and how you feel, when a young woman has lost her life. You’re not showing real remorse — you’re trying to remove the weight of your guilt by fishing for consolation from strangers online.\n\nYou admit your actions contributed to her pain, yet the focus here is still on you. That in itself is so telling.\n\nPeople don’t harm themselves in a vacuum. It often happens after repeated emotional abuse, betrayal, and mistreatment by those they trusted most. She didn’t just “lose a battle with mental health” — she was failed by the people around her, including you.\n\nStop making this about your redemption arc. The least you could do is sit with the consequences and reflect on what accountability actually means.",
      "created_utc": 1743110625.0,
      "score": 9
    },
    {
      "id": "mk81xw1",
      "body": "Tbh if my sister would’ve killed herself because you couldn’t keep your dik in your pants I’d cut it off",
      "created_utc": 1743184856.0,
      "score": 5
    },
    {
      "id": "mk1yfy5",
      "body": "Gotta live with it bro.  This is your reality now",
      "created_utc": 1743099589.0,
      "score": 7
    },
    {
      "id": "mjya8bt",
      "body": "When will the cycle break? How will your family feel?  I hope you've tried therapy ❤️ we are here for you",
      "created_utc": 1743044623.0,
      "score": 7
    },
    {
      "id": "mjxbr7p",
      "body": "My heart breaks for you. This is a horrible situation, and I hope you are eventually able to find peace. Please seek therapy if you haven't already.",
      "created_utc": 1743032499.0,
      "score": 18
    },
    {
      "id": "mk8k8ng",
      "body": "don't take the cowards way out and commit yourself from now on to making the world a better place to make up for what you did",
      "created_utc": 1743190309.0,
      "score": 2
    },
    {
      "id": "mkgweue",
      "body": "I attempted suicide from a very similar reason (to be fair, it wasn't just cheating, it was a lot of reasons) - and this is not your fault. While I definitely don't condone what you did,  it is still not your fault. Realistically we all have a responsibility to ourselves in the end of the day. I'm so sorry for your loss.",
      "created_utc": 1743307758.0,
      "score": 2
    },
    {
      "id": "mklgqjo",
      "body": "1. I don't agree with most people here on one count. I do not believe cheating is horrible. Of course it's not nice, but it's human. I visited a Buddhist region once where  the cheater was considered to have acted wrongly but the cheated person, if they became very upset, was considered to have acted even more wrongly. Just to put things in perspective. Our ultraconservative value system is but one of many; there are other value systems that are more compassionate. \n2. Also - this is a key distinction - acting badly does not mean you *are* bad.\n3. It was not your fault. This has been pointed out by others. You are not the reason. Please  think this through until you understand that it could not be, your fault. \n4. It is imperative imo that you get professional and competent psychological therapy. You may have to move, perhaps. \n\n\nI am terribly sorry for you and for her. You are in my heart. ",
      "created_utc": 1743375035.0,
      "score": 2
    },
    {
      "id": "mjxtiqt",
      "body": "I had a situation that was kind of similar. A guy I was seeing got a little crazy bc he met some guy I was seeing before him at a party. He was mad and I told him to fuck off when he yelled at me, it was before I even met him, and blocked him on everything. He killed himself within a month. I know I couldn’t be the only reason but damn I hope I wasn’t a catalyst to it. I had guilt for a lot of years. It’s been 9 now.",
      "created_utc": 1743038544.0,
      "score": 4
    },
    {
      "id": "mjxy9fg",
      "body": "Dude, what she did was not normal. There has to be other factors because lots of people get cheated on and don't do this, or she overreacted. It sucks, but you are young, and you have one life. With time it becomes easier and the memories start losing emotional attachment. It may seem impossible now, but trust me. It does definitely seem like your environment is one you either need to take a break from or leave. Rebuild and grow.",
      "created_utc": 1743040213.0,
      "score": 6
    },
    {
      "id": "mk3dhnk",
      "body": "Your actions have cost your girlfriend her life, and now you want sympathy from strangers on the internet. \n\nBoo hoo. You need to live with the consequences of your actions.",
      "created_utc": 1743117389.0,
      "score": 6
    },
    {
      "id": "mjydq3e",
      "body": "[removed]",
      "created_utc": 1743046034.0,
      "score": 5
    },
    {
      "id": "mjxkmes",
      "body": "[removed]",
      "created_utc": 1743035465.0,
      "score": 7
    },
    {
      "id": "mjyih2f",
      "body": "So there are people who have been charged with pushing people to suicide, so I wouldn’t say no one is ever responsible for anyone’s suicide. Some people absolutely are responsible, but I think most of the time there are several issues that lead to people’s suicide, so most of the time it’s more than one person contributing to the suicide. Just being completely honest that was a factor in her suicide, but it probably was not the only reason she committed suicide. I also want to add that a lot of the times when people are very obviously responsible for suicide it is usually due to abusive behaviors like bullying and then obviously traumatic things and telling people to kill themselves as well. Normally people do not commit suicide from being cheated on, just break up. So while that was shitty, I feel like there were probably other bad things going on in her life so that was just the cherry on top for her.\n\nThe answer isn’t to kill yourself, too. The answer is to be mindful of how you treat people, and don’t take anyone for granted. Maybe try to help people out more.",
      "created_utc": 1743048080.0,
      "score": 3
    },
    {
      "id": "mjyofjj",
      "body": "She might of blamed it on you or you might feel that way but you don’t commit suicide over just that. Everyone who is probably blaming you failed her in some way or another. \n\nYou fucked up , learn from it . What you are going through is likely some kind of universal punishment, but it isn’t really your fault. Push Through it and use it as fuel to become a better person. \n\nYou will come out a better person for it.",
      "created_utc": 1743050941.0,
      "score": 4
    },
    {
      "id": "mjyf2ge",
      "body": "[removed]",
      "created_utc": 1743046601.0,
      "score": 2
    },
    {
      "id": "mk43inb",
      "body": "Guess you learned your lesson then. DONT CHEAT",
      "created_utc": 1743125995.0,
      "score": 2
    },
    {
      "id": "mjxp7zq",
      "body": "I've had plenty of partners cheat on me but I never felt like killing myself. I would just dump them and move on. You can only take responsibility for your own behavior. You didn't kill her. You cheated on her, but you didn't end her life, she did. Still, it is a heavy burden to bear.",
      "created_utc": 1743037031.0,
      "score": 2
    },
    {
      "id": "mjxnnuz",
      "body": "There were other things boiling beneath the surface for A. Cheating is a scumbag move, but in a healthy person it’s not a reason for suicide. Suicide doesn’t end the pain it just passes it to someone else, her pain is now your burden, if you punch out that pain will go to someone you care about. The only way to stop it is to break the cycle.",
      "created_utc": 1743036501.0,
      "score": 2
    },
    {
      "id": "mjxi8rq",
      "body": "You aren’t the reason. Lots of people get cheated on and  they don’t take their own life",
      "created_utc": 1743034660.0,
      "score": 1
    },
    {
      "id": "mkd6k79",
      "body": "I can’t even imagine the weight of what you’re carrying, and I’m so sorry that you’re going through this. It’s clear that you’re in a lot of pain, and I want you to know that you’re not alone, even if it feels like it.\n\nWhat happened was tragic, and I won’t pretend to have easy answers. But I do know that no one is beyond redemption, no matter how much they’ve messed up. Guilt can eat you alive, but it can also be the first step toward healing—if you let it lead you to change instead of just suffering.\n\nI know you feel like you’ll never move on, but that’s not true. You’re still here. And because you’re still here, you still have the chance to make things right—not with the past, but with the way you live from this moment forward. A’s death was not your intention, and while nothing can undo what happened, punishing yourself forever won’t bring her back.\n\nPlease, don’t try to carry this alone. Talk to someone who can help—whether it’s a therapist, a priest, or just someone who will listen. I’m not saying it will fix everything overnight, but you don’t deserve to live in this hell forever. You are more than your worst mistake.\n\nIf you ever want to talk, I’m here. You’re not alone.",
      "created_utc": 1743261052.0,
      "score": 1
    },
    {
      "id": "mkgesni",
      "body": "She didn't kill herself because of you cheating. People get cheated on every day. Most people simply cry and move on not kill themselves. So, we know she wasn't normal. I'm sure she was already experiencing these thoughts long before she caught you cheating. Suicide isn't something that pops up one day and you just say fuck it and do it. It's not your fault.",
      "created_utc": 1743300322.0,
      "score": 1
    },
    {
      "id": "mktme95",
      "body": "You are definitely not the worst person ever, that may seem like a trivial point but I don’t think it is. But the point is this, there are obviously worse people in the world, like hitler, pol pot, Stalin, whichever serial killer, etc. you are not thinking clearly if you’re not recognizing that, I would not make any undoable decisions while your not thinking clearly, the option is always there but if you take you can’t undo it. Wait at the very least until you’re in a clear state of mind. My advice would be to move and see a therapist if you can afford one or if not some kind of support group, there are grieving ones and various other based off 1/ step programs like AA for tons of different things that can be just as helpful but free. Life is full of possibilities, death is absolute",
      "created_utc": 1743493496.0,
      "score": 1
    },
    {
      "id": "mky0i16",
      "body": "She should have taken some politicians with her ",
      "created_utc": 1743552242.0,
      "score": 1
    },
    {
      "id": "ml1cx8z",
      "body": "Don't put all of that on your shoulders.  That's easier said than done, but it is indicative of an atypical mental state to do what she did in the first place.   The \"normal\" way to process a betrayal like this would be to move on. Yes it hurts, and it's difficult, but the route A took was highly abnormal in the larger picture.   There was a lot more going on behind the scenes.  When someone dies it is normal for those around them to try and find something or someone to blame, and you became the catalyst for their anger and grief.  I urge you to reconsider your role in the larger picture, and try your best to recover from the loss and the guilt you feel .",
      "created_utc": 1743607675.0,
      "score": 1
    },
    {
      "id": "mk0i2z2",
      "body": "This is extremely sad it sounds like she's winning from beyond the grave. Do you really want her to do that, to continue make your life unbearable? \nIf you're truly repented, you can come out of this",
      "created_utc": 1743084484.0,
      "score": 1
    },
    {
      "id": "mjymcgn",
      "body": "People cheat all the time without the aggrieved partner committing suicide. Every. Single.  Day.\n\nA had bigger problems than a cheating boyfriend.  Her suicide is not your fault.",
      "created_utc": 1743049895.0,
      "score": -4
    },
    {
      "id": "mjxfk9p",
      "body": "I'm so sorry for your loss. You are right in saying that cheating is bad but I bet there was so much more going on for A. It might be a contributing factor but please don't think this is your fault because it isn't.",
      "created_utc": 1743033762.0,
      "score": -4
    },
    {
      "id": "mk432dg",
      "body": "As someone who has cheated in a relationship and also attempted suicide - it is not your fault that she killed herself. I’m so sorry you were and are so badly treated because of this.",
      "created_utc": 1743125838.0,
      "score": 0
    },
    {
      "id": "mjxey4r",
      "body": "That's not fair to you.  What you did was wrong, but her reaction was extreme and an outlier.  We can only control our own reactions to hardships and this was just something she wasn't well equipped to handle.\n\nIt seems you're taking responsibility for your part in this, but she escalated the situation. I'm sure if you knew this would happen you would have done things differently.",
      "created_utc": 1743033554.0,
      "score": -28
    },
    {
      "id": "mjxsf61",
      "body": "[removed]",
      "created_utc": 1743038156.0,
      "score": -4
    },
    {
      "id": "mk4fv8k",
      "body": "You’re genuinely remorseful. The human condition is complex. You first need to learn to forgive the dead - the person you once were.",
      "created_utc": 1743130344.0,
      "score": 0
    },
    {
      "id": "mk1l5cz",
      "body": "Well, if something as little as being cheated by your boyfriend had her doing this, I think this was something she was contemplating for a while",
      "created_utc": 1743095848.0,
      "score": -6
    },
    {
      "id": "mjz0meo",
      "body": "That is sadly on her, it is a choice SHE made out of circumstances, she must have dealt with her own worth before you even cheated. \n\nDont blame yourself for being human and fucking up, who hasen't, I mean we all do bad or stupid things sometimes but that does not make you are part of her murdering herself, no dont ever do this, and your family fuck them.. for not being there FOR YOU in this hard time, that makes me sick. \n\nI feel for you my guy. It is okay, SHE took that choice not you, you in your heart wanted the best for her no matter your own fuck ups, ofc. You never wanted her to die, so never blame it on you okay.",
      "created_utc": 1743058073.0,
      "score": -15
    },
    {
      "id": "mk0vo4z",
      "body": "A*lot* of people get cheated on and do not kill themselves. And a lot of good people make mistakes like cheating.\n\nYou are not the reason she did anything other than be broken hearted but damn near everyone experiences heartbreak in their lives. She should have been able to move on from that and you should be able to move on from this. It's not your fault.",
      "created_utc": 1743088539.0,
      "score": -7
    },
    {
      "id": "mk1ly1x",
      "body": "Exact same thing happened to me bro, I wasn't trying to kill myself because mom yelled at me for not cleaning my room, I tried because of the crippling depression",
      "created_utc": 1743096070.0,
      "score": 27
    },
    {
      "id": "mjy2s91",
      "body": "This is the answer. OP - I hate cheaters. I’ve been cheated on many times. So take it from me when I say - you don’t deserve to beat yourself up over this or take this on yourself for the rest of your life. And it’s not fair of your family to pile the guilt on you either. That was *her* choice. Forgive yourself and release the guilt. And move through life with compassion and more empathy/maturity.",
      "created_utc": 1743041807.0,
      "score": 113
    },
    {
      "id": "mk72y3x",
      "body": "Agreed with the message. Honestly, I have some empathy for those that do suicide and have MH issues — even if they’re ones someone knows about but doesn’t really do something about (😖), but look, OP, you’re not at fault and you did not kill her. Be kind to yourself; cut yourself some slack.\n\nLiterally, suicide means “self” and “kill”. She might have felt like she had no choice (or she may not have felt like there were no other options), but there really are other options.\n\nInfidelity sucks, but was and is up to you and was up to your then-girlfriend to do whatever to try to work thru it, for whatever desired outcome (thru it and be a couple, thru it and not).",
      "created_utc": 1743174744.0,
      "score": 1
    },
    {
      "id": "mjy0zec",
      "body": "[deleted]",
      "created_utc": 1743041157.0,
      "score": 2
    },
    {
      "id": "mjxwwsx",
      "body": ">You were the brick that broke the camel’s back. I say brick instead of straw because what you did was heavy and would break anyone’s heart.  I don’t know how to say this properly but people who kill themselves have a long list of things they feel they can’t escape. I can almost guarantee that you were not the sole reason.\n\nI really like the way you put this",
      "created_utc": 1743039738.0,
      "score": 53
    },
    {
      "id": "mjycmxu",
      "body": "Beautifully put🙌",
      "created_utc": 1743045587.0,
      "score": 4
    },
    {
      "id": "mjybk8c",
      "body": "i cried reading this comment",
      "created_utc": 1743045153.0,
      "score": 23
    },
    {
      "id": "mk1uykz",
      "body": "This is honestly the perfect response",
      "created_utc": 1743098584.0,
      "score": 3
    },
    {
      "id": "mk3k7aj",
      "body": "Yep, this",
      "created_utc": 1743119510.0,
      "score": 2
    },
    {
      "id": "mkdc9iy",
      "body": "I just wanna die already I can't deal with this lifestyle anymore",
      "created_utc": 1743262950.0,
      "score": 2
    },
    {
      "id": "mmzuzjg",
      "body": "Exactly. OP's situation is exactly why you don't do this to people. It's truly life-ruining. Don't be hand that shoves someone over the ledge.",
      "created_utc": 1744595947.0,
      "score": 3
    },
    {
      "id": "mk3nfxa",
      "body": "Facts",
      "created_utc": 1743120568.0,
      "score": 8
    },
    {
      "id": "mt3os0l",
      "body": "I’m sorry but this is so wrong. This post is about his guilt, and how it far outweighs the fact that he cheated - that’s the whole point. This isn’t “hey I cheated please help me feel better”, someone took their lives and now the entire blame falls on this persons shoulders. It’s about helping him understand exactly what to be remorseful about, and what not to be. \n\nHe obviously feels remorse, so I’m not sure what you hoped to achieve with this apart from furthering the delusion that he was entirely responsible for her suicide",
      "created_utc": 1747652599.0,
      "score": 1
    },
    {
      "id": "mmzvd5e",
      "body": "Betrayal trauma is one of the worst and most destabilizing experiences a person can have. Cheating IS abuse.",
      "created_utc": 1744596094.0,
      "score": 5
    },
    {
      "id": "mk81jm0",
      "body": "There’s a ton of people that commit suicide after cheating . My bro killed himself and his kids",
      "created_utc": 1743184742.0,
      "score": 3
    },
    {
      "id": "mjyfxkx",
      "body": "People*** regardless of genre.",
      "created_utc": 1743046966.0,
      "score": 3
    },
    {
      "id": "mjyirji",
      "body": "why are you even here if you’re just going to be hateful towards someone who is struggling?",
      "created_utc": 1743048210.0,
      "score": 2
    },
    {
      "id": "mjyfvie",
      "body": "i already said i fucked up by cheating i’d take it back if i knew she was gonna kill herself. do i deserve to be attacked anytime im alone though? did i deserve to be put in the hospital? there is genuinely nothing worth living for because anytime i leave my house i either get attacked or get dirty looks. i have no peace over a mistake that i wish i never fucking made. i miss her and i wish i could take back what i did but i fucking can’t alright",
      "created_utc": 1743046942.0,
      "score": -2
    },
    {
      "id": "mk344d4",
      "body": "not everyone is the same or react the same to trauma",
      "created_utc": 1743114548.0,
      "score": 8
    },
    {
      "id": "mjz63w9",
      "body": "Right? If everyone who was cheated on took their own life, I doubt there would be billions of us.",
      "created_utc": 1743061633.0,
      "score": -6
    },
    {
      "id": "mjxiybx",
      "body": "[removed]",
      "created_utc": 1743034900.0,
      "score": 12
    },
    {
      "id": "mk4g83c",
      "body": "Blaming this on the dead girl is so wild",
      "created_utc": 1743130477.0,
      "score": 2
    },
    {
      "id": "mjyghm6",
      "body": "[removed]",
      "created_utc": 1743047209.0,
      "score": 0
    },
    {
      "id": "mjxxbzk",
      "body": "What the actual fuck is wrong with you?",
      "created_utc": 1743039885.0,
      "score": 1
    },
    {
      "id": "mjybh7u",
      "body": "I agree what OP did isn’t right but I have seen stories where peoples suicide is the fault of other people this is not one of those stories. Those type of stories have a whole history filled with abuse and setting setting up an environment to wear a person cannot cope and fill as they only are left with one option weather true or not and let me say I have seen instances where they really had no other option other than suffering, but that’s rare and regardless neither situation is the case it seems from continued abuse to creating toxicity in a deep seeded long term way, maybe I’m assuming but I agree with everyone that she probably had a long list of reasons and this was just the push she needed to decide to do it, and when I say she needed I mean the reason she latched onto to justify the act",
      "created_utc": 1743045119.0,
      "score": 16
    },
    {
      "id": "mjyatp0",
      "body": "I am not sure that’s what the person was doing I think she was trying to reframe the ordeal as a lesson to move forward as some people who can’t see themselves as a better person may need to reframe the situation in a way where they can work on it instead of beating themselves up, there are multiple approaches and this one may or may not resonate with op",
      "created_utc": 1743044859.0,
      "score": 7
    },
    {
      "id": "mk81wjo",
      "body": "I’m sorry to hear that I hope somehow someway he and his kids have found peace but I don’t think it was just cheating , for cheating to push you over the edge ! You were probably already dealing with some shit.",
      "created_utc": 1743184844.0,
      "score": 1
    },
    {
      "id": "mk4vnpb",
      "body": "Do you live in your ideal city/state?\n\nMy ex actually went through something similar. She was married and he did it in front of her, and a lot of people blamed her, including her parents and his.\n\nShe moved to a new city.\n\nShe is doing better now, but it is still very hard.",
      "created_utc": 1743136953.0,
      "score": 2
    },
    {
      "id": "mjxkcer",
      "body": "[removed]",
      "created_utc": 1743035370.0,
      "score": -4
    },
    {
      "id": "mk4iczs",
      "body": "Read the pinned reply by the mod.  They said it better then I did.  \n\nUsing blame is such a hard word, we're responsible for our own actions and reactions.  It doesn't make what happens to us in life fair.\n\nTry not to be to hard on anyone.",
      "created_utc": 1743131293.0,
      "score": 1
    },
    {
      "id": "mjygxkb",
      "body": "[removed]",
      "created_utc": 1743047400.0,
      "score": 1
    },
    {
      "id": "mk82cyp",
      "body": "Thanks for your comment. But It doesn’t matter if you think it was from cheating or not, what happened was he was cheated on and killed himself and his kids.",
      "created_utc": 1743184978.0,
      "score": 2
    },
    {
      "id": "mjxvbyq",
      "body": "[removed]",
      "created_utc": 1743039178.0,
      "score": 6
    },
    {
      "id": "mk4imnr",
      "body": "Surely you can agree that he must of known by putting his dick in someone else she wouldn’t be happy. Yet he still did it lol. Don’t understand why there’s so much sympathy",
      "created_utc": 1743131399.0,
      "score": 4
    }
  ]
}