{
  "id": "1dgbj2h",
  "title": "I am getting married in 2 months, I want to kill myself before it happens",
  "selftext": "A marriage I don't like \n\nA life I don't want\n\nMy parents who are dead\n\nRelatives who act as didn't hear when I tell I am suicidal \n\n\nLived whole life trying to please others , always self doubting , always careful to not cross line.\n\nI don't want to live like a coward anymore. I want to be brave and take decision for myself now and the first thing I want to do is break this marriage , I can only achieve it by being dead\n\n\nEdit : thank you all for your supporting words. Yesterday night I talked with my sister in law about this . How I am suffering and how suicidal I am. Sh was understanding and said kind words, told I should start sharing if I felt like that. I shared how i am not able to get along with him, and she said she understood and told me i should have shared sooner. I felt very relived. I slept peacefullyafter a long time. Today morning she is acting like nothing happened, talking about marriage plans like how we should check out community hall for pre wedding functions, rent a bus for grooms guests,  talking about post marriage things. Talking as if yesterday didn't happen\n\nI'm going crazy, what did I do wrong ? Maybe I was right all along , only death can get me out of this madness\n",
  "created_utc": 1718432311.0,
  "score": 920,
  "num_comments": 165,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1dgbj2h/i_am_getting_married_in_2_months_i_want_to_kill/",
  "comments": [
    {
      "id": "l8p3k1x",
      "body": "Collect some money and run away that's the only way to spend your life peacefully.",
      "created_utc": 1718436233.0,
      "score": 679
    },
    {
      "id": "l8oz9tt",
      "body": "No offence, but are you from India?",
      "created_utc": 1718433166.0,
      "score": 581
    },
    {
      "id": "l8pfh4c",
      "body": "There is organisations that maybe are able to help you.\n\n[forced marriage help](https://sakhi.org/forced-marriage/)\n\n[legal advice india](https://www.legalserviceindia.com/legal/article-3584-family-pressure-of-marriage-on-daughter-and-indian-laws-.html)\n\n[get help - forced/arranged marriage](https://preventforcedmarriage.org/get-help/)",
      "created_utc": 1718445403.0,
      "score": 141
    },
    {
      "id": "l8p7w6l",
      "body": "Collapse at the wedding.\nDo anything scream or stay mute OR would this behaviour get you locked up?\n\nI would scream and scream but I do not know the consequences. \n\nOr can you say NO and tell them to start again.\nIt gives you a chance when if they look for a 2nd match?\n\nYour husband to be is not listening to you which shows he never will.\n\nI feel wretched for you.",
      "created_utc": 1718439500.0,
      "score": 109
    },
    {
      "id": "l8p3gbv",
      "body": "You must be from India A place where they love forcing people to spend their entire life with strangers and call it marriage. Sadly I'm from that hell too.",
      "created_utc": 1718436157.0,
      "score": 251
    },
    {
      "id": "l8p7ch4",
      "body": "bro im from india too,i dont know what state ur from but, if the groom is understanding , maybe he will let u break the marriage",
      "created_utc": 1718439072.0,
      "score": 73
    },
    {
      "id": "l8p7xij",
      "body": "[deleted]",
      "created_utc": 1718439529.0,
      "score": 121
    },
    {
      "id": "l8pbpqv",
      "body": "If you ever want to move to the states I have a spare room in AZ and can use a friend while I deal with my husbands medical stuff. No one should be forced into a marriage. It should be an equal loving partnership, not a business arrangement. I'm sorry you're feeling this way and dealing with all this. Life is hard enough without expectations of others being dumped on you.",
      "created_utc": 1718442440.0,
      "score": 46
    },
    {
      "id": "l8qinew",
      "body": "pardon my ignorance, but as someone who comes from a culture that still practices the \"arranged marriage\" tradition, there's something I don't understand. your parents have passed away, and you're an adult, so who or what is exactly pushing this marriage on you? also, what's the worst scenario possible if you absolutely refuse and just don't go through with it?",
      "created_utc": 1718466417.0,
      "score": 18
    },
    {
      "id": "l8p9oct",
      "body": "Do you know anyone who's ever escaped a marriage? Or managed to get out of it/get away before it happened?\n\nMy heart breaks for you, this is a totally unjust & unfair position to be in",
      "created_utc": 1718440873.0,
      "score": 13
    },
    {
      "id": "l8p4z4i",
      "body": "I think we should do something to help OP here. I've seen countless lives getting destroyed because of forced marriages.",
      "created_utc": 1718437283.0,
      "score": 41
    },
    {
      "id": "l8p9rjz",
      "body": "[removed]",
      "created_utc": 1718440942.0,
      "score": 37
    },
    {
      "id": "l8p8i7u",
      "body": "Sell your stuff, abandon everyone and come to Brazil. I not kidding.",
      "created_utc": 1718439970.0,
      "score": 43
    },
    {
      "id": "l8pyq0q",
      "body": "Run, don't die. Just get on the first bus or plane for anywhere, unless you are a girl living under Sharia law. That would be my re difficult.",
      "created_utc": 1718457216.0,
      "score": 10
    },
    {
      "id": "l8pftg8",
      "body": "Running away is your best bet, it seems like authorities don't care too much about this so just find some sort of shelter and community, and leave them.",
      "created_utc": 1718445679.0,
      "score": 9
    },
    {
      "id": "l8qc64w",
      "body": "Don't they give the women in india gold jewelry before marriage? Sell it and run away! Screw all of these people you don't owe them anything it's YOUR LIFE! Be brave and run away from them, don't let them force you into this!!!",
      "created_utc": 1718463605.0,
      "score": 10
    },
    {
      "id": "l8q2zao",
      "body": "Ok, you need a plan. Do you have funds? A job? Are you able to immigrate to another country? Do you qualify for asylum? Is there a US embassy nearby you can get to to ask these questions? \n\nYou already at least type good English so that’s going for you. There are programs you can apply to to teach English in foreign countries as a means of providing for yourself. \n\nI know you feel stuck and I’d wager that’s the majority of the reason your suicidal ideation is ramping up right now. \n\nYou have to get out of there. Is there a friend you can stay with? Can you get a job serving as a hostess on a plane or a travel ship? Do what you have to do.",
      "created_utc": 1718459378.0,
      "score": 8
    },
    {
      "id": "l8oyecx",
      "body": "You don't have to get married. My friends have broken it off right before and they were so so so glad they did. Are you worried about what your family will think?",
      "created_utc": 1718432556.0,
      "score": 37
    },
    {
      "id": "l8pvn3r",
      "body": "Ugh I’m sorry OP, I hope that you can escape instead of suicide. I feel like this must be a common response to the situation and I hate that this is going on. Is there anything we can do to help?",
      "created_utc": 1718455631.0,
      "score": 5
    },
    {
      "id": "l8q502w",
      "body": "Rage for your life my friend. I’m 36 and I’m just now learning to live for me. Suicidal since I was 4 years old. There’s so much to see, and feel, and suffering comes and goes. Piss people off. It starts to feel good. I’m here for you if you ever need to talk to a friend and get encouragement. Screw your dumbass family. Anyone who doesn’t want you happy can eat crap and crap crap and eat recrapped crap.",
      "created_utc": 1718460351.0,
      "score": 5
    },
    {
      "id": "l8p8pes",
      "body": "Can I ask what would happen if you were to say no you don't want to get married and then block everyone from your life? What would happen? Do you have the option to move?",
      "created_utc": 1718440126.0,
      "score": 9
    },
    {
      "id": "l8q08o9",
      "body": "Op do you have any money or anything of value you could sell that's just enough to get a ticket to a city with a women's charity? I realise that may not be a most viable option, and to minimise suspicion you'd make on your name in the meanwhile, There is also a group on Facebook called host a sister, where you may be able to try and look for some help and support, it's a genuine women supporting women group and they could most likely help you get out. I've seen women band together to offer funds to help girls get out of situations, and women who own women's charities in there too, it's a global thing, they also do holiday hosting and stuff it's a really diverse group. I recommend you join and ask for advice there",
      "created_utc": 1718458005.0,
      "score": 5
    },
    {
      "id": "l8q8hct",
      "body": "If you’re planning to die anyway, you might as well try your best to run away before you do. You’d be able to pretty much start a new life or get rid of your shitty circumstance. It’s atleast worth a shot rather than giving up. You can achieve a broken marriage in many other ways than death. I’m really sorry this is happening and hope you can get out of your situation",
      "created_utc": 1718461963.0,
      "score": 4
    },
    {
      "id": "l8pefoz",
      "body": "I feel so bad for your situation.. And this is why I’m so afraid to go through the  arranged route. It seems like All the participants involved are just people pleasing their parents, society or fulfilling an obligation that has nothing to do with me or love and the partner you get is riddled with trauma. It’s a trap, sham and a con. I’ll pray for you, don’t lose hope 🙏🙏🙏",
      "created_utc": 1718444547.0,
      "score": 6
    },
    {
      "id": "l8p4wnz",
      "body": "I don’t know much about India, could you emigrate to another country and start a new life?",
      "created_utc": 1718437233.0,
      "score": 8
    },
    {
      "id": "l8pzknt",
      "body": "It’s not worth ending your life. At least try to run away, yeah? Find yourself a way out that isn’t death.",
      "created_utc": 1718457660.0,
      "score": 3
    },
    {
      "id": "l8qtqu7",
      "body": "If your parents are not here then who TF is forcing you to get married. It's no one else's right to force' you rather than your parents. Just tell the truth to your partner and called off the wedding. Get a new job in new City meet new people there. Eventually you will meet your soulmate soon and  I bet there is some one out there for you. You can happily get marry to that person with your saving and with support of your closed ones. I think it's better than dying let's give it a try we are all here for you .",
      "created_utc": 1718470989.0,
      "score": 3
    },
    {
      "id": "l8qw7b1",
      "body": "I’m assuming you have limited access to money and opportunities in your current situation. Do you have a friend in a nearby city you can escape too? Faking an illness just prolongs the anxiety and stress. Leaving a note and describing your feelings is a declaration of how you feel and no one can try to convince you otherwise because you’re not there!",
      "created_utc": 1718471970.0,
      "score": 3
    },
    {
      "id": "l8pa8r8",
      "body": "That shit sucks. But move on as you are young you know? I suck at giving advices cuz it's all evil, that what I do in the exchange of dying so",
      "created_utc": 1718441305.0,
      "score": 5
    },
    {
      "id": "l8pkqtk",
      "body": "I’ve read your past posts and you don’t sound like a person who wants to die, you are a person who doesn’t want a marriage. Dying is going to get you put of the marriage for sure, but there have to be other ways. \n\nI know that in your country, it is difficult to get out, but we are talking death here… I mean, no matter how difficult getting out might be, it cannot be more difficult than actually dying, can it? \n\nMaybe sleep with someone and make sure your and husband family find out, probably you will not be a candidate for an arranged marriage for a while and despite the difficulties that this could generate it would buy you time to find your way to a different place.",
      "created_utc": 1718449351.0,
      "score": 5
    },
    {
      "id": "l8p3n1t",
      "body": "First stand up for yourself, tell them outright that you donot like the person or donot want to marry. tell them what you want.\n\nIf they still force you, contact other relatives who will understand you or contact women cell of police. They will help you.",
      "created_utc": 1718436293.0,
      "score": 8
    },
    {
      "id": "l8qq2np",
      "body": "What if you just refuse to go to the wedding? Or refuse to participate? Have a massive breakdown at the wedding and start acting insane or something? Make it to where he doesn’t want to marry you.",
      "created_utc": 1718469527.0,
      "score": 2
    },
    {
      "id": "l8quxvz",
      "body": "Everybody is coming with alternatives that don’t help at all, but only you can make the choice you feel is best.",
      "created_utc": 1718471468.0,
      "score": 2
    },
    {
      "id": "l8ticob",
      "body": "If I were in your situation I’d get and save as much money as I could and pack all my valuables in a bad and run away, start a new life for yourself it will be difficult at times but it gets easier and easier, find a job and a place to stay and start from there, it’s your life you do what the hell you want don’t let anyone take control of YOUR life",
      "created_utc": 1718512732.0,
      "score": 2
    },
    {
      "id": "l8tv23j",
      "body": "From what I am reading in this thread it looks like this is a tricky situation to escape in your country. I am hoping so very much that you will be able to escape the marriage (if it is not right for you), and start a new life altogether somewhere else where you can be yourself. One thing I have learned in my 40yrs of life...trust your gut instinct/intuition! Whenever I ignored my intuition because other people in society told me I was wrong, or it just logically did not make sense...I paid dearly for it!! Whenever I have listened to my intuition, it has been totally correct, and I was thankful I listened to it! My hope for you is that you will trust that voice deep inside of you, your intuition, and that you will be able to act on it and live the life you think God put you here to live (whatever that means for you). Will be sending you hope and prayers from the USA.",
      "created_utc": 1718520823.0,
      "score": 2
    },
    {
      "id": "lcn2wxr",
      "body": "I'm so so so so sorry for you. Fuck I felt this one like no other. Girl I'm indian too. We women are nothing more than commodity here. Saw your posts about bangalore.",
      "created_utc": 1720682051.0,
      "score": 2
    },
    {
      "id": "l8qdu6f",
      "body": "https://news.un.org/en/story/2022/09/1126421?_gl=1*1xm1dk*_ga*MTgyMzk0OTE2MS4xNzE4Mzg1ODg5*_ga_TK9BQL5X7Z*MTcxODQ2NDI1Mi4yLjAuMTcxODQ2NDI1Mi4wLjAuMA..\n\n#forced marriage is considered a form of modern slavery",
      "created_utc": 1718464343.0,
      "score": 4
    },
    {
      "id": "l8pkjtr",
      "body": "[deleted]",
      "created_utc": 1718449222.0,
      "score": 1
    },
    {
      "id": "l8pydcr",
      "body": "[removed]",
      "created_utc": 1718457031.0,
      "score": 1
    },
    {
      "id": "l8qngud",
      "body": "Jeez how old are you? If you have money please run away",
      "created_utc": 1718468458.0,
      "score": 1
    },
    {
      "id": "l8qrs5u",
      "body": "Set the venue on fire.",
      "created_utc": 1718470211.0,
      "score": 1
    },
    {
      "id": "l8qu21q",
      "body": "OR just say you have Cancer",
      "created_utc": 1718471113.0,
      "score": 1
    },
    {
      "id": "l8qzqob",
      "body": "Kill the old you. That’s not you anyway. It’s the life you’re living drafted by your surroundings and experiences and expectations of how you should react or act. Screw it. Start living for yourself (prob going to be easier to relocate and make a new nickname), and see how things turn out. \n\nYou don’t have to be any bit of who you don’t want to be in a new place. You don’t in current but it might be harder to do when ppl have expectations of who you are. \n\nThe thing about aging and changing, for some reason, you get set into a certain point with people and it’s difficult to ever be anyone else to that person. Only reason I said somewhere else. ",
      "created_utc": 1718473381.0,
      "score": 1
    },
    {
      "id": "l8r6ez6",
      "body": "no bro. this is your chance to really stop being a coward. reject the marriage. or use them for your benefit obviously they dont really care. but either way this is your real chance to be brave and stop caring about what others think. its truly the best case scenario. you robbed yourself of truly being alive your entire life, if yoyr contentbon offing yourselfvthen your already,\"dead\" so what could blowing thiscentire engagement up do to hurt you? am i wrong? think about it. you got this.",
      "created_utc": 1718476087.0,
      "score": 1
    },
    {
      "id": "l8sbklj",
      "body": "Take that first step and make your own decisions. You have so much left to accomplish. Don’t give up. You’re your own woman.",
      "created_utc": 1718492555.0,
      "score": 1
    },
    {
      "id": "l8scwm1",
      "body": "Just escape from India.",
      "created_utc": 1718493140.0,
      "score": 1
    },
    {
      "id": "l8shh0s",
      "body": "OP, please try to find some resources that will help you out of this situation safely. \n\nsomeone linked a few in this thread but to add to them: https://sakhi.org/forced-marriage/ sakhi is located in the US, but they offer help to people internationally and might be able to connect you with someone in india that will help you out",
      "created_utc": 1718495132.0,
      "score": 1
    },
    {
      "id": "l8vurfb",
      "body": "[removed]",
      "created_utc": 1718558436.0,
      "score": 1
    },
    {
      "id": "l8p3odo",
      "body": "You should channel that feelings to them, courage is standing up for yourself and fighting.",
      "created_utc": 1718436322.0,
      "score": 1
    },
    {
      "id": "l8qjuvg",
      "body": "Where do you live that you have to get married?",
      "created_utc": 1718466919.0,
      "score": 0
    },
    {
      "id": "l8pyxgn",
      "body": "On another note, get rid of your virginity, he mightn't want you any more.",
      "created_utc": 1718457323.0,
      "score": -2
    },
    {
      "id": "l8q57xo",
      "body": "RUN BRO, ESCAPE",
      "created_utc": 1718460454.0,
      "score": -1
    },
    {
      "id": "l8pao5i",
      "body": "Bhai fir aapne haa kyun kiya jb aapko shaadi nhi krni thi to?",
      "created_utc": 1718441637.0,
      "score": -6
    },
    {
      "id": "l8q2tfs",
      "body": "[removed]",
      "created_utc": 1718459299.0,
      "score": -18
    },
    {
      "id": "l8p2l9z",
      "body": "Yes",
      "created_utc": 1718435523.0,
      "score": 431
    },
    {
      "id": "l8qbu5i",
      "body": "The worst thing is that the relatives (or whoever arranged this marriage for her) clearly isn't allowing any rejection that means if the marriage fails then she wouldn't be able to find help from their side either.",
      "created_utc": 1718463459.0,
      "score": 35
    },
    {
      "id": "l8qdro9",
      "body": "I agree, scream and collapse or pretend to be posessed or anything. Then lie in bed and act completely mute and sick. At least the marriage will hopefully be called off because you're unwell. Then family might pity you for your 'illness' and try to take care of you.\n\n(edit, there are similar cases to this you can look up, and it worked for several years at times. One girl pretended to be mute and paralyzed for years to avoid studies. Just saying it’s worth a shot)",
      "created_utc": 1718464313.0,
      "score": 17
    },
    {
      "id": "l8p5cio",
      "body": "Yes that's the way, everyone seems fine with it. Everybody is married that way aunts cousins. Previously I used to think that is how it is. But from the time this match is settled I am feeling suffocated.  Nobody has a issue with it, nobody seem to understand. When I tried to open up, I am getting blamed that why did I say yes to look for matches, why did I not saying anything before. I tried talking to my so called fiance, he said it's a phase I will get over it and I will be happy too because he is happy now. \n\nTrust me,  I tried my best . I am not able to do it anymore. I am too tired . I think the fault lies in me, even my fiance is happy , maybe I am the issue. I tried really hard but how can feelings be developed from trying hard, I just don't match with him at all. I am just done. I don't want this , if this is how my life will be then I rather die",
      "created_utc": 1718437561.0,
      "score": 148
    },
    {
      "id": "l8pd3wp",
      "body": "He thinks things will get alright and I will be happy after marriage. He says he never took a wrong decision in life and hence this decision is right. He says he is sure I will be happy after marriage",
      "created_utc": 1718443513.0,
      "score": 63
    },
    {
      "id": "l8pk4v2",
      "body": "Praying for u friend we all with u and supporting u we want to see u win and have the good positive vibration life u desire.  Please keep trying to live if that means divorcing ur husband choose to leave him rather than end ur life. You will be better off alive and free.",
      "created_utc": 1718448949.0,
      "score": 22
    },
    {
      "id": "l8piqdg",
      "body": "[deleted]",
      "created_utc": 1718447970.0,
      "score": -20
    },
    {
      "id": "l8qqp5u",
      "body": "bless your soul for being so kind hearted and giving 💛",
      "created_utc": 1718469780.0,
      "score": 9
    },
    {
      "id": "l97sqn7",
      "body": "ive heard some things where the bride is literally set on fire by the mother in law because shes poor or not good enough",
      "created_utc": 1718745694.0,
      "score": 1
    },
    {
      "id": "l8p7cxp",
      "body": "What would you suggest? It’s extremely difficult for women to escape the culture in places like India, if we’re being realistic.",
      "created_utc": 1718439082.0,
      "score": 44
    },
    {
      "id": "l8pwfeh",
      "body": "I wonder if we talked about it on social media, if we could crowdfund enough money to get her a ticket to another country. Someone already said they have an extra room in the US if they want to go this far. We have two months, I could see that working. Especially if we did research and tried to figure out how common it is to commit suicide when faced with this.",
      "created_utc": 1718456040.0,
      "score": 12
    },
    {
      "id": "l8plhtr",
      "body": "It's india bro, if she's from a tier 1 city then there are ngos who support woman like op. But if she isn't from a major city than there isn't much she can do.",
      "created_utc": 1718449824.0,
      "score": 21
    },
    {
      "id": "l8pelgg",
      "body": "Also curious of why Brazil?",
      "created_utc": 1718444678.0,
      "score": 25
    },
    {
      "id": "l8pczv9",
      "body": "why Brazil 🇧🇷",
      "created_utc": 1718443435.0,
      "score": 21
    },
    {
      "id": "l8qxy1q",
      "body": "Why Brazil?",
      "created_utc": 1718472670.0,
      "score": 3
    },
    {
      "id": "l99t5up",
      "body": "Shariah law cant force a woman to marry someone",
      "created_utc": 1718777767.0,
      "score": 1
    },
    {
      "id": "l8r3jjl",
      "body": "Secure all your documents, birth certificate, social security documents, death certificates of your parents, work permits, diplomas, passports, visas and as much cash as you can get.\nRun anywhere and start over. Be safe.",
      "created_utc": 1718474915.0,
      "score": 4
    },
    {
      "id": "l8smr0c",
      "body": "This. I'd also say, Germany is a very good country to immigrate too. If OP can make it just with a tourist visa to this country, she can apply for aslyum and it's very well known, Germany offers asylum to almost everyone. All she needs to say is that there is an arranged marriage and that if she doesn't agree with the marriage, her life would be in danger (no matter if it is really this way, that someone like relatives would kill her or not).\n\nIf she gets asyl, she'd get a new start in life. She could take courses to learn the language for free, she already can speak english so it won't be that difficult. \n\nIt is better to at least try to run away and get out of India, before she goes through with the final decision of suicide. Because, there's nothing she can lose anymore.\n\nWhen it works out with asyl, then there's an entire new world and life open to her. She could live in freedom, get a job, get a home and choose the partner she wants to be with.",
      "created_utc": 1718497488.0,
      "score": 2
    },
    {
      "id": "l8p52hn",
      "body": "It will cost a lot of money, I think OP should run away too. If not another country then another city or another state",
      "created_utc": 1718437350.0,
      "score": 18
    },
    {
      "id": "l8p95ob",
      "body": "The corrupt police in India will help? Pass a few rupees their way and they’ll walk OP down the aisle themselves.",
      "created_utc": 1718440478.0,
      "score": 18
    },
    {
      "id": "lcn2z76",
      "body": "Hope it's you moving alone. God I hope the marraige doesn't pan out. You don't deserve that fate.",
      "created_utc": 1720682092.0,
      "score": 2
    },
    {
      "id": "l8pnefm",
      "body": "Her parents passed away",
      "created_utc": 1718450998.0,
      "score": 2
    },
    {
      "id": "l8pyg82",
      "body": "Move in with them*",
      "created_utc": 1718457072.0,
      "score": 1
    },
    {
      "id": "l8xvxj9",
      "body": "Is it family pressure or the pressure I put upon myself",
      "created_utc": 1718587780.0,
      "score": 1
    },
    {
      "id": "l8p5kto",
      "body": "Doesn't work out that way in arranged marriages especially with all extended families involved. If I want to be heard and not shut down when I raise the issue, the only way is proving my point through death.",
      "created_utc": 1718437732.0,
      "score": 12
    },
    {
      "id": "l8pzutq",
      "body": "That could get op honour Unalived.",
      "created_utc": 1718457808.0,
      "score": 6
    },
    {
      "id": "l8q7oc3",
      "body": "Stop forcing your religion onto others. This isn’t about religion. It’s culture. They may like whatever faith they are. Arranged marriages exist in Christian families too. You only have to look at which American states allow child marriage still and see that it’s prevalent in Christianity.",
      "created_utc": 1718461594.0,
      "score": 13
    },
    {
      "id": "l8p6ent",
      "body": "I have just looked into your account. I'm sorry for what you are going through, but there is always hope even if you disagree. For starters, are you doing any job or are you willing to. If yes then I think it's not hard to find a solution. Anyhow me and many good fellas are here if you wanna talk.",
      "created_utc": 1718438358.0,
      "score": 298
    },
    {
      "id": "l8pij70",
      "body": "I’m from Sydney, Australia. Completely Caucasian, and I felt the same way before getting married. Fuck the money already spent. Just cancel everything. Then End the engagement and have a plan for Independence and socialisation. It can happens to anyone. It’s not going to end well if you marry this person.",
      "created_utc": 1718447817.0,
      "score": 109
    },
    {
      "id": "l8pchva",
      "body": "Where are you from",
      "created_utc": 1718443058.0,
      "score": 11
    },
    {
      "id": "l8p5r2f",
      "body": "You are not the issue here. It's your life you should get to decide with which person you have to spend your life with.\nIf you are educated and have a degree just run away with your documents and degree and start a life away from that toxic environment.",
      "created_utc": 1718437863.0,
      "score": 114
    },
    {
      "id": "l8qkwqj",
      "body": "How soon is the wedding set for?\n\nIf your situation is that dire and the only alternative you feel you have is death, start gathering whatever mine and possession you can, get yourself a train ticket, or maybe a flight somewhere, and just go. If things truly *need* to change, death is not the only change available to you.\n\nI know it's not *nearly* as simple as that makes it sound, but if you're already considered the far more drastic change of suicide, then fully uprooting your life may be worth a try. Especially when most of the factors you list as bringing you down are directly related to your current position in life, and it sounds as though there isn't much still tying you to home. Maybe try researching other countries with the easiest paths to immigration or seeking asylum. Do you have any relatives or people you know living in other countries you could go stay with?",
      "created_utc": 1718467361.0,
      "score": 7
    },
    {
      "id": "l8q4u11",
      "body": "Could you move to another place? Start a new life? What happens if you call off the wedding?",
      "created_utc": 1718460271.0,
      "score": 4
    },
    {
      "id": "l8q5k36",
      "body": "there are companies in india (i know you are from that country cus you’ve mentioned it before) that help you with you love life. look it up cus i dont really know what theyre called but try contacting them and see if they are willing to help you. i hope you are doing okay and please be safe <3. i will pray for you",
      "created_utc": 1718460614.0,
      "score": 2
    },
    {
      "id": "l8pdr8h",
      "body": "You don't have to agree with me or my faith in God (I'm a Christian from the UK). But I will pray to my God for a change in circumstances for you. \nI understand that many don't believe in the Christian God and Jesus, but I will say a prayer for you now anyway. \n\nI hope things get better for you.",
      "created_utc": 1718443976.0,
      "score": 16
    },
    {
      "id": "l8pqd0l",
      "body": "just dont do anything silly ok... im sure youll be alright wheter the marriage happens or not.. just stay calm and dont jump into conclusion",
      "created_utc": 1718452727.0,
      "score": -31
    },
    {
      "id": "l8plcrv",
      "body": "Depends on legality of divorce and ease of getting a divorce. Some countries still criminalize the woman for seeking a divorce against the will of the man.",
      "created_utc": 1718449735.0,
      "score": 29
    },
    {
      "id": "l8qbx8c",
      "body": "No fault divorce is illegal in India",
      "created_utc": 1718463496.0,
      "score": 6
    },
    {
      "id": "l8p7gje",
      "body": "Police support can help and OP should post about this in other social media too",
      "created_utc": 1718439159.0,
      "score": -28
    },
    {
      "id": "l9lawrv",
      "body": "Maybe not, but it can make it very hard for her to get away, get a passport or become financially independent without the consent of her father/husband.",
      "created_utc": 1718961680.0,
      "score": 1
    },
    {
      "id": "l8qrroz",
      "body": "What about being a refugee? I don’t think it’s a bad idea if she has enough proofs like official wedding dates or photo, but I’m not sure",
      "created_utc": 1718470206.0,
      "score": 1
    },
    {
      "id": "l8pbjaa",
      "body": "If you aren't close to your parents and relatives anyway fuck them. Do you have money and your documents under your name? You don't have to explain anything if you just up and leave. Let them figure it out by themselves",
      "created_utc": 1718442304.0,
      "score": 3
    },
    {
      "id": "l8p5poh",
      "body": "I am not judging or mean anything disrespectful by asking this. And I do not consider hurting anyone a solution or something you should do. But, why do you choose to hurt yourself and not them?",
      "created_utc": 1718437834.0,
      "score": -4
    },
    {
      "id": "l9laq1g",
      "body": "True. She really is in a difficult situation. Getting a passport to flee the country is not easy without parental consent in some countries either.",
      "created_utc": 1718961542.0,
      "score": 1
    },
    {
      "id": "l8qaag5",
      "body": "It’s an arranged marriage and they literally can’t cancel it",
      "created_utc": 1718462777.0,
      "score": 91
    },
    {
      "id": "l8qbi7y",
      "body": "It actually doesn't matter . Arranged and forced marriages are a big thing in every state in India . It's hard for both men and women but mostly unemployed women .",
      "created_utc": 1718463313.0,
      "score": 22
    },
    {
      "id": "l8pxgp9",
      "body": "Why did this get downvoted? But the guy asking if they are from India got 205 upvotes?",
      "created_utc": 1718456561.0,
      "score": 32
    },
    {
      "id": "l8pwh3q",
      "body": "God is the reason why women are forced to marry men they don’t love, it’s so sad to see but sweet of you to think it will help. But if god did exist , issues like these wouldn’t exist.",
      "created_utc": 1718456063.0,
      "score": 57
    },
    {
      "id": "l8q4000",
      "body": "Are people in this position (let’s be honest, by “people” I mean women because that’s who gets fucked by this) able to apply for asylum? Because if she refuses to marry don’t they murder women over there for daring to do what they want?",
      "created_utc": 1718459872.0,
      "score": 10
    },
    {
      "id": "l8p8fcd",
      "body": "police aint gonna do shit here,all the cops in my town are corrupted",
      "created_utc": 1718439910.0,
      "score": 50
    },
    {
      "id": "l8p80uc",
      "body": "*That’s* your solution? You **we** could do something for OP and you’ve answered with (unrealistic) things OP could do for themselves.",
      "created_utc": 1718439599.0,
      "score": 23
    },
    {
      "id": "l9laz2a",
      "body": "Well no, that wouldnt be shariah that would be whatever the local law is.",
      "created_utc": 1718961728.0,
      "score": 2
    },
    {
      "id": "l8p69rc",
      "body": "It's considered normal here bro. Force people to marriage and when anything goes south they put blame on you.",
      "created_utc": 1718438251.0,
      "score": 17
    },
    {
      "id": "l8qqg60",
      "body": "Why?",
      "created_utc": 1718469678.0,
      "score": 6
    },
    {
      "id": "l8pxlqm",
      "body": "Seriously idk bro 🫠",
      "created_utc": 1718456631.0,
      "score": 34
    },
    {
      "id": "l8q45zn",
      "body": "I think they're saying \"read\"",
      "created_utc": 1718459952.0,
      "score": 22
    },
    {
      "id": "l8qqcjw",
      "body": "Probably because that one said “No offense” lol.",
      "created_utc": 1718469637.0,
      "score": -2
    },
    {
      "id": "l8rbmmz",
      "body": "God isn't the reason. It's people. People are the problem. We like to make up a bunch of rules and say God did it.",
      "created_utc": 1718478155.0,
      "score": 6
    },
    {
      "id": "l8qzn0n",
      "body": "The Christian teaching doesn't teach that at all. God allows free will. He doesn't force people to marry people they don't love. And He doesn't force people to be someone they're not! That would be stupid. Creating people with different personalities and skill and so on, and then making them be someone else? Ridiculous idea!",
      "created_utc": 1718473341.0,
      "score": 3
    },
    {
      "id": "l8q61l9",
      "body": "Yeah gtfo with that",
      "created_utc": 1718460842.0,
      "score": -1
    },
    {
      "id": "l8q2gvf",
      "body": "[removed]",
      "created_utc": 1718459126.0,
      "score": -24
    },
    {
      "id": "l8q4zc4",
      "body": "Not necessarily murder, as a lot of countries have other options. As far as asylum goes, it's always tricky. You're really at the discretion of the closest safe country in that regard. Trying to move further than is considered \"safe\" just gets you deemed an illegal immigrant usually, and the nearby safe countries may only be moderately an improvement if even that. It also means you have to find a way to seek asylum, usually through an embassy in the country you reach.",
      "created_utc": 1718460340.0,
      "score": 4
    },
    {
      "id": "l8p8twr",
      "body": "They have a good heart but ignorant to the situation unfortunately.",
      "created_utc": 1718440224.0,
      "score": 13
    },
    {
      "id": "l8p84i0",
      "body": "Will spreading this post on social media help it gain mainstream attention ?",
      "created_utc": 1718439678.0,
      "score": -11
    },
    {
      "id": "l8v0l55",
      "body": "That is not my question. The question is why channel it on herself",
      "created_utc": 1718546692.0,
      "score": 1
    },
    {
      "id": "l8qqp31",
      "body": "People have been killed in india for less",
      "created_utc": 1718469779.0,
      "score": 68
    },
    {
      "id": "l8wt3a9",
      "body": "In the context of Islamic and other far-east religions/customs (Hindu as with India) - a woman refusing an arranged marriage is basically seen as an embarrassment and could lead to a family dispute that could be felt for generations.\n\nThere have been instances of women having battery acid thrown into their faces, being killed for honor, raped, etc if she says no to an arranged marriage. All sorts of horrendous things can happen if the woman refuses. Those countries tend to go by a patriarchal system.\n\nThis is why this woman should run far away and as fast as she can. Possibly to a new country if she can afford it.",
      "created_utc": 1718571256.0,
      "score": 3
    },
    {
      "id": "l8q5cjy",
      "body": "Because I've already asked and op replied about the same",
      "created_utc": 1718460515.0,
      "score": 18
    },
    {
      "id": "l8qc9h0",
      "body": "Bold of you to go on a grieving subreddit and call the people who are suffering \"sinners\".",
      "created_utc": 1718463647.0,
      "score": 29
    },
    {
      "id": "l8p8a9q",
      "body": "No. This situation happens to thousands of women every single day, it’s too common to receive mainstream media attention.",
      "created_utc": 1718439800.0,
      "score": 29
    },
    {
      "id": "l8qzs3s",
      "body": "Who are you referring to here? If it's me. Then you've totally misinterpreted what I'm saying. I've not actually said that at all in my post. \nThat's the thing with any thread on any post on any social media platform... too many people make false assumptions about what Christians believe. You can't comment on something of which you've rarely studied or researched.",
      "created_utc": 1718473396.0,
      "score": -5
    },
    {
      "id": "l8p8dpm",
      "body": "I just want to help OP bro. I can't see someone's life getting destroyed in front of my eyes, can you suggest something ?",
      "created_utc": 1718439874.0,
      "score": 9
    },
    {
      "id": "l8r1d7d",
      "body": "Do you know how threads work ?",
      "created_utc": 1718474023.0,
      "score": 5
    },
    {
      "id": "l8rglbu",
      "body": "Just like Christians don't make false assumptions about atheists. No one needs God in their life but people love to push it.",
      "created_utc": 1718480103.0,
      "score": 1
    },
    {
      "id": "l8pewsd",
      "body": "Yeah we all have good intentions for OP here but India is a whole different game compared to western countries. Over a billion people in India and thousands of forced legal marriages happen everyday, horror stories that would arouse riots in the west never see the light of day because of the sheer scale. \n\nPolice and government won't do anything because its perfectly legal and apart of their culture. Indian police are also known to be super corrupt, like see why scam call centres still exist despite doing it blatantly under police noses. \n\nThis is a situation that us foriegners cannot do much about unfortunately, we can't just go over and enforce our values however righteous it may seem which in this case is clearly more right since that would be colonialism.",
      "created_utc": 1718444940.0,
      "score": 29
    },
    {
      "id": "l8tpkd1",
      "body": "No assumptions re atheists. I have a lot of atheist friends. Some are very close to me and I have a lot of respect for them. Nowhere in any of my posts have I suggested that I am pushing my faith on others. \nAnd the reason people are triggered by people announcing their Christian faith, isn't because we push it on them. It's because they don't want to think about and be challenged by it.",
      "created_utc": 1718517095.0,
      "score": 0
    },
    {
      "id": "l8tt60d",
      "body": "No one asked anything about God or Christianity yet you still brought it up and even though the person isn't Christian you said you would pray for them just in case you weren't aware that in and of itself is pushing it.\n\nBlanket statements don't hold water either. I do actually want to think and be challenged by it because every time I get a chance to hopefully open someone's eyes just a little bit more. God has no place in this conversation that the person posting had started. Yet you felt it pertinent to bring it up.",
      "created_utc": 1718519511.0,
      "score": 1
    }
  ]
}