{
  "id": "1km7b6z",
  "title": "Just swallowed enough pills to kill me",
  "selftext": "I just took enough of a prescribed medicine to kill me. I’m not sure how I feel right now. I have everything written. And the effects haven’t hit me yet. But I know it’ll be rough. I’m not scared. I’m not sure. I guess I just wanted to put it out there that I’m going to die before I do. So yeah. That’s it. \n\nUPDATE: I’m still alive. I ended up just riding it out alone. I took 4 different types of pills. (My antidepressant, abilify, my hdhd medication and a sleeping pill (clonidine) which can cause serious problems when ingested in doses higher than 2mg.) I knocked out shortly after I took everything and I woke up at about 5 (am). I actually didn’t get sick this time (my last attempt I felt like I was dying). As of now I feel weak and disoriented, dizzy and I can’t rlly control my body the way I want to. I don’t think I need a hospital. I’m not going to die. But thought yall deserved an update. ",
  "created_utc": 1747199857.0,
  "score": 609,
  "num_comments": 95,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1km7b6z/just_swallowed_enough_pills_to_kill_me/",
  "comments": [
    {
      "id": "ms80vv8",
      "body": "I did that, did not work, just made me sick",
      "created_utc": 1747200008.0,
      "score": 267
    },
    {
      "id": "ms83msc",
      "body": "I did that, didn’t work. Woke up to my buddy over me telling me to wake up. \n\nI had pissed my pants and had spit all over my shirt and face. Not a good time",
      "created_utc": 1747201480.0,
      "score": 105
    },
    {
      "id": "ms84t2y",
      "body": "Call emergency services. You probably won't die, you'll just be suffering",
      "created_utc": 1747202131.0,
      "score": 247
    },
    {
      "id": "ms875fj",
      "body": "Definitely going to hurt, from someone that has tried, ending up on a breathing tube and strapped to a bed is nightmare fuel",
      "created_utc": 1747203457.0,
      "score": 63
    },
    {
      "id": "ms81klv",
      "body": "Please keep us updated",
      "created_utc": 1747200369.0,
      "score": 59
    },
    {
      "id": "ms81som",
      "body": "Throwing up, head hurt, worse than a hang over, took several types of pills",
      "created_utc": 1747200488.0,
      "score": 51
    },
    {
      "id": "ms84sxp",
      "body": "don’t be scared to call EMS if you change your mind ♥️ nothing shameful about that. i hope, whatever u decide, it ends up well for u.",
      "created_utc": 1747202129.0,
      "score": 31
    },
    {
      "id": "ms8odaf",
      "body": "Hey, I just saw your post. I don’t know what you’re going through, but I need you to hear this:\nPills usually don’t work the way people think. Most of the time, they don’t lead to death, just organ damage, intense pain, vomiting, seizures, or even permanent disability. You might end up in the ICU, on dialysis, or with lifelong liver or brain damage. And that kind of suffering is brutal.\n\nIf your goal is to stop the pain, I promise you, this will likely only add more.",
      "created_utc": 1747214111.0,
      "score": 28
    },
    {
      "id": "ms87dle",
      "body": "I’ve thought of doing this so many times. Please seek help immediately please 🙏 💕",
      "created_utc": 1747203586.0,
      "score": 9
    },
    {
      "id": "ms824fb",
      "body": "What pills?",
      "created_utc": 1747200663.0,
      "score": 17
    },
    {
      "id": "ms881no",
      "body": "I’m so sorry you’ve gotten to this point. \n\nI hope you end up reconsidering and find some help.x",
      "created_utc": 1747203969.0,
      "score": 8
    },
    {
      "id": "ms8eimo",
      "body": "Please call emergency services, you would likely regret it later on.",
      "created_utc": 1747207856.0,
      "score": 8
    },
    {
      "id": "ms8g3si",
      "body": "Did you call 911? Are you okay?",
      "created_utc": 1747208859.0,
      "score": 8
    },
    {
      "id": "ms8apfu",
      "body": "It likely won’t work, it’ll just fuck up your body. I hope you’re ok",
      "created_utc": 1747205537.0,
      "score": 6
    },
    {
      "id": "ms8rdar",
      "body": "still alive?",
      "created_utc": 1747215969.0,
      "score": 6
    },
    {
      "id": "ms84fv8",
      "body": "If you want someone to talk to or just listen I’m here for you sister",
      "created_utc": 1747201926.0,
      "score": 6
    },
    {
      "id": "ms85bd7",
      "body": "Also, the scars will get less and less prominent over time, to the point that you can barely see them.  So if thats a worry of yours, just give it some time.  You have a lot of life left to live.",
      "created_utc": 1747202412.0,
      "score": 9
    },
    {
      "id": "msa6fzs",
      "body": "their peofile is gone i hope they are safe",
      "created_utc": 1747235495.0,
      "score": 3
    },
    {
      "id": "ms851gu",
      "body": "That can be really rough :( ask me how I know...hope you can find help! It's hard to reach out, but it's worth it in the long run.",
      "created_utc": 1747202259.0,
      "score": 4
    },
    {
      "id": "ms87sb5",
      "body": "That won’t work, but it’ll give the worst stomachache of your life",
      "created_utc": 1747203820.0,
      "score": 5
    },
    {
      "id": "ms815kh",
      "body": "You’re too young. Please call 911! ",
      "created_utc": 1747200150.0,
      "score": 5
    },
    {
      "id": "ms9e4ll",
      "body": "If you're physically fit and have no health issues. Don't quit, you could do so much more, you could restart again and again infinite times. Forget the past, try, in your own way to go forward. It will take time, but it will happen. \nWe are all gonna die eventually, there's only one you and only for 1 time, so wanna not give it another try.",
      "created_utc": 1747226460.0,
      "score": 2
    },
    {
      "id": "ms9svp7",
      "body": "please please please tell a friend or close family member what you did",
      "created_utc": 1747231451.0,
      "score": 2
    },
    {
      "id": "msaru7e",
      "body": "I’m glad you’re ok! That’s so scary and definitely can be an extremely painful experience. I had OD a few months ago on my Ambien and Klonopin. It didn’t hurt me thankfully.",
      "created_utc": 1747241640.0,
      "score": 2
    },
    {
      "id": "msgih87",
      "body": "Pills don't work, they just make you feel sick, I thought about pills myself",
      "created_utc": 1747320822.0,
      "score": 2
    },
    {
      "id": "msllwq8",
      "body": "I literally took a whole bottle of Tylenol over the course of a weekend once and it did literally nothing, I just felt sick for a few days.",
      "created_utc": 1747390033.0,
      "score": 2
    },
    {
      "id": "mt48lpc",
      "body": "you still with us?",
      "created_utc": 1747660814.0,
      "score": 2
    },
    {
      "id": "msdfsof",
      "body": "Man I thought I unfollowed this sub Reddit. Ffs",
      "created_utc": 1747271498.0,
      "score": 2
    },
    {
      "id": "ms83kex",
      "body": "Please call 911",
      "created_utc": 1747201445.0,
      "score": 3
    },
    {
      "id": "msd4ond",
      "body": "haven't tried pills, but man.. don't do that to yourself",
      "created_utc": 1747267645.0,
      "score": 1
    },
    {
      "id": "msfbclp",
      "body": "I'm so sorry you got to this point.  Medication OD's are hard to handle in every aspect.  You're not going to feel good at all possibly for days or even a week.  It's not a very reliable, successful, or preferable easy to go.  I've been there.  Please care for your body and mind and take time off to recover. <3",
      "created_utc": 1747304724.0,
      "score": 1
    },
    {
      "id": "mshbvdi",
      "body": "Probably won't work with anti depressants. It just makes you feel like shit.",
      "created_utc": 1747329419.0,
      "score": 1
    },
    {
      "id": "msrzakt",
      "body": "Glad you’re still here- 🙏🏻🥹",
      "created_utc": 1747480832.0,
      "score": 1
    },
    {
      "id": "msyyj1r",
      "body": "me struggling with how to end it without failing, i was considering mixing my cyclobenzaprine with my Cetirizine & some alcohol & hope for the best",
      "created_utc": 1747583336.0,
      "score": 1
    },
    {
      "id": "mszijw2",
      "body": "Swallowed like 13 syriquils awhile back! Definitely mimed me twice",
      "created_utc": 1747589634.0,
      "score": 1
    },
    {
      "id": "mt28v1c",
      "body": "I took a whole bunch of insulin",
      "created_utc": 1747623632.0,
      "score": 1
    },
    {
      "id": "mt2anw0",
      "body": "I have no idea where i originally heard it . Someone who sounded trustworthy told me pills don't work very well.  It was a while ago.  Whenever I think of it, I plan to use a rope or something stuck in  my neck veins.",
      "created_utc": 1747624397.0,
      "score": 1
    },
    {
      "id": "mtatlfa",
      "body": "why do people do this, i don’t understand why you would do some bullshit that obviously won’t kill you, like i don’t want you to die but if you’re gonna do it why do it in some ridiculous ineffective way",
      "created_utc": 1747751009.0,
      "score": 1
    },
    {
      "id": "ms952bk",
      "body": "I'm ending it tmr",
      "created_utc": 1747222874.0,
      "score": 1
    },
    {
      "id": "ms9pz8f",
      "body": "[removed]",
      "created_utc": 1747230534.0,
      "score": -3
    },
    {
      "id": "ms8e170",
      "body": "Same",
      "created_utc": 1747207552.0,
      "score": 31
    },
    {
      "id": "ms8axg6",
      "body": "Me too",
      "created_utc": 1747205667.0,
      "score": 13
    },
    {
      "id": "ms8qx7b",
      "body": "it feels like I can taste my stomach and it is bitter",
      "created_utc": 1747215704.0,
      "score": 24
    },
    {
      "id": "msetndd",
      "body": "Often that’s the case. Having worked in Emergency and Intensive Care, you see all of this stuff and patients can be rescued from what could possibly be deadly.\n\nThing is, too often the patients come through and are worse for it, in a state worse than death (if there’s downtime, but not enough to cause circulatory or brain-death, or if you cook your vital organs such as your kidneys or your liver); if lucky, you get through and are just a bit sick or uncomfortable. Another thing is, in certain places, having suicide attempts can mean prescribers are reluctant to continue you on your current medications or must be judicious when prescribing medications for you in the future.\n\nOP, life has its shitty moments and you might believe life is just shitty or shit, but I’m sure people would care if you prematurely shuffled off your mortal coil. I’m hoping you seek help.",
      "created_utc": 1747293790.0,
      "score": 9
    },
    {
      "id": "mt9tmtr",
      "body": "Never vomitted. Just stomach cramps. Sucked.",
      "created_utc": 1747736928.0,
      "score": 2
    },
    {
      "id": "mtccyqh",
      "body": "same",
      "created_utc": 1747767114.0,
      "score": 2
    },
    {
      "id": "mtgeo43",
      "body": "same, woke up in the ICU after a couple of days feeling like death instead. not worth it lol",
      "created_utc": 1747826917.0,
      "score": 1
    },
    {
      "id": "mthmcig",
      "body": "Same, I just puked it",
      "created_utc": 1747841539.0,
      "score": 1
    },
    {
      "id": "ms81m98",
      "body": "[deleted]",
      "created_utc": 1747200393.0,
      "score": -2
    },
    {
      "id": "ms8529l",
      "body": "This",
      "created_utc": 1747202271.0,
      "score": 40
    },
    {
      "id": "ms8ad46",
      "body": "Sadly relatable, I wish people knew statistics are against them and this is the reality of an attempt not thought out",
      "created_utc": 1747205336.0,
      "score": 36
    },
    {
      "id": "mtcqz3z",
      "body": "I think they died",
      "created_utc": 1747771266.0,
      "score": 1
    },
    {
      "id": "mtcr363",
      "body": "They deleted their account?",
      "created_utc": 1747771300.0,
      "score": 2
    },
    {
      "id": "mtcr4ml",
      "body": "I don’t think so",
      "created_utc": 1747771312.0,
      "score": 0
    },
    {
      "id": "mt9jysj",
      "body": "That's such a fucking lie they feel worse.",
      "created_utc": 1747731056.0,
      "score": 1
    },
    {
      "id": "ms87n07",
      "body": "[deleted]",
      "created_utc": 1747203734.0,
      "score": 3
    },
    {
      "id": "mscg7lx",
      "body": "hey u still here?",
      "created_utc": 1747259362.0,
      "score": 2
    },
    {
      "id": "mss0gs4",
      "body": "Please reconsider - maybe post something\nOn the board? 😔 I’m just a stranger-\nAll I can do is offer to listen",
      "created_utc": 1747481429.0,
      "score": 1
    },
    {
      "id": "msbgd40",
      "body": "If you aren't helping just be quiet.  Please.",
      "created_utc": 1747248611.0,
      "score": 3
    },
    {
      "id": "msey842",
      "body": "Why tf you all treat it like \" yeah I tried it once, did not work\" and shrug it off??",
      "created_utc": 1747296670.0,
      "score": 7
    },
    {
      "id": "ms8arud",
      "body": "Bruh asked the what when where how and why",
      "created_utc": 1747205576.0,
      "score": 4
    },
    {
      "id": "mtgnkxj",
      "body": "Oh fuck",
      "created_utc": 1747830585.0,
      "score": 1
    },
    {
      "id": "mtoh2cl",
      "body": "me too",
      "created_utc": 1747931148.0,
      "score": 1
    },
    {
      "id": "ms8ehnd",
      "body": "Its ben more than 10 days for me and i think am stil hallucinating ,is that normal?",
      "created_utc": 1747207838.0,
      "score": 3
    },
    {
      "id": "mslhx4u",
      "body": "I wont be",
      "created_utc": 1747387695.0,
      "score": 2
    },
    {
      "id": "msxfx5k",
      "body": "hi. i know it can be off putting and sad but thats us finally being able to talk about these experiences with people who understand us and will most likely relate to or embrace us. that being said i do believe mods should do more, things are getting weird and its starting to feel less like a suicide support group",
      "created_utc": 1747560198.0,
      "score": 18
    },
    {
      "id": "msp50i9",
      "body": "True, you gotta try at least three times before you say fiddlesticks.",
      "created_utc": 1747431812.0,
      "score": 4
    },
    {
      "id": "msu7t2d",
      "body": "pls maybe call 911 when u feel the urge",
      "created_utc": 1747509459.0,
      "score": 1
    }
  ]
}