{
  "id": "1kb3s7r",
  "title": "I was really considering suicide this morning after having (gay) sex for the first time yesterday",
  "selftext": "I felt so much shame, especially since I started texting him on sunday night, and by monday afternoon he was fucking me\n\nI realised I have some deeply internalised homophobia due to the environment I’ve been brought up in, but it didn’t make the feeling go away at the time\n\nTo be clear I’m the one who mentioned sex to him, because that’s really what I was looking for when I downloaded grindr\n\nI calmed down a bit later on (and I’m feeling more happy about it now) but I wanted to share my feelings before they build up again",
  "created_utc": 1745973915.0,
  "score": 771,
  "num_comments": 90,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1kb3s7r/i_was_really_considering_suicide_this_morning/",
  "comments": [
    {
      "id": "mprdn6n",
      "body": "Hey man. Nothing wrong with being gay and being yourself. I hope you can see that. If being gay makes you happy, then go out there and be gay 👍🏻",
      "created_utc": 1745974036.0,
      "score": 675
    },
    {
      "id": "mprlgpd",
      "body": "It might be difficult right now but living your true self is the best thing you can do for your mental health. It might take you a while to reconcile your upbringing with your sexuality. Also, there is no need for you to tell anyone unless you want to.",
      "created_utc": 1745976695.0,
      "score": 57
    },
    {
      "id": "mpry4vw",
      "body": "Aw thank you for sharing and I’m glad you’re still with us. I’m a lesbian and the road to me being happy with myself was long but worth it. Life has many beautiful things worth experiencing.",
      "created_utc": 1745981119.0,
      "score": 29
    },
    {
      "id": "mprt1zz",
      "body": "I’m not gay, but there’s nothing wrong with it. You were raised the wrong way. Honestly watch some shows like Steven Universe or something with positive LGBTQ vibes but don’t let your parents decide who you get to be. Be your own you!",
      "created_utc": 1745979299.0,
      "score": 71
    },
    {
      "id": "mprtakt",
      "body": "There’s nothing wrong with what you did man. It’s all good.",
      "created_utc": 1745979382.0,
      "score": 17
    },
    {
      "id": "mpsv2qz",
      "body": "absolutely nothing to be ashamed of mate. get that dick bro",
      "created_utc": 1745996706.0,
      "score": 30
    },
    {
      "id": "mpt6g11",
      "body": "If it was consensual for all parties involved, then you have full permission to enjoy it.",
      "created_utc": 1746003970.0,
      "score": 13
    },
    {
      "id": "mprm991",
      "body": "I can understand that. Most people view us as subhuman so it can be easy to feel like that. Aside from that, there's really nothing wrong with it though",
      "created_utc": 1745976970.0,
      "score": 19
    },
    {
      "id": "mpw4e0p",
      "body": "I hate that the world makes you feel terrible for something that is completely natural.",
      "created_utc": 1746040773.0,
      "score": 9
    },
    {
      "id": "mpscnxw",
      "body": "That shame is very normal, but there's nothing wrong with having sex. Just be safe and use a condom :)",
      "created_utc": 1745987016.0,
      "score": 9
    },
    {
      "id": "mpv2j1h",
      "body": "Damn everyone is getting laid but me lol",
      "created_utc": 1746029764.0,
      "score": 8
    },
    {
      "id": "mpva4t1",
      "body": "It’s 2025 bro there’s nothing wrong with it only weirdos hate on people nowadays just keep being you and learning who you are",
      "created_utc": 1746031994.0,
      "score": 6
    },
    {
      "id": "mpryiek",
      "body": "I'm considering it, for other Many reasons not having gay sex or love anymore",
      "created_utc": 1745981256.0,
      "score": 6
    },
    {
      "id": "mprx7l1",
      "body": "I'm sorry that religion fucked you up. There's nothing shameful or wrong about 2 single consenting adults pleasuring each other.",
      "created_utc": 1745980783.0,
      "score": 18
    },
    {
      "id": "mps1sxs",
      "body": "most men would have sex with another man just saying",
      "created_utc": 1745982489.0,
      "score": 28
    },
    {
      "id": "mpsja88",
      "body": "Nothing wrong with being gay, it’s you and even though I’m a stranger on the internet but I hope you come to full terms about yourself",
      "created_utc": 1745990144.0,
      "score": 6
    },
    {
      "id": "mpsli36",
      "body": "Same here, I’ve been suffering with internalized homophobia. It really sucks, I cannot go on like this anymore",
      "created_utc": 1745991301.0,
      "score": 4
    },
    {
      "id": "mpv2d52",
      "body": "Nothing wrong with having sex with men, when it's good. Be careful on Grindr though, can be addictive and not always safe. I've been on there too much when I've been in a dark place, looking for validation, but getting terrible experiences and STDs..",
      "created_utc": 1746029717.0,
      "score": 5
    },
    {
      "id": "mpsvmpd",
      "body": "i hope you can heal from the environment you were brought up in, because as you already know there is nothing wrong with gay sex (i hope it was banginnnnn) 🩵",
      "created_utc": 1745997038.0,
      "score": 3
    },
    {
      "id": "mpt4xv9",
      "body": "It's perfectly ok it's who U like not who everyone else wants you to like for example I was disowned by my parents for being a non-binary gay and it didn't matter it's who U like not them",
      "created_utc": 1746002992.0,
      "score": 3
    },
    {
      "id": "mptmkdn",
      "body": "Internalized queerphobia is a massive weight to carry and you're certainly not alone in that. I understand that feeling intricately and idk if I'll ever fully get over it. I hope you're safe, and know that if it made you happy and was consensual, there's nothing wrong with it. Much love🫶🏻",
      "created_utc": 1746012816.0,
      "score": 3
    },
    {
      "id": "mpz8ab2",
      "body": "I was brought up similarly and I have those thoughts all the time bruh I get it. Don't let others approval and opinions fuck with your head. You deserve your own live for YOU.",
      "created_utc": 1746081322.0,
      "score": 3
    },
    {
      "id": "mpsh131",
      "body": "Be who you need to be for yourself. Those who deny you are there to bring you down and have you submit to those who do not think for themselves. Be yourself and be happy for the person you are.",
      "created_utc": 1745989033.0,
      "score": 2
    },
    {
      "id": "mpsnvqp",
      "body": "Honestly I think most gay guys go through this if they were raised in a non affirming environment. It’s very easy to convince yourself it’s wrong, but then you get in the mood, hook up with someone and immediately have a feeling of shame afterwards. I was there once. I promise it gets better and someday sooner than you think you will be totally free of that shame feeling. There is nothing wrong with being gay and nothing wrong with having sex. It may feel weird, but truly it’s ok! You can get through that feeling!",
      "created_utc": 1745992574.0,
      "score": 2
    },
    {
      "id": "mpsoaeh",
      "body": "Who you are is who you are. Don't let the world take that away from you. You are not harming a single soul because of who you are and who you are with in this life. Don't let the world shape you. Fuck them all, and be yourself. (Pun totally intended 😂)",
      "created_utc": 1745992796.0,
      "score": 2
    },
    {
      "id": "mpsou5d",
      "body": "I know it's not the same but I'm a Bisexual women but I've never dated or slept with a women because of religion and fear. I feel guilty and disgusted with myself everything I have thoughts of a women in that way. So in a way I understand your struggle.",
      "created_utc": 1745993099.0,
      "score": 2
    },
    {
      "id": "mpsqlo2",
      "body": "If you happy, and him, why you care about the others decisions and thoughts? Some of them just jelaous about you",
      "created_utc": 1745994093.0,
      "score": 2
    },
    {
      "id": "mpt46hu",
      "body": "When i first had a hookup with a person of my own gender i was TERRIFIED. I got the hell out of his apartment, first thing in the morning. I felt so sickened, i threw up as soon as i home. Now, i am open and proud of who i am. The first while is scary, but you will get used to it, trust me. Focus on finding yourself, maybe find a support group or a queer crisis hotline to help you out",
      "created_utc": 1746002503.0,
      "score": 2
    },
    {
      "id": "mptizs6",
      "body": "The amount of shame and guilt that sex is burdened with is absolutely nuts. \n\nPersonally, i think its great that you followed through so you could allow the experience to help you become aware of some of these deeply entrenched patterns that exist within you. \n\nSelf awareness is a major step towards lasting healing. Sounds like you two had consensual sex and it was a learning experience for you. I would consider that an absolute win.",
      "created_utc": 1746011176.0,
      "score": 2
    },
    {
      "id": "mpucdj0",
      "body": "When people say it gets better, it really does. It may not be an easy path but it does. You will learn and build a better and more accepting family and friends. You’ll get past your own homophobia and be okay. \n\nGay relations have been witnessed in nearly every single animal species. It’s only humans that put pressure on it. It’s part of biology and it’s okay.",
      "created_utc": 1746022091.0,
      "score": 2
    },
    {
      "id": "mpukepo",
      "body": "There’s no shame in it! \n\nShoot I’m in a happy (gay) 8yr relationship & I still sometimes get overcome with shame/guilt for who I am. Nothing against my partner & ofc I’m very much in love with them- it’s just religious trauma on my end. \n\nIf this is who you are- be happy about it! Have some pride and never be afraid to be yourself",
      "created_utc": 1746024504.0,
      "score": 2
    },
    {
      "id": "mpurldq",
      "body": "As long as you’re safe and consensual,  it’s your business.     Your sexuality is just a small aspect of who you are.   It doesn’t make your life any less important",
      "created_utc": 1746026598.0,
      "score": 2
    },
    {
      "id": "mpz9xkn",
      "body": "Gay sex is fire 🔥",
      "created_utc": 1746082303.0,
      "score": 2
    },
    {
      "id": "mq8d07v",
      "body": "I’ve done it plenty of times and had the same feeling the first time, if you enjoyed good if you didn’t don’t feel bad about it. At the end of the day it’s just sex. Your life is more valuable than your sexual preference and don’t let anyone tell you otherwise. I️ had sex with 2 guys at the same time and loved it, every bit of it biggest turn on ever I️ don’t care what anyone says and nobody can take that joy away from me.",
      "created_utc": 1746207047.0,
      "score": 2
    },
    {
      "id": "mqhk2nw",
      "body": "Many mammals, including apes, have homosexual sex. It lowers aggression, it strengthens social cohesion, which ultimately strengthens the survival chances of a group. It's still being studied, but the current hypothesis is that homosexuality promotes cooperation, supports social structures, and reduces stress, much like in other mammals. It's completely natural and ultimately beneficial. You are not a monster or a freak, or anything of the kind. You are a byproduct of evolution just like the rest of us :)",
      "created_utc": 1746333535.0,
      "score": 2
    },
    {
      "id": "mqhwu64",
      "body": "You know, I (M63) don't know you, but I can tell you this:  Having had sex with someone of the same gender once does NOT make you gay.  A Seattle writer for the newspaper once wrote this, and I've always remembered it.  To be gay, you have to prefer the sexuality/romantic interest of someone in your own gender to the exclusion of others - in an on-going basis.\n\nHumans like to try different things and explore different ways of living, including sexual experiences.  There is nothing wrong with experimenting sexually either - as it happens all the time (mostly when you're younger).  If you look at your experience through this simple lens, you'll see that it's actually not that big of a deal, and it DOES NOT define you as a person.\n\nWhat does define you is how you treat other people, keeping your word, and trying to do the very best you can in your work and other efforts in life.  Focus on those elements of your life and shrug off the sexual experience you had if you did not enjoy it.  If you did enjoy it, try it again.\n\nLife is too short to worry about all of this kind of stuff, and in the end, it really does not matter anyhow.  =)",
      "created_utc": 1746340466.0,
      "score": 2
    },
    {
      "id": "mqkukl5",
      "body": "I'm bisexual. I kissed my ex-gf (a non-transitioned trans woman) in public, and I fcked her several times. I also had a bf, who still lives on my heart.\n\nI understand you have internalized homophobia. I was homophobic myself once. It's hard to rewire our brains after so much bllsht in our lives (and this does NOT only applies with discrimination).\n\nTake this as an advice, not as an order: learn that there is NOTHING wrong with being gay or whatever. Try to stick that idea into your head",
      "created_utc": 1746383963.0,
      "score": 2
    },
    {
      "id": "mqsgqw2",
      "body": "Please know that there is nothing wrong with being gay and you should never feel any guilt about it, unfortunately people are insufferable and will try to frame homosexuality as something that it’s not. You don’t deserve to feel ashamed.",
      "created_utc": 1746485565.0,
      "score": 2
    },
    {
      "id": "mprm8wy",
      "body": "I've had gay sex thousands of times and never felt like that. You can get through this",
      "created_utc": 1745976967.0,
      "score": 5
    },
    {
      "id": "mpv48v5",
      "body": "I'm a 50 year old straight male. Trust me mate I don't even get sex anymore. Your lucky been gay you'll never have to deal with the drought.",
      "created_utc": 1746030271.0,
      "score": 3
    },
    {
      "id": "mps6fq2",
      "body": "Being gay is a blessing. You get to have sex with men all your entire life. Why cut that short?",
      "created_utc": 1745984329.0,
      "score": 3
    },
    {
      "id": "mpx5ejs",
      "body": "I hope I’m not being inappropriate by asking this but… is this a joke?",
      "created_utc": 1746051879.0,
      "score": 2
    },
    {
      "id": "mpu271r",
      "body": "If you've been brought up with a sense of shame it's normal to feel some shame when you try to break the mould. You're not doing anything wrong and you know that, and as you come to terms with your desires you'll grow to feel better about it. \n\nYou might not feel it now but this is the start of a better chapter in your life. Be safe and have fun x",
      "created_utc": 1746018774.0,
      "score": 1
    },
    {
      "id": "mpugvam",
      "body": "It’s normal to feel shame, you’re going to be your own worst critic when it comes to self criticism and self esteem issues. Many things are out of our control. You’re going to face hardship and frustration for being different.. it’s just a part of being authentically you. The neurodivergent community can relate. I’m glad you found a way to cope with the overwhelming feelings. Eat some ice cream and cake. It’s something celebratory for sure.",
      "created_utc": 1746023457.0,
      "score": 1
    },
    {
      "id": "mq00g28",
      "body": "people already gave you some advice here,what i can say is,stay the fuck out of gay themed subreddit,most of them are full of whiny edgy teenager, with extra woke energy, got bashed for saying that being overweight is unhealthy,and that being a bear doesn't necessarily mean that you're fat,but require some physical aspect.....\n\n\n\nin this moment you're fragile, feeling guilty and ashamed, probably think about what your parents would believe ,if they knew,like they raised you and you're like this.. it's hard i'm still dealing with it,and it is way way harder when someone is a bottom or likes to bottom... please look for therapy or surround yourself by people who love and accept you",
      "created_utc": 1746098308.0,
      "score": 1
    },
    {
      "id": "mq3tm8z",
      "body": "Damn. The culture really has its hooks in you. What you did is not morally wrong nor is it harmful. Even if the small chance that it turns out later that you are not gay what you did wasn’t wrong. You had a consensual meeting of two people.",
      "created_utc": 1746141529.0,
      "score": 1
    },
    {
      "id": "mq4nu91",
      "body": "anythingypffttt",
      "created_utc": 1746152206.0,
      "score": 1
    },
    {
      "id": "mqk86j7",
      "body": "Understandable but please try not to feel that way, lots of people have experimented and having intrest in the same sex is not something to be ashamed of.",
      "created_utc": 1746377235.0,
      "score": 1
    },
    {
      "id": "mqksy0s",
      "body": "Hey, it's ok to not like the first experience. Not a 100% of the population has to like it in the first take. And you had to try it to know it right?",
      "created_utc": 1746383459.0,
      "score": 1
    },
    {
      "id": "mr0raom",
      "body": "I've felt this way before but unfortunately in my case, I am not gay but I am plagued with OCD which causes me to act against my sexuality. It makes me feel even more suicidal so it's understandable to feel this way but hopefully you feel better now",
      "created_utc": 1746597078.0,
      "score": 1
    },
    {
      "id": "mr1j2pq",
      "body": "I kind of wish I was bi. Nothing wrong with being gay. It doesn’t need to change who you are, other than the homophobia ofc. Hookups are not safe tho.",
      "created_utc": 1746613930.0,
      "score": 1
    },
    {
      "id": "mr3uhee",
      "body": "there are many other people who will be happy for you, try to seek support from them and filter the comments that you know (and YOU know) do not suit you. It doesn't matter if it's family, friend or relative, if it hurts you to the point that you reject yourself, it's not worth keeping in touch. \n\nFurthermore, therapy helps you see your life from another perspective.\n\nI'm happy for you.",
      "created_utc": 1746641338.0,
      "score": 1
    },
    {
      "id": "mr5ai22",
      "body": "being gay is fine. also just because yo had gay sex doesnt mean your gay. source i went to a all boys dorm school during high school.",
      "created_utc": 1746656657.0,
      "score": 1
    },
    {
      "id": "mtwc125",
      "body": "Hey! I understand that it might go in absolute contrast with the beliefs and the view of “normal” you were brought up with. But gay sex is amazing, and I’d do so much for a chance to take away some of the hetero experiences I had and change them for more gay sex. 😳 This doesn’t make into you anything bad, this doesn’t legitimize calling you in different names. It’s just a new part if you to embrace, a new chapter, a new thing to explore (even though with scary challenges on the way).",
      "created_utc": 1748031892.0,
      "score": 1
    },
    {
      "id": "mqxox3w",
      "body": "Ngl bro I would follow through with that u shouldn’t but I would💀😭",
      "created_utc": 1746558621.0,
      "score": 1
    },
    {
      "id": "mpsk0z1",
      "body": "Pretty much this exact thing happened to me. I felt so disgusting afterwards and started having violent thoughts about the person I hooked up with.",
      "created_utc": 1745990526.0,
      "score": -1
    },
    {
      "id": "mpuev33",
      "body": "Really makes you think",
      "created_utc": 1746022858.0,
      "score": 0
    },
    {
      "id": "mprewi4",
      "body": "I'm gay and I totally get it.  It may also be the casual sex approach that's causing discomfort. You may be looking for a deeper bond that's about more than the plumbing and more about the wiring AND the plumbing.  Both matter   A longer-lasting connection, in other words.",
      "created_utc": 1745974460.0,
      "score": 195
    },
    {
      "id": "mpreay5",
      "body": "thanks for your kind words, i know it’s the “standard response” to the gay shame sort of thing, but it’s good to hear from someone",
      "created_utc": 1745974256.0,
      "score": 54
    },
    {
      "id": "mq5nawi",
      "body": "Suck some dick!",
      "created_utc": 1746168727.0,
      "score": 2
    },
    {
      "id": "mpwzz8z",
      "body": "Username checks out",
      "created_utc": 1746050111.0,
      "score": 6
    },
    {
      "id": "mptbl94",
      "body": "Oh, right. Off-topic, but do you know where one could watch it? Steven universe has helped me with my loss in believe for love in a way.",
      "created_utc": 1746007206.0,
      "score": 12
    },
    {
      "id": "mptv71y",
      "body": "Or smash dat ass",
      "created_utc": 1746016303.0,
      "score": 14
    },
    {
      "id": "mpw3p8d",
      "body": "it turned out to be a lot easier than i expected, i just downloaded grindr and the next day i was having sex\n\ni think some of the negative emotions came from shock that it all happened so quickly\n\nif u really want to get laid u could download grindr and hook up like almost immediately, but if you’re straight i think it’s a lot more complicated",
      "created_utc": 1746040568.0,
      "score": 7
    },
    {
      "id": "mqem04u",
      "body": "No, no they wouldn’t",
      "created_utc": 1746294448.0,
      "score": 3
    },
    {
      "id": "mqnd421",
      "body": "there has been many convicted men who’s doing time because they murdered the person who they had sex with after they found out they were trans💀\n\nscary times we live in",
      "created_utc": 1746415006.0,
      "score": 1
    },
    {
      "id": "mqaxzhz",
      "body": "🤢",
      "created_utc": 1746236984.0,
      "score": 2
    },
    {
      "id": "mpxpzej",
      "body": "no",
      "created_utc": 1746058842.0,
      "score": 3
    },
    {
      "id": "mpzzgcs",
      "body": "please leave",
      "created_utc": 1746097834.0,
      "score": 2
    },
    {
      "id": "mr1jaj7",
      "body": "You mean you have obsessive thoughts of gay sex despite being not gay? wow never thought of that. I am a bit OCD obsessive and I can imagine what that might be like. I would definitely be question my sexuality constantly.",
      "created_utc": 1746614046.0,
      "score": 1
    },
    {
      "id": "mprqjln",
      "body": "This. Said pain more likely about the casual sex! Bond with the person and you will likely find a deeper meaning and purpose behind the relationship and the intimacy.\n\ni never slept with a guy before but have had sexual encounters mostly one time ones and the experience sounds similar to yours, regretful and shameful. But i tried getting to know the last girl i did it with and it turned into a heartwarming friendship despite her still asking a bit of money from me",
      "created_utc": 1745978425.0,
      "score": 39
    },
    {
      "id": "mpyfimy",
      "body": "Take it from someone who is bi and grew up and a Arab and Muslim household, there is nothing to be ashamed of bc most people who are gay go through this as people aren’t that open to it (especially themselves) so go easy on yourself and just enjoy it",
      "created_utc": 1746067820.0,
      "score": 4
    },
    {
      "id": "mpzglb5",
      "body": "Yeah Grindr is like Doordash for gay sex.  I know because my brother has it and it is not hard for him to get hookups.",
      "created_utc": 1746086506.0,
      "score": 2
    },
    {
      "id": "mr1k9ch",
      "body": "Yes. OCD makes you question anything that it chooses to obsess over all the time. It has even caused me to do gay acts despite the fact that i dont like it and always feel violated after and disgusted, even though i put myself in that position",
      "created_utc": 1746614541.0,
      "score": 1
    },
    {
      "id": "mprqlrr",
      "body": "i didnt give her any though as she doesnt really need it just teases me",
      "created_utc": 1745978446.0,
      "score": 10
    }
  ]
}