{
  "id": "1kpmnrk",
  "title": "They sent me to Frinzdone and it hurts a lot.",
  "selftext": "I'm a 22-year-old gay guy with autism who's been using dating apps since late 2023. I've chatted with around 200 guys, but nothing ever came of it because none of them were committed or lost interest.\n\n\n\nHowever, I met a guy two years younger than me who lives near my city. He caught my eye because of his physical attraction. We started talking, and there was a connection between us. As the days went by, we talked a lot, and in 12 days, we accumulated almost 700 messages on the Boo app. He was extremely affectionate, gentle, sweet, attentive, and used stickers that you would normally use for someone you like. I thought he was attracted to me, and I assumed it was a given, but since he took several times to respond, this idea weakened (and boy, was I right).\n\n\n\nI listened to a psychologist and asked him directly if he was attracted to me. He didn't say no, but said he'd downloaded the app to meet friends because he didn't have any in real life. He asked me if he was attracted to me.\n\n\n\nI said yes, explaining how I felt, but that I'd like to at least be friends. He didn't say anything to my confession; he just gave him a heart and told me he'd love to be friends. The most embarrassing thing of all is that I was attracted to him in just 20 days, but it's really surprising how many messages we exchanged in such a short time.\n\n\n\nThe craziest thing is that we have so many things in common: we have the same birthday, our birthdays share the number 9, we both have similar physical features like long eyelashes, skin tone, lip color, almost the same goals, almost the same way of thinking, etc. It's so strange.\n\n\n\nThe saddest thing is that I was no longer interested in meeting other guys besides him, and now he's ended up sending me to the Friend Zone. But I have to be realistic. I've never been lucky in love, even though I'm not that physically ugly, but I'll always have this terrible bad luck.\n\n\n\nI started crying, I started feeling bad, and I started saying horrible things to myself. I don't love myself, I hate myself too much, I'm not pretty enough for a guy. The most annoying thing is having to worry if the guy takes a long time to respond, but I shouldn't get that way because, after all, he doesn't see me as a romantic interest.\n\n\n\nMy friends who are mothers and have more experience in love told me not to lose hope, that maybe something beautiful can happen later because we're building a connection. Do you believe this?\n\n\n\nCurrently, we're still friends, and I really like him and I really like him. Although I don't know if he talks to me out of pity or because he feels obligated to not be able to kiss me because maybe he feels impossible to do so.\n\n\n\nSince I hate this, this failure only increases my desire to end it all, because I'm not even good at love. I'm good for nothing.",
  "created_utc": 1747582241.0,
  "score": 562,
  "num_comments": 12,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1kpmnrk/they_sent_me_to_frinzdone_and_it_hurts_a_lot/",
  "comments": [
    {
      "id": "mszqurx",
      "body": "Be grateful for the friendship. When one door closes, another opens.",
      "created_utc": 1747592203.0,
      "score": 27
    },
    {
      "id": "mtdrv5j",
      "body": " I'm sorry that the relationship aspect didn't work out, but you will be able to find someone else who will be a lot better for you. It's nice that he still wants to be friends though. Side note, I really related to your post as a gay guy who has been diagnosed with autism as a kid and later as having BPD instead. Trying to find relationships today seems like looking for a needle in a hay stack, since all most men want at around our age is casual sex. Finding love when you feel \"different\" from others seems like an impossible task, but I wouldn't worry too much. There will be someone out there for you eventually, 22 is still really young!",
      "created_utc": 1747782896.0,
      "score": 2
    },
    {
      "id": "mt1fyii",
      "body": "I'm 21 autistic and my matches don't even keep me. One of them sexually abused me. I'd take friend zone over that.\n\nBut in all seriousness, if you feel uncomfortable with the situation, just be honest with him.",
      "created_utc": 1747612656.0,
      "score": 3
    },
    {
      "id": "mu6nna9",
      "body": "We have all the challenges non Autistic's have and more, sometimes we share too much, sometimes we can't even speak, take your time,  I met my Wife when I was 26 she \"got\" me like no one else did and we were together for 20 years, like a lot of people the right person comes along when we stop looking and focus on ourselves.",
      "created_utc": 1748186571.0,
      "score": 1
    },
    {
      "id": "mu797dl",
      "body": "I'm not a gay guy but a straight woman and older. Also friendzoned before my birthday.\n\nI'm sorry this happened to you too.",
      "created_utc": 1748193040.0,
      "score": 1
    },
    {
      "id": "muahhfj",
      "body": "Friendship is a beautiful and valuable thing. And some people do genuinely join those apps to make more friends. You are young and will absolutely meet the right guy, but you have to leave your heart open to it.",
      "created_utc": 1748234131.0,
      "score": 1
    },
    {
      "id": "mszw8zq",
      "body": "You're right. He's a very nice person, and I'm grateful we're friends.",
      "created_utc": 1747593934.0,
      "score": 12
    },
    {
      "id": "mt4xdgj",
      "body": "First of all, I'm so sorry for what you went through 😔, no one deserves to go through that. I hope you have the best of luck in finding the right person who knows how to value, love, and respect you. And again, I'm sorry.",
      "created_utc": 1747668670.0,
      "score": 2
    }
  ]
}