{
  "id": "1f3vp6l",
  "title": "My wife died at 27, had been together our whole adult lives",
  "selftext": "She died 5 days ago after being hospitalised for 2 weeks.\n\nWe had been together since high school. Married on 7th July 2023.  She was my best friend, my home and core to all my dreams. \n\nWe shared all our values and life goals, we wanted a family and children. We wanted to see the world and build careers that would let us make a difference. \n\nShe wanted to help victims of violent crimes, she had endless empathy for people and the courage to try to empower those who had suffered from the most horrific crimes.\n\nShe followed me from our home in Helsinki to Dar es Salaam, Tanzania where I got a job soon after our wedding. We loved our lives there. She was blossoming, made the sweetest friends, and was working the perfect job that allowed her to work remotely while I worked my office job.\n\n9th August 2024 she falls ill, I figure it's just a flu as I had one too and she tends to always get hit by the flu harder than me. For a full 24 hours I just take care of her at home, thinking rest is all she needs. The next day she is delirious, I still think this might just be a combo of the flu and the aural migraines she would often get. We get to the hospital around midday. It's malaria. I still think: \"they know exactly how to treat malaria here, she'll be just fine\"\n\n2 weeks of fighting, complication after complication. On the 24th of August 2024, at 9AM, the doctors tell us her brain herniated, she was brain dead. The next 16 hours we watched her body give up. We were sobbing, sleeping and staring into the void over what was basically already a corpse being kept \"alive\" by tubes and medication. Tanzanian law would not allow her to be unplugged at the moment of brain death. 25th August 3AM, she is pronounced dead.\n\nI'm back in Finland now at my parents' house. I have barely left my childhood bedroom. I dont have a home anymore. I lost my best friend, my first and only love, my future.\n\nI'm in agony, the memories of our life together and her tubed corpse swirling in my head. I dont know how to live without her, I dont know how to function. I feel so alone, despite family and friends trying to be there for me.\n\nI would not want to live, but I cant hurt my family more than they are already hurting. They loved her like a daughter.\n\nI just want my home back, I want to be loved like she loved me.\n\n",
  "created_utc": 1724913085.0,
  "score": 683,
  "num_comments": 85,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1f3vp6l/my_wife_died_at_27_had_been_together_our_whole/",
  "comments": [
    {
      "id": "lkgqo7f",
      "body": "Good people always die young whereas cruel mfs live for eternity. The world is fucking unfair. I am sorry brother",
      "created_utc": 1724914292.0,
      "score": 366
    },
    {
      "id": "lkgrz0e",
      "body": "I'm really sorry for your loss man. If you ever want or need someone to talk to feel free to reach out. I hope things get better for you friend",
      "created_utc": 1724915123.0,
      "score": 47
    },
    {
      "id": "lkhe67z",
      "body": "Sorry to hear that. I became a widower at 31. Only thing that kept me from completely wasting away were my kids. My wife had so much confidence I’d be a great father. I can’t let her down, and to leave them without their mother AND father would be extremely selfish. I’m sorry for your loss, and all I can say is that one never gets over it, we just get through it. Some days are harder than others, but don’t give up. Think of how the ones who love you would feel. Do you want them to one day be on this page, wanting to die because they lost you?",
      "created_utc": 1724929058.0,
      "score": 47
    },
    {
      "id": "lki3op3",
      "body": "I’m 38, and I might seem like an old guy to you, but I feel just as young as you do. Last year, I lost my wife to Leukemia—it took her in just 30 days. I still remember her telling me, “Life is going to be brutally hard, and you’ll carry a pain in your chest, but you’ll make it through.”",
      "created_utc": 1724939334.0,
      "score": 39
    },
    {
      "id": "lkgphd1",
      "body": "I’m so sorry man. I hope you can find a way through all of this. 🫶",
      "created_utc": 1724913541.0,
      "score": 39
    },
    {
      "id": "lki68nx",
      "body": "So sorry for your loss. I have a girlfriend that means a lot to me. I cant even imagine loosing her. I want to marry her too. Your story made me cry like a little children. I hope you get better mate.",
      "created_utc": 1724940182.0,
      "score": 13
    },
    {
      "id": "lkgtci1",
      "body": "My condolences. I can’t even imagine what you are going through. Wish there was something to say that would make you feel better but there’s not.  She sounds like she was an amazing woman to all who knew her. I hope with time you will heal and continue to remember all your wonderful memories together.",
      "created_utc": 1724916015.0,
      "score": 18
    },
    {
      "id": "lkgwhvc",
      "body": "I am really sorry for your loss and she was so young. Feel your grief. Take time to heal. But remember she would not want you to continue being miserable. In your darkest moments remember how would she feel if she saw you like this. She was a big part of your life and it will take time to accept the reality. But as someone who thought it will never get better. It does with time. A lot of time sometimes. But it does. So keep going.",
      "created_utc": 1724918125.0,
      "score": 5
    },
    {
      "id": "lkgu82n",
      "body": "I'm really sorry for what you had gone through. I can't understand the pain as I was never loved like this and no one ever felt \"home\". It's very painful to love someone so much and lose them. Maybe I'll never have that, but be grateful for what you had as some of us would have given everything to experience a lifetime like this, of getting to know your other-half at a young age.\n\nI can only wish that you get to live your life and the pain gets easier.",
      "created_utc": 1724916592.0,
      "score": 11
    },
    {
      "id": "lkgv28a",
      "body": "My heart is with you.",
      "created_utc": 1724917156.0,
      "score": 7
    },
    {
      "id": "lkgvs5u",
      "body": "My condolences, losing someone is the most painful and strangest thing you will ever experience. There is light and you will heal, but you can’t see it now and may not even want to hear it. I cannot tell or give anything that will make it better, for now just try to exist.♥️",
      "created_utc": 1724917643.0,
      "score": 7
    },
    {
      "id": "lkh5tt3",
      "body": "All the strength in the world to get through this OP. There's no way around this, no shortcut, no forgetting. I wish you can mourn her death properly, give it a place within yourself and learn to live with it. Give yourself time to process what happened.\n\n\nAnd I don't know the answer to this question but maybe you do: before you make any irreversible decisions: how would your late wife feel about it given the circumstances? ",
      "created_utc": 1724924268.0,
      "score": 3
    },
    {
      "id": "lkh7qpt",
      "body": "I’m so sorry",
      "created_utc": 1724925461.0,
      "score": 3
    },
    {
      "id": "lkh9hvs",
      "body": "I am so so sorry 💔\n🫂",
      "created_utc": 1724926505.0,
      "score": 3
    },
    {
      "id": "lkheyjk",
      "body": "Grief is natural, especially for someone you love so much and have been with for such a long time. Before you make any decisions that cannot be undone, give it some time, the grief will likely pass. You will never forget her, but this will probably become easier to deal with.",
      "created_utc": 1724929453.0,
      "score": 3
    },
    {
      "id": "lkhleb0",
      "body": "I am so sorry for your loss, we are all here for you. 🫶",
      "created_utc": 1724932438.0,
      "score": 3
    },
    {
      "id": "lkik2s1",
      "body": "Fuck me. That's devastating. A million hugs, and I'm sure you'll get through this.",
      "created_utc": 1724944503.0,
      "score": 3
    },
    {
      "id": "lkj75oy",
      "body": "God, I am so so sorry. I have never had the blessing of a love like that in my life, but to find something so special and lose it must be a heartbreak more profound than I can possibly imagine.",
      "created_utc": 1724951469.0,
      "score": 3
    },
    {
      "id": "lkgtau1",
      "body": "I am so sorry.",
      "created_utc": 1724915985.0,
      "score": 4
    },
    {
      "id": "lkgxe2m",
      "body": "Sweetheart, you just got to take it one day at a time and if you can’t do that, one hour at a time and if you can’t do that one second at a time. What you’re feeling is a normal reaction to what you’ve just been through. I’m so so sorry for your loss. Do whatever you can to comfort yourself. You just need to make it past the suicide ideation.",
      "created_utc": 1724918741.0,
      "score": 5
    },
    {
      "id": "lkhgeot",
      "body": "I’m so sorry for your loss, I know grief doesn’t ever truly go away but I hope that in time you can heal as much as you possibly can. I know this probably doesn’t help much coming from a stranger but please live. If not for yourself then for your wife, she wouldn’t want that for you, she’d want you to live a long and happy life and remember the good times you had with her.",
      "created_utc": 1724930163.0,
      "score": 2
    },
    {
      "id": "lkhwyim",
      "body": "I’m so so sorry. It sounds like you shared a beautiful love so early in life which you a so lucky to have been a part of. I know she would want you to live your life to the highest possible as a testament to her love for you, I know you have a way to go to get to a stability and inner peace, but I know that is there in your future. Sending you all my love and strength",
      "created_utc": 1724937021.0,
      "score": 2
    },
    {
      "id": "lkjjssf",
      "body": "Now your wife's dreams are yours to carry to fruition. Do it for them, create the difference in the world they would have wanted. In their name.\n\n\n\nIt is now your life's purpose to do so.",
      "created_utc": 1724955295.0,
      "score": 2
    },
    {
      "id": "lkmlr1v",
      "body": "I am so sorry for your lost",
      "created_utc": 1724995477.0,
      "score": 2
    },
    {
      "id": "ll3kp8t",
      "body": "I’m so sorry for your loss. You’ve written a lot (in the original post and in the comments) about what an amazing woman she was and how much she wanted to give to other people who were less fortunate or going through hard times. Take time to take care of you and to properly grieve, that is the most important, but it also sounds like she would want you to continue on. And I think a great way to honour her would be to carry on some of the work she was doing. Even if you can’t directly do what she was doing (like helping violent crime victims and things like that), you can carry on her loving and giving spirit, even in small ways. Volunteering for places that help crime victims, or even just making someone’s day. Right now that may sound impossible, but I believe in you. Big hugs my friend, you can get through this. I wish my husband loved me as much as you loved your wife. ❤️",
      "created_utc": 1725251084.0,
      "score": 2
    },
    {
      "id": "ll46gl8",
      "body": "Malaria? Fucking mosquitos… those motherfuckers. I hate them. They cause the most death and pain than any other deadly animal.\n\nI’m sorry for your loss, but fucking hell, malaria..",
      "created_utc": 1725264016.0,
      "score": 2
    },
    {
      "id": "lkgymy9",
      "body": "Go to YouTube and type. \n\nWhitechapel- Hickory Creek (acoustic)",
      "created_utc": 1724919576.0,
      "score": 2
    },
    {
      "id": "lkh0ird",
      "body": "So sorry for your loss.  Please give yourself time to grieve.  I've lost enough people in my life to understand that the hopeless feeling goes away.  It takes as long as it takes, but that feeling goes away.  The pain of loss is persistent, but it does become manageable.  Once again, I am so sorry, and I'm praying for you, your family, your wife, and her family.",
      "created_utc": 1724920834.0,
      "score": 1
    },
    {
      "id": "lkh0lli",
      "body": "I'm so sorry friend. I know it likely means nothing from a stranger, but you gotta live dude. For her. So you can remember her and how great of a person she was and your love for her. Live for her until you can live for yourself again.",
      "created_utc": 1724920884.0,
      "score": 1
    },
    {
      "id": "lkj5shw",
      "body": "What you had was beautiful. A fairytale. Don't ever let it go. I wouldn't, if I were you. Not all of us are so lucky..",
      "created_utc": 1724951057.0,
      "score": 1
    },
    {
      "id": "lkjqgzr",
      "body": "I'm so sorry 😔 this is awful and I feel for you. Only saying I'm sending you a hug across the miles.",
      "created_utc": 1724957365.0,
      "score": 1
    },
    {
      "id": "lkk7fmb",
      "body": "I don’t know what to say… \nsending you so much love ❤️",
      "created_utc": 1724962627.0,
      "score": 1
    },
    {
      "id": "lkkb94a",
      "body": "Sorry for your loss. It's going to take time, and there will be difficult moments, but you can heal. Trust that you can, as bleak and horrible as life feels right now. \n\nWanted to link this song for you, by Devin Townsend:  \n[https://www.youtube.com/watch?v=nq-S9FzmcyI](https://www.youtube.com/watch?v=nq-S9FzmcyI)  \n\n\nhere are the lyrics:\n\n\"It's alright to cry  \nIt's alright to lean on everyone  \nIt's alright to lie in the bed you've made for everyone\n\nAnd anytime you need someone,  \nAnytime you heed someone  \nAnytime you need me babe, I will be there.\n\nIt's alright to die  \nIt's alright to bleed on everyone  \nIt's alright this time  \nIt's all life, you learn from everyone\n\nWith every single time you go  \n...And every single line you blow  \nAnytime you need it man, I won't be there\n\nIt's all going away now  \n...All going away now  \nGoing, going...gone  \nGoing, going...gone\n\nIt's alright to cry  \nIt's alright to feed on everyone  \nIt's alright to hide,  \nIn your cozy bed from everyone So anytime you need it man,  \nGet inside and be it man...\"\n\n  \nMuch love Bro.",
      "created_utc": 1724963792.0,
      "score": 1
    },
    {
      "id": "lkkvbdc",
      "body": "I understand how you're feeling to a good degree. My wife died some years ago and I was beyond devastated. My life, love, dreams, hopes, and my future seemed to die with her. The best advice I can give you is to STAY BUSY. Time is the only thing that is going to heal you and unfortunately it isn't going to happen quickly. The busier you can keep your mind and hands the better off you'll be. Join a bereavement support group, take up new hobbies, throw yourself into work. Try not to cause yourself additional pain and turmoil while you're moving through your grief. And I leave you with this my friend, rest assured you will see her again! \nWe are spiritual beings on a physical journey...",
      "created_utc": 1724970261.0,
      "score": 1
    },
    {
      "id": "lkld3i4",
      "body": "I’m so incredibly sorry for your loss :( live for her, like you would want her to do if the roles were reversed 🤍",
      "created_utc": 1724976647.0,
      "score": 1
    },
    {
      "id": "lkm15fm",
      "body": "I’m so sorry.. I myself am dealing with the loss of my childhood love.. I can’t say I understand.. but I understand that I will never understand… much love from the reddit community to you, dear friend.",
      "created_utc": 1724985736.0,
      "score": 1
    },
    {
      "id": "lkm7j8n",
      "body": "Good luck man. You're blessed to have her. She'll be missing you too. Perhaps, waiting for you",
      "created_utc": 1724988422.0,
      "score": 1
    },
    {
      "id": "lkma9a1",
      "body": "I think there are no words I can say to relieve your loss, pain is the only way, but once you go through, time will cure your heart.I am really sorry bro. I'm always available if you want to talk. My prayers are with you.",
      "created_utc": 1724989642.0,
      "score": 1
    },
    {
      "id": "lkmgvcf",
      "body": "I'm so so fucking sorry :(",
      "created_utc": 1724992837.0,
      "score": 1
    },
    {
      "id": "lkn9qen",
      "body": "It's 5:35 am, the sun is rising, yet tears fall down my cheeks as I feel sorrow while I'm reading this...  I couldn't imagine what you're going through, all I know is, tonight, there will be one more star in the sky... And she will be looking over you...",
      "created_utc": 1725010709.0,
      "score": 1
    },
    {
      "id": "lkqvbr1",
      "body": "was it actually malaria and they just failed or was their diagnosis wrong?",
      "created_utc": 1725057024.0,
      "score": 1
    },
    {
      "id": "ll6n4eg",
      "body": "Soo sorry for your loss",
      "created_utc": 1725301642.0,
      "score": 1
    },
    {
      "id": "lkhe3gz",
      "body": "This or losing a child is my worst fear. Even just the idea of having them one day is the only thing keeping me going. I could not keep going on after something like this. I hope you find a way though. I know your wife wouldn’t want you to suffer. 💗",
      "created_utc": 1724929022.0,
      "score": 1
    },
    {
      "id": "lki8eju",
      "body": "🫂 From the bottom of my heart, I'm so sorry that you are going through this.  If I had special powers, I would take away your loss and that deep heartache . Take care of yourself.",
      "created_utc": 1724940885.0,
      "score": 1
    },
    {
      "id": "lkic7jq",
      "body": "Hey, I’m so sorry…",
      "created_utc": 1724942087.0,
      "score": 1
    },
    {
      "id": "lkiha0m",
      "body": "I'm so sorry for your loss.",
      "created_utc": 1724943647.0,
      "score": 1
    },
    {
      "id": "lkjfrjh",
      "body": "It could have been worse.  You have a funeral,  your grief can be buried there.  Divorce is worse.",
      "created_utc": 1724954068.0,
      "score": -7
    },
    {
      "id": "lkh4y72",
      "body": "it's because when you're evil, you make people around you stressed, but you don't personally deal with the stress.\n\nsee. henry kissinger who lived to be 100 after all the atrocities he instigated",
      "created_utc": 1724923699.0,
      "score": 76
    },
    {
      "id": "lkh1c01",
      "body": "THISSS right here - God always takes His Precious Angels first so that they dont live to see much of the corruption and evil of this world!!",
      "created_utc": 1724921357.0,
      "score": 15
    },
    {
      "id": "lkmhzn2",
      "body": "that's where the fairness, life is all about suffering, good people ends early",
      "created_utc": 1724993419.0,
      "score": 2
    },
    {
      "id": "lkhesu0",
      "body": "No one cruel lives for eternity, they shall be recompensed for their crimes, one way or another.",
      "created_utc": 1724929374.0,
      "score": -10
    },
    {
      "id": "lkhehj8",
      "body": "Cherish your kids ❤️ Help them live a life of smiles",
      "created_utc": 1724929217.0,
      "score": 24
    },
    {
      "id": "lki4qfa",
      "body": "She sounds incredibly strong ❤️",
      "created_utc": 1724939681.0,
      "score": 9
    },
    {
      "id": "lki6tic",
      "body": "Cherish her ❤️ Put the daily effort into your relationship that she deserves",
      "created_utc": 1724940373.0,
      "score": 11
    },
    {
      "id": "lkgzir9",
      "body": "\"just\"",
      "created_utc": 1724920164.0,
      "score": -3
    },
    {
      "id": "lknb1dz",
      "body": "Deep Peace is such a beautiful song, really helped me through some hard times, although nothing even compares to what OP must be feeling right now 🖤",
      "created_utc": 1725011539.0,
      "score": 2
    },
    {
      "id": "lkjjbxc",
      "body": "What the ffffffffffff-",
      "created_utc": 1724955150.0,
      "score": 5
    },
    {
      "id": "lkhkhnj",
      "body": "hmmm fr.",
      "created_utc": 1724932044.0,
      "score": 8
    },
    {
      "id": "ll3k1c7",
      "body": "There is no god. People themselves are evil ",
      "created_utc": 1725250746.0,
      "score": 1
    },
    {
      "id": "lkhhlfe",
      "body": "It’s still a struggle, but I am giving my best. Thank you for your kind words. You’ve obviously got a kind heart. Don’t deprive the world of that. You’ve got a lot of positivity to share. Don’t leave before you’ve done that.",
      "created_utc": 1724930729.0,
      "score": 17
    },
    {
      "id": "lki8tnq",
      "body": "I will",
      "created_utc": 1724941019.0,
      "score": 5
    },
    {
      "id": "lkgzznm",
      "body": "You doing okay over there?",
      "created_utc": 1724920480.0,
      "score": 4
    },
    {
      "id": "lkncz0g",
      "body": "The whole album is transformative. I discovered it during a very difficult isolated time in my life, and I find myself coming back to it (especially being Canadian, it feels like home). It's more than just music for me. If it helps even marginally, that's a positive in my eyes.",
      "created_utc": 1725012723.0,
      "score": 1
    },
    {
      "id": "lkjojqb",
      "body": "You have never been rejected and divorced and have kids with them?",
      "created_utc": 1724956769.0,
      "score": -3
    },
    {
      "id": "lki693w",
      "body": "Honestly all the positivity I learned in life I learned from her. She showed me time and time again that the world is a beautiful place even with its horrors. She was so strong ❤️ She would work with people who had suffered immensely: genocide victims, refugees, rape victims. And somehow she still loved life.",
      "created_utc": 1724940185.0,
      "score": 15
    },
    {
      "id": "lkh1k4b",
      "body": "I have the same question for u.",
      "created_utc": 1724921505.0,
      "score": -5
    },
    {
      "id": "lkktggc",
      "body": "Then use what she's taught you to carry her memory with you!  She lives through you.",
      "created_utc": 1724969623.0,
      "score": 6
    },
    {
      "id": "lkh1pkp",
      "body": "I have a little cold right now that’s been tough but I’m doing pretty good. :) I just thought your comment of “just” meant maybe you were struggling with some of this stuff. Hope you’re doing okay.",
      "created_utc": 1724921603.0,
      "score": 7
    },
    {
      "id": "lkh1tmr",
      "body": "Ok,cool",
      "created_utc": 1724921676.0,
      "score": -4
    }
  ]
}