{
  "id": "1hjg32o",
  "title": "I was repeatedly raped by my father as a child and I'm seriously considering suicide now ",
  "selftext": "I have memories from as far back as I can recall of being molested by my father. I used to sleep with my parents when I was little. Every night he would put his hands inside my pant and rub my vagina. He would make me hold his dick. Sometimes he'd get on top of me, take off my shirt and put his mouth on my breasts that weren't even developed yet. I was younger than 8 years old. He would try to push himself into me but it didn't completely penetrate most probably because it would take a lot of force and mom would wake up. I used to wake up in the middle of this but I absolutely froze, I never screamed or pushed him. In the morning he'd tell me that sometimes when he's sleepy, he confuses me for my mom. Again, I was a preadolescent child. \n\nI never told a soul. I'm to scared of the aftermath. I'm afraid my mom won't believe me, or worse, she knew all along but never did anything to stop it. I'm 20 now and still living with my parents. He thinks that I've forgotten everything and we live as if we're a happy family. But every night for years I break down crying and contemplating suicide.\n\nI'm set to move out by next year but I don't think I'll be able to last that long. I have grown up to be a very insecure, emotional, anxious, depressed, and self destructive person. I have severe social anxiety and can't function well in society. I have managed to find a job that will get me out of this house but I don't think I'll be able to live alone in this condition. I do have a loving boyfriend who knows all this and is very supportive. But I don't see a future with him due to some other reasons (one of them being my mental health). I've tried therapy but it didn't help. I've gotten very close to suicide attempts in the past but so far I've been too coward to go through it. I just want to end it and it feels like nothing matters anymore.",
  "created_utc": 1734806227.0,
  "score": 515,
  "num_comments": 96,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1hjg32o/i_was_repeatedly_raped_by_my_father_as_a_child/",
  "comments": [
    {
      "id": "m368zlv",
      "body": "Hey, I hope that when you move out you'll last as long as need be. Sending good vibes. Stay safe.",
      "created_utc": 1734806941.0,
      "score": 133
    },
    {
      "id": "m36e25d",
      "body": "Your father is an evil evil man. If you can, live your best life even just to spite him. If you commit suicide he will have won.",
      "created_utc": 1734808666.0,
      "score": 323
    },
    {
      "id": "m36jgdn",
      "body": "I’m so so sorry you had to to go through this. Your father deserves to be hanged or at least be jailed for life.\n\nDon’t give up on therapy. If one form of therapy doesn’t work try another one. Another therapist. Don’t give up. You can’t even imagine how life can feel like as soon as you’ve overcome all of these things.",
      "created_utc": 1734810545.0,
      "score": 72
    },
    {
      "id": "m36elc3",
      "body": "I feel for you. He’s evil but you can’t let him win. Any person who has done wrong must never get the satisfaction of destroying you. Look into his eyes and make him realise you haven’t forgiven and forgotten things yet. Hustle and make your own life.",
      "created_utc": 1734808847.0,
      "score": 71
    },
    {
      "id": "m36hjxr",
      "body": "stay safe sister when i grow up if my acc. is still active just give a heads up and i will be there to help u sister , stay strong u r a strong women to say it and live with them till now . I am always with u and wish that never anything bad happens to u . \n\ndont commit ok , u have a brother now I am 19 . i request and order u to live ur life happpily 😊 .",
      "created_utc": 1734809869.0,
      "score": 30
    },
    {
      "id": "m36t581",
      "body": "Hey. I'm 41. I also had stuff happen to me. Please seek therapy now. I mean trauma therapy from a professional. Not because of some big mess that might happen now, but so you can have a beautiful future because you can. Someone mugged you, robbed from you, hit and ran your car, broke into your home - all of these things people say happened to them without shame for what people might think of *them*. You were an 8 year old. Hell it doesn't matter if you were 105. It was wrong. You were stolen from. Take it back by standing up now and getting some help (because we don't know how to navigate this alone). It will be okay. Get out of there and get help. Suicide isn't the way to go. My first attempt was at 17. My last very serious attempt was about 4 years ago and it messed me up pretty badly. It's not the route to take. You don't need to. Reach out.",
      "created_utc": 1734814032.0,
      "score": 27
    },
    {
      "id": "m36ohbv",
      "body": "get some money n move out asap. then fucking sue that man. he deserves the worst n you my dear the best. stay strong.",
      "created_utc": 1734812337.0,
      "score": 23
    },
    {
      "id": "m36lxou",
      "body": "Thats not your fault. You were molested your dad should be in prison. When the time is right it might not be now but later in the future when you have the courage tell your mom about it. Some men these days are pure evil. You are amazing sweetheart 💕 life is worth living despite all the hard times but you have to fight and fight hard to see that light over the mountain ⛰️ ☀️",
      "created_utc": 1734811417.0,
      "score": 14
    },
    {
      "id": "m36kf1r",
      "body": "I have no words for you, except that you should tell the police or anyone whom is close to you, like other family members that you trust and if not a family member, perhaps a friend. \n\nI would like to help but i wouldnt know where you are and i have my own problems to deal with ( like myself ) but yeah. Ive dealt the same from my father too. So goodluck mate.",
      "created_utc": 1734810886.0,
      "score": 10
    },
    {
      "id": "m36qpu6",
      "body": "There are no words I could ever say to assuage the severe trauma you have lived through. I commend your resilience, I hope you realize how very STRONG you are. You have so much to give to the world and the trauma you lived through will save the lives of countless others when you are so bold to share as you did here.\n\nPersonally, the sexual trauma I lived through, I have to remind myself \"nosce te ipsum\" Latin for know thyself. Tap into your heart, tap into that pain because sometimes in life, using trauma as motivation to grow is the precipice and beginning of our emotional recovery.\n\nI genuinely am interceding for love to radically cover you, for safety to envelop your mind, for peace to fall upon your soul. I am so sorry you're hurting OP. We are here for you, please don't go. ❤️",
      "created_utc": 1734813152.0,
      "score": 10
    },
    {
      "id": "m375rba",
      "body": "All I can say is I’m so very sorry. Please wait until you move out, and you’re free from that environment. \n\nI think it would be best if you could try to find a different type of therapy. I’m not sure if you’ve mentioned what you’ve already tried. Have you already tried EMDR?\n\nAlso, if you’re in the US, this link may help. It might help point you in the right direction. Don’t give up, at least not yet. ♥️\n\n [https://www.childhelphotline.org](https://www.childhelphotline.org)",
      "created_utc": 1734818635.0,
      "score": 8
    },
    {
      "id": "m36tyv9",
      "body": "I have no idea what you are feeling because only you know that and would be wrong for anyone to say they know how but I have been at that door multiple times in my life, most recently a year ago. I know things are heavy sweet heart and no child should EVER have to carry that burden but you are needed here. This world needs you. I know it seems like things are forever out of your favor or hard to accomplish, but you can do great things and make a difference. You seem like you have a good head on your shoulders. I believe in you. You have no idea how much the world looks forward to your smile.",
      "created_utc": 1734814329.0,
      "score": 6
    },
    {
      "id": "m37qaqi",
      "body": "My friend has the same story eventually she ended up telling her mom and she didn't believe her first and he kept on doing this with her until her brothers saw him doing it with her again and they all kicked him out of the house it was a hard process she said it still traumatizes her everyday",
      "created_utc": 1734826682.0,
      "score": 5
    },
    {
      "id": "m376scn",
      "body": "I'm really sorry this happened to you. I hope you truly realise your father is an evil person. I also hope you don't give up on theraapy. I also dont know what is going on with your boyfriend but maybe he could help untill you move out? Please know that there are people that, even though don't know you, hope that youll make it out okay. Sending all the love <3",
      "created_utc": 1734819014.0,
      "score": 4
    },
    {
      "id": "m37ivpr",
      "body": "Suicide is taking something with (even just a little) potential and reducing it to zero. Your life is not over and as you probably have learnt, it's unpredictable. I am not in your shoes and I can only fathom what you must be going through, however life is not in a permanent state, take my word for it.\n\nAlso, suicide is the biggest, most important choice you could make. If you are unsure enough to write a post, then you aren't sure at all. \n\nKeep your chin as high up as you can and remember that you have endured wayy more pain than most people could ever handle. That means you are strong, and strong people should not be going to waste. Recovery is slow, and many times, it can't even be fully accomplished, but it's always possible to a great degree. \n\nWe'll be thinking about you, break a leg",
      "created_utc": 1734823705.0,
      "score": 5
    },
    {
      "id": "m39h3z2",
      "body": "Suicide is not an option. You must outlive your father that tortured you over from your past",
      "created_utc": 1734859850.0,
      "score": 3
    },
    {
      "id": "m39s95o",
      "body": "Check out the book The Body Keeps The Score. It’ll help answer a lot of questions you may have.",
      "created_utc": 1734867895.0,
      "score": 5
    },
    {
      "id": "m379q9n",
      "body": "Moving out plus therapy could be the start of a beautiful new life for you. Delay the suicide for a few more years, at least, so you can find out what’s ahead. Wishing you the best.",
      "created_utc": 1734820106.0,
      "score": 3
    },
    {
      "id": "m38008k",
      "body": "Just stay alive, your father doesn’t care for you, whether dead or alive. Just live for yourself, that way you can enjoy this dirt ball somewhat. I’m sorry to hear of the circumstances you were put through",
      "created_utc": 1734830699.0,
      "score": 3
    },
    {
      "id": "m38dnox",
      "body": "Please report him to the police.. I'm absolutely horrified and sorry for what happened to you. He shouldn't get away with this!! What happened to you is horrible and he should suffer.",
      "created_utc": 1734836525.0,
      "score": 3
    },
    {
      "id": "m38lg6x",
      "body": "Don’t give that subhuman piece of shit the satisfaction. Live a better live in spite of him.",
      "created_utc": 1734840123.0,
      "score": 3
    },
    {
      "id": "m38t40w",
      "body": "It is him who should not you, please hang on.",
      "created_utc": 1734843953.0,
      "score": 3
    },
    {
      "id": "m391nl8",
      "body": "I hope you can get out of that place asap, he doesn't deserve spending another second close to you.\n\nHonestly, the best thing u can do now I just finding an activity that'll bring you some sort of fulfilment/achievement. Something close to a hobby, but just make sure u really like whatever you're doing. Don't give up on searching for knowledge, be a good person (to people who don't hurt you) and just try to do your best. Which might not be 100% but it can still be your best. Abusers don't want victims trying to find happiness\n\nAlso try to find another kind of therapy. There's so many methods you can try before giving up",
      "created_utc": 1734848971.0,
      "score": 3
    },
    {
      "id": "m39shl9",
      "body": "I related to this a lot, I've been through a similar situation, I'm here for you",
      "created_utc": 1734868055.0,
      "score": 3
    },
    {
      "id": "m39thj4",
      "body": "How has he not yet killed himself from the guilt of raping his own child?",
      "created_utc": 1734868719.0,
      "score": 3
    },
    {
      "id": "m3a2iwm",
      "body": "I can never understand your pain but I can tell you that it's not your fault, he doesn't define you, you're much more than this, please don't let him destroy you, trust me you deserve to live",
      "created_utc": 1734873909.0,
      "score": 3
    },
    {
      "id": "m3aonra",
      "body": "I’ll tell you the same thing I told my sister whose father did the same to her.\nWith time you will heal. You will learn to process and grieve what he took from you. You will find love. You’ll experience the best days of your life which you haven’t even gotten to have yet but they are coming. You’ll have a great job and a beautiful home and a pet you can’t stop obsessing over and maybe even kids someday. You’ll go to concerts and try amazing food and travel the world.\nAnd slowly but surely, the oppressiveness of what he did to you will fade. You’ll stop thinking about it every day. It’ll cross your mind every few days. Then maybe once a week. Eventually it will fade into something that you rarely consider and the pain will lessen as well.\n\nHowever, your father (which I hate to even call him that) will think about what he did to you every single day for the rest of his life. In his mind he knows he’s a predator and a monster and he will be fearful you will tell on him (which you should when you are ready). He will be haunted by it until his dying day.\n\nYou will forget him.\nHe will never forget you.\n\nPeace is yours and HE IS THE ONE who should be tormented.\nIt was not your fault girl. No matter if you didn’t scream or cry or tell anyone.\nYou hold no blame.\nWishing you the utmost peace and please give yourself a chance to live a beautiful life. Don’t let him take anything more from you.",
      "created_utc": 1734883053.0,
      "score": 3
    },
    {
      "id": "m3ax9u0",
      "body": "He is the one who should commit suicide not you",
      "created_utc": 1734886076.0,
      "score": 3
    },
    {
      "id": "m3bnol3",
      "body": "Try another therapist specific to your trauma. ",
      "created_utc": 1734894786.0,
      "score": 3
    },
    {
      "id": "m36pxxm",
      "body": "You gotta tell your mom bro",
      "created_utc": 1734812873.0,
      "score": 4
    },
    {
      "id": "m36wv02",
      "body": "I want you to live and feel calm, content, and occasional joy.   I hope you can.",
      "created_utc": 1734815382.0,
      "score": 2
    },
    {
      "id": "m37hew2",
      "body": "i really wish i could beat that man for what he has done to you, his child. \ni am being serious. if i could i would scoop his eyes out with a rusty spoon. i truely hope your father dies a horrible painful death. \ni am so sorry you had to go through this at such a young age… try talking to a help line, it helped me when i was feeling shity. just dont do it. dont let him get away with this",
      "created_utc": 1734823113.0,
      "score": 2
    },
    {
      "id": "m37rttq",
      "body": "Remember, you are loved. You mean something to someone. And those who seek and persue evil, will find it, if they choose to pursue devilish pleasures, they will get exactly what they deserve. He will get whats coming to him. Don't give up. This will make you stronger, and there is someone out there that will one day need you, whether it be someone in a similar situation, someone who is suicidal, or someone who needs a boulder to lean on, and you will want to have been there for them. Suicide is a permanent solution to a temporary problem. This will pass over, and no, while it will never fully go away, the pain and the distress, it will lessen, and you will be able to learn to cope with the pain and that distress, you will grow, thrive even, but only if you keep fighting. That you keep getting up every morning and decide, \"I am not going to let my beginning define my ending\". Trust me, I am talking from experience, I was in a similar situation, I was SA'd as a kid, and I never once told anyone until about a decade later, and everyone had my back, sure, I lost some people, but, it was a price worth paying. I will back you up the whole process, you will not fight through this alone, I promise.",
      "created_utc": 1734827298.0,
      "score": 2
    },
    {
      "id": "m384xvg",
      "body": "I’m very sorry this happened to you and I hope your mother didn’t know but either way, it’s a sickness. It has NOTHING to do with you. I’m in therapy and was SA as a child and am going to have EMDR therapy in January. I’ve been with this therapist over a year and she has helped me immensely. I had to go through a few to find her. Please try therapy again and with a woman. I’ll let you know how the EMDR goes.",
      "created_utc": 1734832742.0,
      "score": 2
    },
    {
      "id": "m38he8d",
      "body": "You need to leave that house ASAP. You really should consider moving into with ANYONE else that you have as an option. Even sleeping on a couch would feel better. You are an adult, you can pack up a suitcase and leave in a single afternoon, nobody can stop you. If he puts hands on you call the cops immediately - don't hesitate. \n\nYou are an adult, you can tell your parents \"my friend asked me to be their roommate or you found a good sublease online\". Just make up a lie to placate them. Honestly it would be best if they don't even know your new address. Then when you are out of the house go full no contact. \n\nMake sure to take everything that has value to you, and document everything you leave behind with photographic evidence in case that demon tries to destroy your stuff while your moving out. \n\nDon't commit, you said you have a job right? So you have a bit of income. Do you have reliable transportation? Is there anyone in your life you could move in with, relative, boyfriend, friend etc... or maybe find someone online looking to sublet a room.",
      "created_utc": 1734838259.0,
      "score": 2
    },
    {
      "id": "m38omvb",
      "body": "Please this wasn’t your fault, that’s child sexual abuse and you should completely consider having them locked up and then naming it why it is so you can be free - he deserves it.\n\nI’ve recently come out as a survivor of childhood neglect, I get you and it really wasn’t your fault, you were a child and he’s worthless not you, you’re a survivor 🫶",
      "created_utc": 1734841646.0,
      "score": 2
    },
    {
      "id": "m38xpny",
      "body": "When you move out the reminder of the pain would be gone, I’m furious for you but there’s always a way out as someone that has diagnosed PTSD it took me years to find a therapist that works, if it helps go for med management and if you ever feel like you need additional help get a care manager who will always be there to assist you. You are beautiful and please tell yourself repeatedly this was NEVER your fault I wish you a lifetime of happiness",
      "created_utc": 1734846543.0,
      "score": 2
    },
    {
      "id": "m39tsaj",
      "body": "I know therapy hasn’t helped, but sometimes it just takes finding the right match for you.  Please keep trying.  I have been suicidal recently. There is a path out.  It’s slow and uncertain but can get you to a better place.",
      "created_utc": 1734868915.0,
      "score": 2
    },
    {
      "id": "m3aq7qr",
      "body": "I'm so very sorry for what happened to you, you didn't deserve anything that shit did to you. \nI hope you get out of this house soon and improve your mental health sis. You deserve the best, I hope you get better soon 🫶",
      "created_utc": 1734883610.0,
      "score": 2
    },
    {
      "id": "m3c14zy",
      "body": "So damn sad",
      "created_utc": 1734899271.0,
      "score": 2
    },
    {
      "id": "m3i5fnd",
      "body": "Hi, I’m suicidal for similar reasons and am trying so hard to cope with assaults I experienced as a toddler. I don’t know how long I’ll make it here either. I’m so so sorry this happened to you and that you’re in pain. You deserve the most beautiful life and to be safe.",
      "created_utc": 1734992046.0,
      "score": 2
    },
    {
      "id": "m395h5o",
      "body": "U should just kill him tbh",
      "created_utc": 1734851512.0,
      "score": 4
    },
    {
      "id": "m36s743",
      "body": "Theirs nothing I could ever say that would help other than if you want him dead or at least severely fucked up go to tell the local gang he’s a dirty pedo. Absolutely zero tolerance for pedos on the street. Seen it happen personally what they do to them, long hospital stays with permanent damage and severe pain for the rest of their of life or death\n\nLet them make him suffer, they happily will",
      "created_utc": 1734813686.0,
      "score": 1
    },
    {
      "id": "m3akjyi",
      "body": "My honest piece of advice is to MURDER HIM IN HIS SLEEP I'm a 100% serious if your going out might aswell take him with you",
      "created_utc": 1734881586.0,
      "score": 1
    },
    {
      "id": "m3czzz4",
      "body": "You’re not alone. My father did and my mother knew, yet she still blamed me indirectly. However, they did not know that I knew. Sigh. I’m in my 60’s. I didn’t give up. I encourage you don’t ever give up! \n\nI heard that EMDR therapy is supposed to help. I’m planning to do that once I save up my money.",
      "created_utc": 1734911511.0,
      "score": 1
    },
    {
      "id": "m3j68b6",
      "body": "Please please please tell your mom. Don’t worry about the aftermath. You don’t deserve to have your life taken from you over this. Once you let your mom know, it will get easier. We are all rooting for you",
      "created_utc": 1735005994.0,
      "score": 1
    },
    {
      "id": "m3kybef",
      "body": "Please hang in there. You’re brave and smart and lovely. As soon as you move out, it’ll start to feel like an old, bad dream that you can barely remember now.\n\nPlease hang in there. You’re not alone.",
      "created_utc": 1735041174.0,
      "score": 1
    },
    {
      "id": "m3ryxf0",
      "body": "Please don't. Everybody is supposed to live out their natural life. People who commit suicide probably go to hell.",
      "created_utc": 1735156858.0,
      "score": 1
    },
    {
      "id": "m3tcs7h",
      "body": "There a lot of good things waiting for you! Life is good!",
      "created_utc": 1735176913.0,
      "score": 1
    },
    {
      "id": "m3xky7a",
      "body": "I'm not expert in anything so my advice might be awful but i would personally tell my mom if her husband was a monster. I feel like this is something that people need to talk about even if it's scary. whatever her reaction is, it's not your fault for telling what HE did. and I personally told my mother about my (not very serious) sexual abuse experience even tho I didnt want to for overa decade, and about my depression and about my suicidal thoughts and her reactions to those range from not caring to anger but frankly I don't mind, I'm just happy I let it out.",
      "created_utc": 1735247634.0,
      "score": 1
    },
    {
      "id": "m3z13za",
      "body": "That is just horrific. I'm so sorry.",
      "created_utc": 1735266737.0,
      "score": 1
    },
    {
      "id": "m36ukij",
      "body": "Aren’t you concerned he will try to force himself onto you now?",
      "created_utc": 1734814546.0,
      "score": -3
    },
    {
      "id": "m3ad9vm",
      "body": "If your mom was there then why was this terrible act done by him?\nSecond what one thing I do is not think about it, example suppose l lost 100 bucks the I will be sad when I am thinking about it, but when I am not thinking sadness disappears, life is about letting it go, move on op, forget what happened in the past, start from zero and don't think about the past anymore, if I tell you like about my past you will cry, so move on",
      "created_utc": 1734878774.0,
      "score": -2
    },
    {
      "id": "m36dsbs",
      "body": "[deleted]",
      "created_utc": 1734808572.0,
      "score": -24
    },
    {
      "id": "m38n6g4",
      "body": "Sounds like he ruined your life. There’s no coming back from that no matter what other people say. You are scarred. Everyone dies eventually and only then will all suffering cease. All joy will cease too. You could just continue to live broken. That’s what I do. I think about suicide a lot but I don’t go through with it. \n\nOblivion awaits you.",
      "created_utc": 1734840942.0,
      "score": -2
    },
    {
      "id": "m36jqon",
      "body": "You should break up with your bf regardless of what you do. Stringing people along and wasting their time is never cool, unless he knows you don't see a future with him and wants to stay.",
      "created_utc": 1734810645.0,
      "score": -28
    },
    {
      "id": "m36cwc4",
      "body": "Thank you so much",
      "created_utc": 1734808266.0,
      "score": 52
    },
    {
      "id": "m36kvo8",
      "body": "I'm really trying my best.",
      "created_utc": 1734811045.0,
      "score": 138
    },
    {
      "id": "m36l4ut",
      "body": "I'll consider therapy again. Thank you for the suggestion and your kind words",
      "created_utc": 1734811136.0,
      "score": 45
    },
    {
      "id": "m36owzo",
      "body": "Thank you so much ❤️",
      "created_utc": 1734812497.0,
      "score": 15
    },
    {
      "id": "m36p0mi",
      "body": "I'm trying. I'll move to another state next year for a job after college ends",
      "created_utc": 1734812534.0,
      "score": 18
    },
    {
      "id": "m470kbz",
      "body": "People; men and women have been evil since the dawn of time ",
      "created_utc": 1735395531.0,
      "score": 1
    },
    {
      "id": "m3rza09",
      "body": "Nobody should.",
      "created_utc": 1735156988.0,
      "score": 1
    },
    {
      "id": "m3af3o6",
      "body": "honestly, reading this makes my stomach feel ill i wish i could kill him 😀",
      "created_utc": 1734879511.0,
      "score": 1
    },
    {
      "id": "m36g1xz",
      "body": "This is supposed to be a support page, not a tell someone to basically do it page. Yikes dude. Quite literally says do not encourage the intent.",
      "created_utc": 1734809341.0,
      "score": 28
    },
    {
      "id": "m36kqhk",
      "body": "He knows. I've been very open with him about this.",
      "created_utc": 1734810995.0,
      "score": 9
    },
    {
      "id": "m3s2zlx",
      "body": "I've been suicidal for the past year and honestly, I don't know what to say to someone who is experiencing such a life.\nThe best thing you can do is clear your thoughts, and decide whether the future that you have ahead of you is one that you want to live or not.\nEverybody says life is worth it, but in the eyes of one who has lived a terrible life, it simply isn't.\nLife is ultimately the only thing you have, once you die, you stop living and everything disappears, all the pain, discomfort, anger, sadness. gone, forever.\nBut that goes the same, every pleasure, treat, surprise and warmth, will cease to exist when you die.\nDoes the burden you carry know weigh heavier than the pleasures of life that lay in your future?",
      "created_utc": 1735158388.0,
      "score": 2
    },
    {
      "id": "m36ztjs",
      "body": "Don't give him the satisfaction of winning.",
      "created_utc": 1734816462.0,
      "score": 79
    },
    {
      "id": "m370rdn",
      "body": "I've been to multiple therapists before I found the right one. Don't give up. The next one you try may be the one. One thing that helped me was writing a letter to one of my abusers. It was 10 pages long and could have gone on for more. My therapist told me I didn't have to, but I mailed it to him. I never got a response, but I got the satisfaction knowing they knew what they did to me. Another thing you could do is write it and burn it as a way of getting it out and letting it go.",
      "created_utc": 1734816814.0,
      "score": 9
    },
    {
      "id": "m374uei",
      "body": "i love my therapist, but i’m also looking for an additional therapist just for trauma. hope you get the help you need",
      "created_utc": 1734818299.0,
      "score": 10
    },
    {
      "id": "m3959jx",
      "body": "You can do this! I believe in you.",
      "created_utc": 1734851365.0,
      "score": 2
    }
  ]
}