{
  "id": "1jzunt2",
  "title": "Male rape victim",
  "selftext": "I am constantly shamed for being a male rape victim. People (mostly religious people) have told me that the reason I’m bisexual is because I was touched as a child by my babysitter.\n\nI was also a victim of domestic abuse and rape by my ex-girlfriend. People have told me that my girlfriend didn’t rape me because “women can’t rape,” even though she did. \nThey’ve told me that I should have hit back when she hit me, but I was raised to treat women with respect. I couldn’t bring myself to retaliate because I believe it’s wrong, and besides, she could have turned it against me.\n\nI’m deeply depressed, not just from what I went through, but also because of how society views male victims of rape. I don’t want to live anymore. This world is destroying me. ",
  "created_utc": 1744730656.0,
  "score": 487,
  "num_comments": 99,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1jzunt2/male_rape_victim/",
  "comments": [
    {
      "id": "mn8yad4",
      "body": "I was raped by my older cousin when I was young.  I have been struggling to figure out what I'm sexy attracted to.",
      "created_utc": 1744731050.0,
      "score": 131
    },
    {
      "id": "mn90qup",
      "body": "Im so sorry you went through that, regardless of your gender rape is still rape and dv is still dv. I cant even imagine how horrible you must feel but please don’t give up yet, I rly recommend talking to a therapist as they might help you work through some of the trauma.",
      "created_utc": 1744731782.0,
      "score": 55
    },
    {
      "id": "mn92n9r",
      "body": "Sorry to hear that. People are dumb. Everyone thinks they know everything and have answers for everything, it's ridiculous. \n\nIt probably didn't cause you to be bi. Most gay and bi people have not been abused. I never was.\n\nAnd women can absolutely assault men. Anyone who thinks otherwise is ignorant af",
      "created_utc": 1744732341.0,
      "score": 28
    },
    {
      "id": "mna3s21",
      "body": "Hey if this makes you feel better. I have two times in my undergraduate degree falsely accussed of sexual harrassement by a girl who spread gossip. Obviously people listened to the women and dehumanised me. So i can understand a bit",
      "created_utc": 1744743341.0,
      "score": 11
    },
    {
      "id": "mn91fxr",
      "body": "It’s not fair for victims like yourself to be treated this way. Anyone can be a victim and anyone can be the perpetrator. I’m so sorry you have to go through this, no one should have to. As an SA victim myself I can’t speak on this subject for long, but there are resources and communities you can turn to for support. Your trauma is just as valid as the next persons, and while I don’t know you personally, I’m proud of you for making it as far as you have. That’s not easy.",
      "created_utc": 1744731988.0,
      "score": 12
    },
    {
      "id": "mna8zvg",
      "body": "I’ve also experienced being raped as a child, sexually assaulted as an adult, and DV as well. \n\nThe experiences don’t need to define who you are, and you also don’t need to let others define either who you are, or the truth of your experience. I have also had a lot of invalidating experiences from others, particularly around being sexually assaulted, and abused by my female partner. You were right, sadly, not to retaliate, as you are very wise to understand that it could easily be turned around on you. \n\nI personally don’t like the word victim. I also don’t like survivor. Both of them locate our humanity in the our worst moments. I’d recommend working with a therapist and trusted friends and talking about it and talking about it until, eventually, they just become things you’ve been through, and you become more than the sum of them. \n\nYou keep going, even for one more day, when you feel like you can’t. If the world is wrong, let them be wrong. Good luck to you. \n\nYou know the truth.",
      "created_utc": 1744744922.0,
      "score": 6
    },
    {
      "id": "mnb36h3",
      "body": "I got raped by a girl I used to go clubbing with when I was 19, apparently I was “ just too fucking hot” fuck those people",
      "created_utc": 1744754078.0,
      "score": 5
    },
    {
      "id": "mn9vktt",
      "body": "It's disgusting that it's 2025 and people still don't believe men can be raped. Im so sorry OP.",
      "created_utc": 1744740866.0,
      "score": 11
    },
    {
      "id": "mnbqe1l",
      "body": "Before I transitioned, when I was still male identifying, I was raped and abused by my ex-wife. It still fucks with me almost 2 years later. My depression and anxiety have only increased over time and I've started self-harming just to cope with the emotions.\n\nEven after transitioning, when I tell people, no one takes me seriously, including my closest girl friends. It's super triggering because it makes me feel like people still see me as male since I know if a cis woman told them what I've had done to me, they would react way differently.\n\nThe rich part is that they all dump on me constantly and expect me to listen, and I do. I just get no reciprocity. It's made me far more isolated than ever before. I literally just had a mental breakdown about it all yesterday and have had to move temporarily to figure it out. Thus, why I'm here.",
      "created_utc": 1744761951.0,
      "score": 4
    },
    {
      "id": "mnaejen",
      "body": "Hilarious that a religion based off of being good to the people around you is the main perpetuater of shaming male rape victims ☕",
      "created_utc": 1744746595.0,
      "score": 6
    },
    {
      "id": "mn934pu",
      "body": "It's not your fault. Help is available.",
      "created_utc": 1744732482.0,
      "score": 4
    },
    {
      "id": "mn93gn9",
      "body": "I am so sorry that these terrible things happened to you. \nI am so angry that you aren't being listened to or believed. To go through traumatic experiences like you have and then have someone diminish them is not right. It's not right at all. \n\nYou deserve to be loved and treated with respect. There is definitely a difficulty in many societies about victims not being believed or their concerns being belittled, but it does not make it right and there are many people out there that will be supportive of you.\n\n🫂",
      "created_utc": 1744732582.0,
      "score": 3
    },
    {
      "id": "mnaciwl",
      "body": "hey i completely understand you, why don't you try going to the police?",
      "created_utc": 1744745995.0,
      "score": 2
    },
    {
      "id": "mnagwnz",
      "body": "You are not alone and i hope your ex gf gets punished for what she did to you, i'm so sorry",
      "created_utc": 1744747287.0,
      "score": 2
    },
    {
      "id": "mn9ijjz",
      "body": "Please know your experiences and feelings are valid. What happened to you is disgusting but you are not alone. Anyone who tries to discount your experience or saddle you with the blame is an evil person who should be avoided. But the world is full of wonderful amazing people who you already know or haven't met yet who are eagerly waiting to help you live your best life. These experiences do not define you.",
      "created_utc": 1744737060.0,
      "score": 3
    },
    {
      "id": "mn9r10d",
      "body": "I'm so sorry for you bro",
      "created_utc": 1744739505.0,
      "score": 3
    },
    {
      "id": "mnbl58z",
      "body": "I was SA'd by an abusive female partner when I was 18 and you are absolutely right. Left wingers and radfems are just making it worse. I just have to mute block and ignore those sorts now.",
      "created_utc": 1744760135.0,
      "score": 3
    },
    {
      "id": "mn9aste",
      "body": "I’m very sorry to these about you being shamed for something horrific which you can’t control.  Do you want me to speak to you to make sure you’re ok?",
      "created_utc": 1744734790.0,
      "score": 2
    },
    {
      "id": "mna6n6p",
      "body": "[removed]",
      "created_utc": 1744744204.0,
      "score": 1
    },
    {
      "id": "mnaik1x",
      "body": "I had repressed the memory of when I was SA'd 10 years ago by one of my friends, only within the past few months had it crossed my mind again and it still lingers back there each day. I didn't tell anyone due to shame and I didn't want to cause conflict",
      "created_utc": 1744747773.0,
      "score": 1
    },
    {
      "id": "mnc9s8v",
      "body": "People don't understand that an abuser *selects* who they abuse because they know the victim won't retaliate. Anyone who says \"just hit back\" has never been abused, especially when it's a female abusing a male. Remember that you aren't \"weak\", you were kind and she took advantage of that. You might find it hard to be kind again but there are people who will love you for your kindness. I hope they find you.",
      "created_utc": 1744768872.0,
      "score": 3
    },
    {
      "id": "mnekp3e",
      "body": "Hey there I’m sorry this happened to you. I was abused by a female family member. It is literally the hardest thing I’ve experienced in my entire life hands down. And yea I’m with you, in real life I rarely tell anyone because of what you said, people just don’t believe us. Sending you strength bro.",
      "created_utc": 1744809541.0,
      "score": 1
    },
    {
      "id": "mnip8jl",
      "body": "Sorry to hear what you are going through. I can definitely relate. I was sexually abused by a “friend” when I was a child.",
      "created_utc": 1744856755.0,
      "score": 1
    },
    {
      "id": "mnis58x",
      "body": "That’s so foul. None of what happened is your fault. \n\nNot everyone will treat you like that. I know it probably feels like everyone is awful, and a lot of people are, but there are descent human beings out there. \n\nI hope you end up meeting some of those people instead of the people who seem to have zero compassion.  ",
      "created_utc": 1744857859.0,
      "score": 2
    },
    {
      "id": "mnjnegu",
      "body": "I'm a rape victim as well. Sometimes I can't take it anymore.",
      "created_utc": 1744873189.0,
      "score": 1
    },
    {
      "id": "mnosidn",
      "body": "I really hope you’re in therapy or you get into it soon. I was also a victim of male sexual assault and I of course too have been told “the only reason you’re gay is because you were molested.” Meanwhile I knew I was gay years before any of that, and it’s unfortunately little known that boys/men often get assaulted BECAUSE we’re gay or effeminate, a clear target, not suddenly gay (or bi) because we were assaulted. \n\nJust know not all of society views male rape the same way and there are thousands of people that are here for you and understand what you’ve gone through. I’ve met many straight men who were open about it and don’t let the societal shame get in the way of their actual healing and processing. You already have enough to deal with. \n\nWhat parts of society may think is not what matters as much as what you think about yourself does. Coming from a transsexual, it is 1000% more important to live for yourself and be able to life with yourself than to live for others. It’s healthier for you and for them to focus on yourself and not let their shallow words have any power beyond being spoken. People will always judge and be nasty- stay away from those people. \n\nI am so sorry you’re dealing with this. There is a way out. I used to be ashamed of being effeminate, being gay, wanting to be a woman, ashamed of being assaulted, shame shame shame. I have let go of a lot of it and I can honestly say I am so much happier and better off without holding societies ideals above my own- it took a long time but logistically I know DAMN well male rape is extremely common and not nearly as rare or shameful as it’s made out to be, and it’s simply just not something to be ashamed of. Factually, it’s not, it’s a cultural thing that we’re made to be ashamed of it. I feel other feelings, but I don’t really feel shame. It’s not my fault or yours and I’m sorry people are trying to make you feel like it was. \n\nIt’s sad we aren’t given compassion but you can definitely find it if you look a little harder :) I’m here man",
      "created_utc": 1744939582.0,
      "score": 1
    },
    {
      "id": "mns2ojb",
      "body": "This was 3 days ago but I hope you've been treating yourself well. \n\nI too have experienced a staggering amount of sexual assault, and it's made me confused whether I was actually nonbinary and bi as well. It takes time, but sometimes the answers aren't immediately obvious now--getting to a point of safety takes more priority. I did realize that I really was nonbinary and bi, not because I experienced trauma, but because what society wanted for me was too limiting/boring. I'm sure I would've ended up the same had I not experienced trauma.",
      "created_utc": 1744992451.0,
      "score": 1
    },
    {
      "id": "mo11ni2",
      "body": "Ash a SA victim you WERE assaulted. You deserve to get the same treatment I got when I told ppl about my sa. Sympathy. those people are HORRIBLE! I hope you nothing but the best and you find a way to heal. even though you can never fully.",
      "created_utc": 1745115488.0,
      "score": 1
    },
    {
      "id": "mo44t9l",
      "body": "Hey, i'm really sorry to hear that, It's hard, it's really hard when you get told that you're not valid, for any type of reason and if a lot of people tell you that, it will make it even harder to believe when someone tells you that you're valid, but you need to try really hard to ignore all those people, EVERY victim is valid, doesn't matter if the abuser was a girl, a boy, your family, your friend or your partner, your case is valid and you deserve to be heard, I don't know how you completely feel, but I can imagine how horrendous you must feel, you might feel like it, but you're not alone",
      "created_utc": 1745167377.0,
      "score": 1
    },
    {
      "id": "mod9zbw",
      "body": "Rape/molestation at a young age can certainly mess up one's sexual development.  Thus, yes, it may be that you're same sex attracted in part due to abuse. But, so what? It doesn't change your value as a human being.  So why do people bring it up? \n\nYou didn't bring any of this on yourself. I know it's cliche to say it's (the rape/abuse) not your fault. But... it's not your fault. I'm so sorry all that happened to you. And I'm sorry so many people don't have more compassion. Hang in there, man.",
      "created_utc": 1745290085.0,
      "score": 1
    },
    {
      "id": "moidtc9",
      "body": "Please realise these people are absolutely not the objective world view on male rape, Many people see it differently than these awful, Disgusting, Horrible people. \n\nAs a matter of fact, it’s pretty common between religious groups to have a lack of empathy towards one another, I wouldn’t be surprised if you were a female you would have the same exact reactions.",
      "created_utc": 1745360680.0,
      "score": 1
    },
    {
      "id": "mn93lrs",
      "body": "You're completely right. Statistically, male victims of sexual violence report stigmatization at rates comparable to quantum superposition—simultaneously acknowledged and dismissed depending on the observer. Historical precedent exists (see: Caligula's Rome, where power dynamics negated victimhood narratives), but societal cognition remains delayed by ≈2 millennia.\n\nCurrent data suggest 1 in 6 men experience sexual abuse, with bisexual men disproportionately affected (CDC, 2022). Your experience aligns with documented phenomena where male victims face invalidation via gendered stereotypes (e.g., \"women can't rape\" fallacy).\n\nWhile our cold society may seem indifferent, human compassion isn't - please know you deserve support and your experiences are valid.",
      "created_utc": 1744732624.0,
      "score": -1
    },
    {
      "id": "mn9ptmu",
      "body": "Does anyone care to educate me? How does a female rape a male? There is usually a reverse size difference, power dynamic, and even a reverse hole/pole that needs «bodily consent» if you will. I just dont see how a male could physically get raped by a female? (Just wondering)",
      "created_utc": 1744739157.0,
      "score": -8
    },
    {
      "id": "mn93jlz",
      "body": "How old were you when this happened? How old was your girlfriend?",
      "created_utc": 1744732606.0,
      "score": -11
    },
    {
      "id": "mn9a1jg",
      "body": "Did you know that you could ask for help and you’d no longer of been a victim.",
      "created_utc": 1744734560.0,
      "score": -14
    },
    {
      "id": "mn9p4jo",
      "body": "I'm so sorry that happened to you. You didn't deserve it.",
      "created_utc": 1744738956.0,
      "score": 33
    },
    {
      "id": "mncjzay",
      "body": "I am so sorry. Stay strong.",
      "created_utc": 1744772706.0,
      "score": 7
    },
    {
      "id": "mnd6bo3",
      "body": "Sorry to you",
      "created_utc": 1744783217.0,
      "score": 7
    },
    {
      "id": "mn95m3q",
      "body": "Thank you, my friend. I know that both men and women can be victims of domestic abuse/rape, but because of how society views male victims, I have to stay quiet, I can’t talk about it with anyone because nobody in my social circle gets it. It’s been mostly straight men who have mocked me and called me the F-slur for speaking out, and my male friends make fun of me while my female friends support me. I think the difference is crazy. \n\nI’m going to give therapy a try, it feels like my last option. Thank you.",
      "created_utc": 1744733232.0,
      "score": 39
    },
    {
      "id": "mnjnrjy",
      "body": "Yes, women can 'easily' abuse and harass men. Very easily. Some have inbuilt manipulation in them. I have been abused both emotionally and physically. I haven't told this to anyone because I know they won't believe me.",
      "created_utc": 1744873407.0,
      "score": 8
    },
    {
      "id": "moeeh00",
      "body": "Yes don't let them.ruin your life \nDon't let them beat you\nYou are better than them\n\n\nMy saying is don't let them ",
      "created_utc": 1745311167.0,
      "score": 1
    },
    {
      "id": "mnjo1t7",
      "body": "They can be as perverted as some perverted men. I have many times been commented badly by young and old women about myself and my lifestyle. According to people men should take it and shouldn't make an argument about it.",
      "created_utc": 1744873582.0,
      "score": 1
    },
    {
      "id": "mn9zsq1",
      "body": "Yeah, friend. it’s mostly men too.",
      "created_utc": 1744742144.0,
      "score": 7
    },
    {
      "id": "mndyf9k",
      "body": "They’re not friends then. Sorry to tell you that.",
      "created_utc": 1744800519.0,
      "score": 1
    },
    {
      "id": "mnaj7pb",
      "body": "Yes, exactly. \nIt stems from, homophobia, and we know religious people love hating on lgbt people.",
      "created_utc": 1744747972.0,
      "score": 5
    },
    {
      "id": "mnb3mai",
      "body": "Sadly when men try and speak up about topics like this it’s shut down.",
      "created_utc": 1744754219.0,
      "score": 9
    },
    {
      "id": "mn96h4o",
      "body": "Thank you, friend. It’s not right, and I hate how society treats male victims. I’m constantly met with homophobic rhetoric and insults, called “weak” for what happened to me. It’s very painful. \nThis world feels so cold, so full of hate, that it makes me question if I even want to keep living in it. It’s the coldness of the world in general that makes me want to die.",
      "created_utc": 1744733505.0,
      "score": 8
    },
    {
      "id": "mnaa6zh",
      "body": "Male x male rape happens, almost daily in jail and in the streets. The difficulty to msle victims report fhis rape is worst than for female victims: shame is greater, fear of not be see as a straight man, bullying, etc. Men should learn with the women how to speak out and dennounce the perpetrator or perpetrators.",
      "created_utc": 1744745287.0,
      "score": 1
    },
    {
      "id": "mna4xog",
      "body": "Who the fuck downvoted this",
      "created_utc": 1744743681.0,
      "score": 4
    },
    {
      "id": "mn9skvh",
      "body": "Okay I will explain how she did it to me. \nWhen I say she raped me, I mean she penetrated me, with a sex toy. She held a knife to my throat and threatened to cut it if I moved or made a sound. She also put me in a position that was hard to physically get out of, it’s hard to escape in general when someone’s assaulting you from behind. \nI was 17 when this happened, I was physically weak at that age because I was underweight. She was 23, was bigger and physically stronger.",
      "created_utc": 1744739964.0,
      "score": 8
    },
    {
      "id": "mn945mk",
      "body": "I was 16 and she was 23 when we met.",
      "created_utc": 1744732788.0,
      "score": 8
    },
    {
      "id": "mnb3vkn",
      "body": "You know victims of heinous crimes will have trauma for years. I was the victim of sextortion I can’t look at myself the same again since",
      "created_utc": 1744754302.0,
      "score": 1
    },
    {
      "id": "mn9jztu",
      "body": "Did you know PTSD victims can simply let go of the past?  /s",
      "created_utc": 1744737476.0,
      "score": 0
    },
    {
      "id": "mna1a3n",
      "body": "Nah dogs are better than them",
      "created_utc": 1744742591.0,
      "score": 47
    },
    {
      "id": "mna6hcv",
      "body": "Don't compare dogs with that *thing*!",
      "created_utc": 1744744155.0,
      "score": 32
    },
    {
      "id": "mndv6fr",
      "body": "They are not friends if they do this",
      "created_utc": 1744798770.0,
      "score": 10
    },
    {
      "id": "mnig4yr",
      "body": "I was raped on my 13th birthday by my older cousin. It takes a major toll on us as so many think it’s crazy. I try to put it in the back of my mind. I wish you well and I believe you.",
      "created_utc": 1744853455.0,
      "score": 2
    },
    {
      "id": "mnkiery",
      "body": "Yea they definitely can. I'm sorry to hear that man",
      "created_utc": 1744890668.0,
      "score": 5
    },
    {
      "id": "mnotjca",
      "body": "As a gay guy who has literally absolutely nothing to gain from saying woman do assault people; because the only people I have ever had in my life or respected are women. Women do assault people. I’ve had women do some really disgusting things to me that would never have flown if a guy did it. I’m thankful it never went far and I didn’t even realize exactly how gross these girls were being. It is easier for women to put their hands all over you, act inappropriate, and nobody notice a thing. Or they notice and they excuse it.",
      "created_utc": 1744939970.0,
      "score": 3
    },
    {
      "id": "mnesfgb",
      "body": "Oh I know. They've not been my friends for many years now.",
      "created_utc": 1744812132.0,
      "score": 1
    },
    {
      "id": "mnbkl41",
      "body": "God damn right. Right here in this thread.",
      "created_utc": 1744759944.0,
      "score": 4
    },
    {
      "id": "mna5ssm",
      "body": "I’m so sorry that happened. Just reading this makes me fucking angry at that bitch. That was also a very serious crime. May I ask when it happened? Because you know, to my knowledge sexual assault can still be brought to court a few years after it happened.",
      "created_utc": 1744743942.0,
      "score": 6
    },
    {
      "id": "mna3fiw",
      "body": "But a 23 woman raping a 17 year old is believable no?",
      "created_utc": 1744743239.0,
      "score": -11
    },
    {
      "id": "mnb74lr",
      "body": "That is an option, and that option unfortunately is hidden through whats presented by the world that was structured and formed with the same exact ideologies which created the room and allowance for such atrocities to exist in. Thus the information supporting said claims in the form of victims being confined to timed terms of torment and suffering are given. \n\nOne finding themselves in such position can opt to leave that mindset and be healed completely and live a full life that has not had any problem.",
      "created_utc": 1744755384.0,
      "score": -2
    },
    {
      "id": "mn9k9fi",
      "body": "Amen 🙏🏻 \nGod is good \n💕",
      "created_utc": 1744737552.0,
      "score": -10
    },
    {
      "id": "mnae292",
      "body": "yeah fr i love my dog",
      "created_utc": 1744746455.0,
      "score": 13
    },
    {
      "id": "mnprc2q",
      "body": "I was going to say. He doesn’t need friends like that.",
      "created_utc": 1744955148.0,
      "score": 3
    },
    {
      "id": "mnlde25",
      "body": "Thank you for believing me.",
      "created_utc": 1744901225.0,
      "score": 3
    },
    {
      "id": "mnp5hwe",
      "body": "Some even like it. Until they realize the ugly truth.",
      "created_utc": 1744944605.0,
      "score": 1
    },
    {
      "id": "mna6r8s",
      "body": "Since you were a minor, assuming you’re from America, there is no statute of limitations to this crime. Meaning you can bring it to court even it happened a ridiculously long time ago. In theory, if it happened 6000 years ago and you could prove it, she would still be arrested.  \nThat works almost the same way in almost all countries.  \nSo, have you considered taking lawful action against that bitch?",
      "created_utc": 1744744240.0,
      "score": 3
    },
    {
      "id": "mnbkba1",
      "body": "This is EXACTLY why he feels like shit talking about this. Exactly why ALL make SA survivors do. What's wrong with you?",
      "created_utc": 1744759852.0,
      "score": 8
    },
    {
      "id": "mna4qjy",
      "body": "Well, it should be. Unfortunately, many people don’t believe male victims, even if they were children when it happened.",
      "created_utc": 1744743622.0,
      "score": 7
    },
    {
      "id": "mnc5kck",
      "body": "Scar tissue doesn't heal, brother. But we grow with our scars, and scars fade. Don't treat the wounded as if they can magically heal. Understand that our mentality is only half the game",
      "created_utc": 1744767352.0,
      "score": 3
    },
    {
      "id": "mn9qezi",
      "body": "Sky daddy isn’t real",
      "created_utc": 1744739330.0,
      "score": 12
    },
    {
      "id": "mnae6q1",
      "body": "Dogs are compassionate, people call them man's best friend for a reason",
      "created_utc": 1744746491.0,
      "score": 15
    },
    {
      "id": "mnpcxbn",
      "body": "I definitely didn’t, but I imagine it would be a lot more confusing in the case of those that did. Met plenty of guys that were quite brazen about having been assaulted by an older woman, but either because they might’ve liked it, or because of societal pressure or manipulation from the woman themselves, seem to really believe they were “lucky” or “lost their virginity young” like it was a good thing. I wonder if those guys are better off in ignorant bliss, but ultimately the women go unpunished. \n\nThe ways women predate on victims can be different and more “ambiguous” or excusable by society than when a man does it, but predation is predation. It’s sexist to act like women aren’t capable of being monsters and like men can’t be victims to it. Homophobic too tbh, not only treating male victims like they are lesser men, but it’s often assumed by society female predators are primarily lesbians… a straight woman couldn’t possibly harm a man or a little boy, they don’t even consider bisexual women... Statistically most female predators and pedophiles are primarily straight. Female on male sex crimes. Heterosexuals are the majority of the human population. This reflects in criminal and paraphilic statistics. Male on male sex crimes are highlighted and sensationalized by society, while female predators are mythologized or forgiven. \n\nI’m sorry to you all. The stuff I experienced from women was very minor in comparison, it changed nothing for me, so I’m so sorry to hear those women betrayed you.",
      "created_utc": 1744947800.0,
      "score": 2
    },
    {
      "id": "mnphqmm",
      "body": "I have been mentally harassed by some girls at a young age in my teens and now twenties as well. The craving of a girl to be a victim at all times is next level insane, even when they themselves are the predator. I have seen them instantly changing their behaviour in the environment right for them. Since I have been used and manipulated again and again I have lost my trust but still I refuse to act like a victim all the time like them. I cannot tell you the confusion I get at times by hot and cold behaviours, almost changing identities. Thank You for understanding. I will still try to be positive as much as I can towards everybody, I hope I can understand that kind of behavior to avoid it and be Happy.",
      "created_utc": 1744950047.0,
      "score": 1
    }
  ]
}