{
  "id": "1en9niy",
  "title": "Penis was destroyed by a doctor exam. I don't know how much more I can take",
  "selftext": "I've been living in a nightmare for 4 months and I just want it to end so badly.  4 months ago my life was destroyed by what I thought would be a simple urologist check up.  It was definitely not that.  He \"examined\" my penis extremely roughly and stretched it very hard and crushed it.  Ever since my penis has been completely numb with total erectile dysfunction.  I suffer every moment of the day feeling a numb pressure uncomfortableness in my penis that makes it impossible to sleep and relax.  It drives me so crazy I sometimes I sometimes just want to cut it off for relief which is something I would never want.  I'm only 33 years old and I will never be able to feel or use my penis again.  The doctor damaged my bulbocavernosous muscle/nerve in my penis which is responsible for erections and ejaculations.  This muscle is extremely numb and lifeless now like the rest of my penis.\n\nNobody cares or believes me when I tell them what happened.  Doctors or lawyers.  I've been to several doctors and they don't know what to do.  They just gaslight me and say it might be psychological when it definitely is not.  I literally can't feel my penis at all anymore.  Not hot, cold, touch, pain, pressure, nothing.  It's completely numb.  My scrotum and penis are very cold to the touch 24/7.  I stay on high dose Cialis to see if it helps and it does nothing at all.  My penis stays numb and jelly like always.\n\nI've reported the uro to the hospital and medical board snd nothing happened.  People tell me things like I need to be strong and get over it.  Or your penis isn't everything.  It's so easy for someone else to say that.  They don't know how miserable it is.  I have no desire getting gaslit by more doctors, lawyers, or anyone else at this point.",
  "created_utc": 1723132652.0,
  "score": 2199,
  "num_comments": 307,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1en9niy/penis_was_destroyed_by_a_doctor_exam_i_dont_know/",
  "comments": [
    {
      "id": "lh4r5el",
      "body": "i think you should ask for an EMG / nerve conduction study / penile doppler ultrasound to assess damage",
      "created_utc": 1723135038.0,
      "score": 1834
    },
    {
      "id": "lh4otvf",
      "body": "I remember seeing you post about this somewhere else. It's honestly ridiculous that this happened. What are lawyers telling you? ",
      "created_utc": 1723134322.0,
      "score": 1201
    },
    {
      "id": "lh4ptcv",
      "body": "If it helps, I believe you and don’t want you to stop fighting for your rights.  Do you think the doctor did this to you on purpose?",
      "created_utc": 1723134620.0,
      "score": 422
    },
    {
      "id": "lh4nkzj",
      "body": "Bro no you need to stay alive and bring this asshole to court",
      "created_utc": 1723133944.0,
      "score": 268
    },
    {
      "id": "lh5zafa",
      "body": "I know this probably won't make you feel better, but you're not alone. \n\nI had a nurse basically rip a catheter out of me. She deflated the balloon at least, but then grabbed the cord, turned around and just walked away with it, ripping it out. \n\nThere was blood and piss everywhere. I have ED now and when I pee it sprays everywhere. \n\nI called several lawyers and none of them were interested, like in your case they said it would be too hard to prove.",
      "created_utc": 1723148383.0,
      "score": 68
    },
    {
      "id": "lh4xw4b",
      "body": "Honestly you being able to bare with this situation for 4 months straight is admirable on it's own, I don't care what others say, it's easier when you observe someone having a problem that isn't visible to the naked eye since you can just say its psychological, but when you actually have to deal with it, you feel so fucking helpless",
      "created_utc": 1723137087.0,
      "score": 41
    },
    {
      "id": "lh4siqf",
      "body": "\"your penis isn't everything\" is fucking bullshit, our sexuality is a core part of what makes us humans in the first place and it should be viewed as important and you have all the rights to be mad about this. You could look into r/anhedonia as a way to cope / better understand your situation",
      "created_utc": 1723135454.0,
      "score": 149
    },
    {
      "id": "lh52ba0",
      "body": "I remember seeing your post before and I feel so damn sorry and sad for you. Especially since you told me you recovered from doctors before giving you PSSD. And people not believing you, just like they don't believe me when I tell them about my pssd, doctors basically chemically castrating me with antidepressants. Just know I believe you and this fucking sucks.",
      "created_utc": 1723138423.0,
      "score": 37
    },
    {
      "id": "lh560v0",
      "body": "Ignorant people who never experienced anything tragic health wise always say “just be strong and get over it” and yeah that shit really pisses me off. Because they got no right to talk like that when the worst thing they’ve experienced health wise was the flu for a week. I got a chronic condition in both eyes that is slowly deteriorating my vision (right eye stable for now), and I gotta get eye injections every 6-7 weeks to keep it stable. But damn man idk what sounds worse my thing or your thing. Fucking life.",
      "created_utc": 1723139541.0,
      "score": 36
    },
    {
      "id": "lh4obvy",
      "body": "Get a good lawyer and explore prostate play is the best I know to tell you",
      "created_utc": 1723134170.0,
      "score": 95
    },
    {
      "id": "lh4nxlh",
      "body": "I would sue him out of his house",
      "created_utc": 1723134050.0,
      "score": 100
    },
    {
      "id": "lh4n469",
      "body": "fellow dude here - i can see how this would be completely soul crushing.  my sympathies man.\n\nMight be a stupid idea as im not a doctor but would taking Viagra do something ??",
      "created_utc": 1723133801.0,
      "score": 63
    },
    {
      "id": "lh6hhva",
      "body": "I think you should post this to r/askdocs\n\nThey will have more information on the legal and medical side than any of us will have",
      "created_utc": 1723154037.0,
      "score": 11
    },
    {
      "id": "lh53msi",
      "body": "Continue pursuing legal action. Make that doctors life a living hell",
      "created_utc": 1723138824.0,
      "score": 10
    },
    {
      "id": "lh6nrub",
      "body": "Go to Pelvic Rehabilitation Medicine in the US, they have locations in different states. I had my penis crushed as well and I made a full recovery. I had numbness in my pudendal nerve for 5 years and urinary retention. Many doctors didn’t know how to help me until I finally found them. They can give you nerve blocks and trigger point injections, among other treatments.",
      "created_utc": 1723156197.0,
      "score": 9
    },
    {
      "id": "lh4tofi",
      "body": "Dude I would reach out to every lawyer till some in takes your case. Thats crazy. Something will come of it don’t give up!",
      "created_utc": 1723135809.0,
      "score": 9
    },
    {
      "id": "lh5f71k",
      "body": "I remember you. You've posted before and I thought you were going through hell. I'm so sorry. I think the others are right. Report that doc up the chain and sue him blind. Make him suffer for what he did to you. Revenge is a powerful motivator. I just escaped an insanely abusive relationship so now I'm going to try to do everything I can to bury my ex in prison. I was actively suicidal for months on end and now I finally have hope again. See if you can get a shark malpractice lawyer and eat that doctor ALIVE. They deserve it. Good luck to you my friend. I hope you can begin healing as I have.",
      "created_utc": 1723142321.0,
      "score": 8
    },
    {
      "id": "lh4qgj3",
      "body": "Lawsuit. Plus, WTF",
      "created_utc": 1723134825.0,
      "score": 13
    },
    {
      "id": "lh4sqry",
      "body": "Don’t give up dude. Go to a good neurologist and insist they do all the possible tests. Reddit believes in you.",
      "created_utc": 1723135522.0,
      "score": 6
    },
    {
      "id": "lh67kwk",
      "body": "This post is a nightmare fuel. Good luck and stay strong friend",
      "created_utc": 1723150847.0,
      "score": 6
    },
    {
      "id": "lh54fkr",
      "body": "[removed]",
      "created_utc": 1723139065.0,
      "score": 15
    },
    {
      "id": "lh4v7l9",
      "body": "As an intersex person who can’t feel my external genitalia asides from pain due to intersex genital mutilation i have some tips \n\n1 for getting hard i use a pump, be warned erections will often be painful in my experience\n2 try vibrators they make me orgasm but i can’t feel it i use it in combo with no 3 to actually feel something \n3 stimulate internally if you’re open to it oftentimes damage will leave some feeling inside\n\nFor the lawsuit i can’t really give advice other than look for more medical malpractice lawyers",
      "created_utc": 1723136272.0,
      "score": 10
    },
    {
      "id": "lh4y46b",
      "body": "That's rough man. 🫂",
      "created_utc": 1723137155.0,
      "score": 5
    },
    {
      "id": "lh662kw",
      "body": "sue the fuck out of the hospital and everyone possible don't give up please",
      "created_utc": 1723150397.0,
      "score": 5
    },
    {
      "id": "lh4uxbv",
      "body": "I am so sorry to hear this. I couldn’t imagine the distress you must be going through. \n\nPlease try and find a different lawyer. Someone out there will help you.",
      "created_utc": 1723136187.0,
      "score": 5
    },
    {
      "id": "lh56vxv",
      "body": "I’m trying to envision this and I can’t, what the heck did he do in this exam? I think back to all the terrible handjobs I’ve gotten, and other abuse my pal has taken, it sounds astounding, which is maybe a part of your problem, many people you talk to may be remembering their own past incidents and thinking “well mine is still fine”.",
      "created_utc": 1723139800.0,
      "score": 3
    },
    {
      "id": "lh6be39",
      "body": "Hey dude, I’m really sorry this happened to you. I believe you. It’s a frightening and horrifying experience to go through medical malpractice, especially down there. Clearly you are being failed by the people that are supposed to help and protect you. I agree with u/ anonyclover who said: “i think you should ask for an EMG / nerve conduction study / penile doppler ultrasound to assess damage” \n\nI’m not a doctor and I don’t know the full story, so please take this with a grain of salt: Muscle/nerve damage can be temporary. I’ve had two surgeries, multiple joint dislocations, muscle injuries, head injuries, and been sexually assaulted myself. My nerves didn’t come back all the way normal, but enough to the point where I have feeling again. If you’ve been trying to test whether your penis is numb or not, you may have been not letting the muscle rest. Let the muscle rest, and to prevent swelling, I’d recommend ice packing it 20 minutes on 20 minutes off if you can. Feeling might come back. \n\nYou went through something horrific. It’s common for sexual assault survivors to need support. I’d highly recommend working with a therapist trained in counseling male sexual assault survivors. \n  \nhttps://www.inclusivetherapists.com is a search engine that can help you find one that takes your insurance. (Sliding scale options are also available.)",
      "created_utc": 1723152042.0,
      "score": 5
    },
    {
      "id": "lh8pciq",
      "body": "What if you go to a new Dr and pretend that this injury is from your partner, instead of a Dr. Ask for the tests suggested. If they refuse, make them note that you have specifically asked for these test to be done and they are denying your requests. I have heard that sometimes this will help you towards getting the tests that you want because you are making them document that you are requesting it.\n\nI hope you can get this figured out, I (32F) understand the frustration of sexual disfunction that Dr's think is in your head. I have been struggling with this for over 4 years. My heart goes out to you.",
      "created_utc": 1723188903.0,
      "score": 4
    },
    {
      "id": "lhalne3",
      "body": "Just as an addition, I’d recommend a penile angiogram just to check the vasculature and see if there’s any trauma",
      "created_utc": 1723219272.0,
      "score": 4
    },
    {
      "id": "lhbc4wa",
      "body": "Wydm he stretched it and crushed it? I’m just trying to understand",
      "created_utc": 1723227480.0,
      "score": 4
    },
    {
      "id": "lhdwpy2",
      "body": "Shit, that post hit hard, now I will be careful with dick inspections.",
      "created_utc": 1723261180.0,
      "score": 4
    },
    {
      "id": "lh4lyzw",
      "body": "This is terrible bro i cant imagine how that would be like and im not going to that seems disrespectful to what ur going thru\nIk this us some meaningless words when i or someone else tells u ur penis isnt everything but its up to u to whether or not u choose that to define ur life right\nW that being said its still a significant role in ur mental physical and psychological help\nIf u dont mind me asking have u ever considered a therapist who may be someone who will believe u? At the very least that might help u against all those against u? And for the ED porn or otherwise and masturbation have nothing? \nWith no expectation of reply i hope you survive this and live a life defined by your achievements that will help u sleep better at night\nGood luck to you",
      "created_utc": 1723133451.0,
      "score": 11
    },
    {
      "id": "lh5di2e",
      "body": "Darling, I'm very sorry you have to go through this 🫂 please don't give up. Injured nerves can heal at least partially. It'll take time and effort, but it's worth trying. Don't experiment with Cialis, in your situation it'll do more harm than good. You might need to get a prescription for gabapentin or pregabalin or similar meds to help with pain and discomfort. If possible, I'd recommend you to see a doctor privately and ask for imaging tests (X-ray, CT, MRI , whatever your doctor recommends) to evaluate injuries. Also get a physiotherapy assessment appointment, in some cases pelvic floor physio can help. Stay strong 🫂 I really hope you'll find a good specialist and get help",
      "created_utc": 1723141805.0,
      "score": 7
    },
    {
      "id": "lh4uw9k",
      "body": "It's so difficult to do, but you have to advocate for yourself as a patient. We hear your voice, keep speaking up! Keep speaking to doctors confidently about your symptoms and request answers, diagnostics, next steps, do not let them send you out of the office without something. If they don't give you answers, tell them you want a referral to someone better. Look for university hospitals/research hospitals with specialties in urology and men's health. It may not hurt to also at least entertain an evaluation with a therapist to rule it out to have in your arsenal in the event that the psychological angle is posed to you again. If for nothing else, a therapist can help you deal with the trauma of what you are experiencing physically. There are doctors out there who will fight for their patients and look for answers, and it just takes finding one who has seen a similar case or heard from a friend of a friend and it can ignite a chain of events that could work in your favor. Please don't give up!",
      "created_utc": 1723136178.0,
      "score": 3
    },
    {
      "id": "lh52fj6",
      "body": "More power to you OP. No one can understand what you are going through. I hope you get through this difficult time. Sue the people who\nDid this to you.",
      "created_utc": 1723138459.0,
      "score": 3
    },
    {
      "id": "lh54uvj",
      "body": "Praying his penis is crushed in a comical accident at work and yours recovers. Sorry this happened to you.",
      "created_utc": 1723139192.0,
      "score": 3
    },
    {
      "id": "lh5a5ui",
      "body": "It really does sound like carelessness at best and sexual assault at worst. I’m sorry that the legal and medical communities have been useless. \nIdk it it helps but it might not be permanent. \nWould you have the ability to give it one last “fuck it all” sell all your shit and immigrate to somewhere in Europe? Get a low paying job there (most European countries minimum wage is enough to survive on) You could wait the necessary amount of time to be considered a resident (or not necessary in some places) and get medical care there. Plus I hear not living in the states is amazing for American’s mental health in general. \nI would have suggested pouring your attention into finding a urologist who is willing to actually be helpful but American healthcare is shit when it comes to cost.",
      "created_utc": 1723140798.0,
      "score": 3
    },
    {
      "id": "lh60qby",
      "body": "I know you mentioned you’ve been seen at the Cleveland clinic but did you reach out to Mayo?",
      "created_utc": 1723148800.0,
      "score": 3
    },
    {
      "id": "lh63pb4",
      "body": "are you sure circumcision lawyers won’t take you on? also did you try lawyers that work by themselves, and not just called large firms. I don’t know but I think they might take you on",
      "created_utc": 1723149691.0,
      "score": 3
    },
    {
      "id": "lh6uuv6",
      "body": "Me personally? I’d be going to the local news station.",
      "created_utc": 1723158713.0,
      "score": 3
    },
    {
      "id": "lh72yvq",
      "body": "My sincerest well wishes for this nightmare. I just wanted to tell you that I have read similar things happening to men whose penis was twisted or taxed the wrong way during sex, by their partner, or due to sustained, intense, rigorous masturbation.\n\n They mentioned a lot of if what you said: numbness, weirdness/tingling, flying half mast or only flaccid. One had mentioned their urethral opening withing the sleeve of foreskin becoming completed inverted. Many were as equally distressed by the reality that for some it was only a portion of their penis affected, like lateral sensation or underneath only or something to that affect. \n\nI read them a few years ago right here on Reddit and they were giving each other insight and advice. It was a long battle (months to years) of trial and error- I don't mention that to dash your hopes, but to revive them as many times we think the longer we've had a health issue is the less likely we are to be able to reverse them. \n\nCry your tears- but with your chin up. This is beyond stressful and devastating, and the cherry on top is having to  knock these crackpot coconuts together to get anywhere while they try to just palm you off on someone else cuz nobody wants to work. Their gaslighting is terrible - stick around long enough to make the lawyers kick themselves for passing up such a golden case and easy money - and to get dat mowfukka for malpractice!",
      "created_utc": 1723161662.0,
      "score": 3
    },
    {
      "id": "lh75fbb",
      "body": "My advice if someone isn’t taking you seriously is to prove them wrong, go to a psychiatrist/psychologist and explain your situation and ask for help like a note proving it’s not related to your mental health, the psychiatrist could also help you figure out how to approach it and how to talk to doctors or how to accept it",
      "created_utc": 1723162594.0,
      "score": 3
    },
    {
      "id": "lh7ts4t",
      "body": "Wow this is very sad. I'm so sorry this happened to you and that you have to hear these crazy responses to a very serious problem. If you want to reach out I'm here. Also very ill and want to take my life because of illness",
      "created_utc": 1723172066.0,
      "score": 3
    },
    {
      "id": "lh8degs",
      "body": "Well IMO this doctor needs to pay to fix it. If it were me, you’d see this guys name in the news. Anyone can guess why that would be 😅",
      "created_utc": 1723181581.0,
      "score": 3
    },
    {
      "id": "lh93k3j",
      "body": "[removed]",
      "created_utc": 1723198189.0,
      "score": 3
    },
    {
      "id": "lha385p",
      "body": "Do you have issues emptying your bladder after urination?",
      "created_utc": 1723213467.0,
      "score": 3
    },
    {
      "id": "lomhlkb",
      "body": "I hate people",
      "created_utc": 1727141866.0,
      "score": 3
    },
    {
      "id": "lhbiizt",
      "body": "That doctor pulled off what you could call a dick move.\n\n^I'm ^so ^sorry, ^man",
      "created_utc": 1723229486.0,
      "score": 6
    },
    {
      "id": "lh4wegu",
      "body": "You need better lawyers, you have a bag of money waiting for you",
      "created_utc": 1723136633.0,
      "score": 2
    },
    {
      "id": "lh4wlp5",
      "body": "I’d argue you’re young enough to see if this isn’t fixable, at the very least. I echo what others have said on getting a lawyer who WILL take the case (because yes, it’s medical malpractice) and finding a specialist to run some tests and see if they can help. \n\nI remember your post from somewhere else a while ago too. Don’t give it up yet, OP. There are options.",
      "created_utc": 1723136693.0,
      "score": 2
    },
    {
      "id": "lh4y488",
      "body": "We are at your side, bro. Look for the exam a fellow redditor just commented. Its a difficult case, but with enough proof, you can get a good lawyer!",
      "created_utc": 1723137156.0,
      "score": 2
    },
    {
      "id": "lh5chz8",
      "body": "Have you reported the dr to the medical hard or hospital they are affiliated with? Patient advocate may be able to help you navigating getting a case review and the dr sanctioned.",
      "created_utc": 1723141504.0,
      "score": 2
    },
    {
      "id": "lh5d8k6",
      "body": "[removed]",
      "created_utc": 1723141726.0,
      "score": 2
    },
    {
      "id": "lh5euvo",
      "body": "What kind of doctors have u seen? What did u tell them? Also with surgery (if this ever has no treatment) u can get erect again, but first u gotta see a doctor that will help u. It is so strange that no one is helping u.",
      "created_utc": 1723142218.0,
      "score": 2
    },
    {
      "id": "lh5gbln",
      "body": "I know the feeling of losing the ability of something you take for granted. I can’t hardly walk anymore and have been waiting for my derm appointment for 4 months now (i got ppp last year and it’s been hell) i barely have any skin left on my feet, but i still have to get up and walk every single day. It has started to affect my hands as well. I want to end it some days as well because sometimes is gets a little better, then bam, it gets much worse all over again and it’s life long. \n\nI’m sorry to hear about your situation, even if i don’t have a penis, i can still relate to the loss of a function i once took for granted. People generally suck and don’t care about other human beings anymore. I just feel your pain and why you have thoughts of ending it.",
      "created_utc": 1723142660.0,
      "score": 2
    },
    {
      "id": "lh5vtl8",
      "body": "First, let me say that I am very sorry for your situation. Medical errors are terrible, especially when they cause damage to a patient's body.\n\nI just want to say that before you take such final, critical measures as suicide, try to assess the exact damage and condition of your penis before doing so. If at all possible, it's worth seeing a neurologist and possibly a neurosurgeon (especially if they're proficient in peripheral nervous system surgery). \n\nThere is a possibility that the damage is not permanent. There is a chance that the muscle and nerve damage can be repaired. Nerves take a very long and slow time to recover, more than a year. I wish you strength and patience, your case is truly horrific and a blatant medical error.",
      "created_utc": 1723147334.0,
      "score": 2
    },
    {
      "id": "lh6gekp",
      "body": "I believe you man. I'm really hoping all this ends well for you. Don't give up man, please!",
      "created_utc": 1723153679.0,
      "score": 2
    },
    {
      "id": "lh6ger7",
      "body": "They re-attached Lorena Bobett's husband's penis after she cut it off, and it still worked after that.\n\nI know this is a long shot, but maybe you can try to ask for a new penis through the organ donation system.",
      "created_utc": 1723153681.0,
      "score": 2
    },
    {
      "id": "lh6p34l",
      "body": "You need to go to another doctor to verify these injuries then take that data to a lawyer",
      "created_utc": 1723156671.0,
      "score": 2
    },
    {
      "id": "lh6s9of",
      "body": "Please don't give up. You deserve justice. There must be a doctor that can find what yhe damage is exactly. When someone has erecile disfunction, Im sure there are plenty of tests to be done. With some evidence a lawyer will be willing to take the case.",
      "created_utc": 1723157794.0,
      "score": 2
    },
    {
      "id": "lh6svs1",
      "body": "You should post this on the Ask Doc Sub & Legal Subs as they can probably better advise you.",
      "created_utc": 1723158010.0,
      "score": 2
    },
    {
      "id": "lh6vo7g",
      "body": "Where in the world are you?",
      "created_utc": 1723159002.0,
      "score": 2
    },
    {
      "id": "lh79vsi",
      "body": "I believe you. My life and bodily peace was also completely derailed by a doctor. Some doctors have no clue just how much suffering they leave in their wake.",
      "created_utc": 1723164292.0,
      "score": 2
    },
    {
      "id": "lh7ny03",
      "body": "I cannot even begin to imagine your pain🥺 I am so sorry this happened to you, that doctor deserves to be in jail and much worse!!",
      "created_utc": 1723169688.0,
      "score": 2
    },
    {
      "id": "lh7t1x4",
      "body": "The only attorney I know of in WV is Debra Bowers.   From what I know of her, she never loses. Good luck.",
      "created_utc": 1723171755.0,
      "score": 2
    },
    {
      "id": "lh830dx",
      "body": "I know this doesn’t fix your problem, but at the very least can you still pee?",
      "created_utc": 1723176162.0,
      "score": 2
    },
    {
      "id": "lh9hfh0",
      "body": "Please I beg , don’t give up . I would mainly focus on fixing this over suing . There has to be something that can be done. \n\nAs for your personal life, are you able to orgasm ? I can’t imagine the pain from build up ? I just want to say if stuck maybe you could try having prostate orgasms for release . And as for women , maybe you could get really good at oral and toys and fingers but I know this is the least of your worries . I am stunned by this story , I’m\nSo sorry 🙏❤️",
      "created_utc": 1723205338.0,
      "score": 2
    },
    {
      "id": "lh9i2l9",
      "body": "[deleted]",
      "created_utc": 1723205620.0,
      "score": 2
    },
    {
      "id": "lh9vckw",
      "body": "I just wanted you to know I can understand the frustration and betrayal of no one helping you through this.\n\nI was a patient at the hospital a few years ago under sedating medication when another patient sexually assaulted me in my room. My doctor discharged me for inappropriate behaviour yet the other patient had no repercussions. A lot of laws, and basic ethics were broken by the doctor and a few nurses on how they treated me during that. Everyone I have spoken to has told me to sue and yet how can I when it’s a he said she said and said doctor has more money and reputation than I ever could.\n\nIt’s hell knowing how flawed the system can be, it’s heartbreaking and alienating. I’m here for you.",
      "created_utc": 1723210782.0,
      "score": 2
    },
    {
      "id": "lhno0al",
      "body": "If nobody can help you. Get revenge. Fuck it",
      "created_utc": 1723414918.0,
      "score": 2
    },
    {
      "id": "lofjnpu",
      "body": "I really can't imagine getting any satisfaction in that situation other than revenge.",
      "created_utc": 1727041533.0,
      "score": 2
    },
    {
      "id": "lp5a78u",
      "body": "Bro kill that fucker",
      "created_utc": 1727417967.0,
      "score": 2
    },
    {
      "id": "lpmfxc9",
      "body": "Kill the doctor",
      "created_utc": 1727686386.0,
      "score": 2
    },
    {
      "id": "lh4o4r0",
      "body": "as a last resort i would suggest taking viagra to see if it does anything - by the way you're describing it it seems the whole thing is already dead though... go to the hospital and check if it actually is dead, maybe they can do something about it? if you were to get proof from a hospital that the tissues in it are dead then you'll have the necessary paperwork to sue the guy.",
      "created_utc": 1723134111.0,
      "score": 2
    },
    {
      "id": "lh52d0f",
      "body": "Did you try the r/askdocs subreddit? If there's a possibility someone can help you that sub will help, they are awesome in finding a specialist",
      "created_utc": 1723138438.0,
      "score": 3
    },
    {
      "id": "lh53hm2",
      "body": "Can you post on /r/legaladvice ? People might be able to help you. Please post where you live as well.",
      "created_utc": 1723138780.0,
      "score": 3
    },
    {
      "id": "lh4uvzp",
      "body": "I remember seeing your post before, I'm here not to talk about how you can sue the doctor, but did you consider an implant?!",
      "created_utc": 1723136176.0,
      "score": 2
    },
    {
      "id": "lh6tu3r",
      "body": "Wtf ! Whay u nees is real proof. Once u have proof then they will take u seriously. Especially the lawyers. Try lawyers in medical damages field or something likw that",
      "created_utc": 1723158348.0,
      "score": 1
    },
    {
      "id": "lh6umx5",
      "body": "I’m so sorry this is happening to you. Hopefully you can find a lawyer willing to help you, because this sounds like a case of medical malpractice. Best of luck.",
      "created_utc": 1723158633.0,
      "score": 1
    },
    {
      "id": "lh6wpdy",
      "body": "Not giving any advice or solution, and it has probably been asked before, but what happends if you take viagra or kamagra? Also really sorry for your situation, you don’t need to be not believed when this is a real issue",
      "created_utc": 1723159368.0,
      "score": 1
    },
    {
      "id": "lh6xyoa",
      "body": "I don't even know what to tell you and I don't have a solution for you but your story touched my heart. Your pain is valid and understandable and that doctor should be punished severely. I'll keep you in my prayers.",
      "created_utc": 1723159819.0,
      "score": 1
    },
    {
      "id": "lh722b9",
      "body": "I would suggest rather than die fight hard against all of this. Find someone who will fight with you, I'm sure someone somewhere will take your case. Or if you really had to fight the case yourself. Secondly find a better doctor who can actually help you and see what possibility there is for restoring feeling and function. If you're down bad eno8gh to want to end it, then you have nothing to lose. I'd use that pain as righteous anger. At the very least maybe you can get the word out about the doctor and hopefully stop anyone else from ever having to suffer the same fate. I truly hope you fight hard and find some relief. That a rough dealt hand I hope you can make the most if it.",
      "created_utc": 1723161322.0,
      "score": 1
    },
    {
      "id": "lh77a1v",
      "body": "Swear I’ve seen this post before. Anyways I’m sorry, OP. That’s awful.",
      "created_utc": 1723163303.0,
      "score": 1
    },
    {
      "id": "lh79w9t",
      "body": "That’s how I felt my first week getting circumcised man, that sucks. Life gets better though, trust!",
      "created_utc": 1723164297.0,
      "score": 1
    },
    {
      "id": "lh7cbt8",
      "body": "I’m so sorry this happened to you. Especially with a doctor who you were trusting to look out for your health. Please don’t die. I had nerve pain before and got a nerve conduction study done. This might be able to help you. I would not give up. I’m sure another doctor will be willing to treat you so you can have better quality of life. Also maybe consider seeing a therapist so you can have someone to talk about this. ❤️",
      "created_utc": 1723165211.0,
      "score": 1
    },
    {
      "id": "lh7fpl4",
      "body": "that is frightening. sorry you have to go through that. there was a famous case in the 90s where a woman chopped off her husband's penis and toss it on the side of the road. they were able to find it and reattach it and it became fully functional again. maybe there's still hope that it'll heal on it's own gradually. maybe u can try not thinking about it for a while",
      "created_utc": 1723166506.0,
      "score": 1
    },
    {
      "id": "lh7ibsz",
      "body": "I'm so so sorry this is so fucked up",
      "created_utc": 1723167518.0,
      "score": 1
    },
    {
      "id": "lh7ijgg",
      "body": "Legal Eagle, dude",
      "created_utc": 1723167599.0,
      "score": 1
    },
    {
      "id": "lh7xf7j",
      "body": "Are you seeing a Pelvic floor PT? They can access for dysfunction, but also give more specific exercises. But they can also do sensation testing and provide medical data verifying what you’re noticing. \n\nIt may be worth looking for a urologist or providers who specialize in transgender treatments since they would likely be more on the side of the patients and advocate for them since that type of treatment takes specialization ",
      "created_utc": 1723173622.0,
      "score": 1
    },
    {
      "id": "lh875ym",
      "body": "Same goes for PSSD sufferers",
      "created_utc": 1723178211.0,
      "score": 1
    },
    {
      "id": "lh90eso",
      "body": "Brother! I am extremely sad for you. It disgust me that someone can do this without understanding the consequences. If i was in your situation I'd cry endlessly. But in the end STAY STRONG.",
      "created_utc": 1723196203.0,
      "score": 1
    },
    {
      "id": "lh9fbjk",
      "body": "[removed]",
      "created_utc": 1723204404.0,
      "score": 1
    },
    {
      "id": "lhb04ky",
      "body": "This is horrible, I’m sorry. It might be worth looking into if there are reconstruction surgeries that might help - if you sued the hospital they might be obliged to cover it too",
      "created_utc": 1723223760.0,
      "score": 1
    },
    {
      "id": "lhcgzqv",
      "body": "Why the fuck would a doctor do that",
      "created_utc": 1723240754.0,
      "score": 1
    },
    {
      "id": "lhdicvi",
      "body": "Sue the doc that did that to you, your life ain't over. The dingus is a powerful and resilient machine, you will awaken it with training.",
      "created_utc": 1723254971.0,
      "score": 1
    },
    {
      "id": "lhimpdd",
      "body": "[removed]",
      "created_utc": 1723335543.0,
      "score": 1
    },
    {
      "id": "lhrga6p",
      "body": "If the doctor caused a venous leak, I want you to know that those can be fixed through embolization. Not cheap but still possible.",
      "created_utc": 1723478123.0,
      "score": 1
    },
    {
      "id": "lhtbrsj",
      "body": "[deleted]",
      "created_utc": 1723499302.0,
      "score": 1
    },
    {
      "id": "li7k22p",
      "body": "I’m sorry this happened to you OP :( \n\nYou’re not alone. My jaw was dislocated via intubation during surgery. And it has never gone back in place right. I’m in pain daily. I can’t open my mouth all the way, my jaw clicks all the time, it is painful to eat and talk, have debilitating headaches, tinnitus, etc. It’s hard and painful to get intimate with my husband. And it hurts to kiss him :( \n\nI tried going to doctors and dentists, and they don’t believe me. I tried getting lawyers, and they don’t want to take my case. One lawyer finally is trying to help me, but is telling me no doctor specialists are backing up the case because they never heard of what I went through happening. \n\nIt sucks ass :/ \n\nI hope someone takes toy seriously! You deserve to get help ",
      "created_utc": 1723710819.0,
      "score": 1
    },
    {
      "id": "lin5ef7",
      "body": "Start taking electric shock treatment and Cialis on the side. That will improve the circulation in your corpora cavernosa blood vessels which give you your erections. And, did you try having sex with a hottie?",
      "created_utc": 1723939503.0,
      "score": 1
    },
    {
      "id": "lk3c3kj",
      "body": "You need to get a group off ALL the people who experienced this in the U.S. and file a class action lawsuit against the U.S. Department of Health and Human Services. If multiple people all experience this on the regular as a typical urology practice and are injured then you have a case.\n\nBest case scenario is find a lawyer who experienced this or something similar, because then it’s personal.",
      "created_utc": 1724714549.0,
      "score": 1
    },
    {
      "id": "lkv6jky",
      "body": "Check about TMS and Dr. Sarno or Schubiner's books. Chances exist that if they don't see anything abnormal but you still feel numbness and pain, this could be a pain rather triggered from your brain than from an actual wound. There are lots of cases like this, although not broadly published as it's not the easiest to treat by doctors (who are not well prepared for situations like these).",
      "created_utc": 1725127211.0,
      "score": 1
    },
    {
      "id": "lh5fegb",
      "body": "I would suggest getting a second opinion from a good hospital or a recommended urologist. It is very unlikely to damage the penis during the examination. I’ve heard of tetraplegic patients that can actually have an erections because of hormonal mechanisms.\nA good doctor will be able to recommend you a proper approach to your case, either it is surgical, or with stimuli devices, there’s plenty of hope in that. \nKeep in mind that depression lowers the libido and makes an erection even harder.\nI would suggest getting help from a psychiatrist and a urologist, if possible.\nStay safe",
      "created_utc": 1723142385.0,
      "score": 1
    },
    {
      "id": "lh5cz2h",
      "body": "Maybe try r/medical_advice, r/askdocs, and r/legaladvice",
      "created_utc": 1723141648.0,
      "score": 1
    },
    {
      "id": "lh5hanm",
      "body": "Dude, first solution I can think of is go to Austin Texas and sign up for kill Tony. One way or another man, what’s done is done. I’m grateful that you’re still with us.",
      "created_utc": 1723142949.0,
      "score": 1
    },
    {
      "id": "lh5l6d7",
      "body": "I’m a woman and cannot imagine how I’d feel if I no longer had sexual function. I’m so sorry this has happened to you. Like others have said, it is too soon to know if permanent. If you happen to find a doctor that will not gaslight you, they can give you steroid injections that might help wake up that nerve. Also, nerves do heal on their own. I have faith that this is a temporary suffering. Please don’t end your life over it.",
      "created_utc": 1723144127.0,
      "score": 1
    },
    {
      "id": "lh61xg1",
      "body": "I don’t believe you can damage a penis that way.",
      "created_utc": 1723149160.0,
      "score": -2
    },
    {
      "id": "lh8xjhx",
      "body": "I understand you believe it’s impossible that the impact could be a psychological one and by no means am I suggesting it IS a psychological issue and you should definitely extend all physical examinations but do not underestimate your mind.",
      "created_utc": 1723194329.0,
      "score": -1
    },
    {
      "id": "lh8gaw4",
      "body": "It’s not that simple to sue for medical malpractice (even when it’s clear malpractice). Complaint to the hospital is even more useless. Complaining to the state board is a waste of time as well.",
      "created_utc": 1723183263.0,
      "score": -1
    },
    {
      "id": "lh8aqkd",
      "body": "[removed]",
      "created_utc": 1723180091.0,
      "score": -11
    },
    {
      "id": "lhbw17z",
      "body": "Ok no offense but this is kinda funny ",
      "created_utc": 1723233824.0,
      "score": -5
    },
    {
      "id": "lh4v1eq",
      "body": "I cannot upvote this enough. Please listen to this person.",
      "created_utc": 1723136221.0,
      "score": 345
    },
    {
      "id": "lh4yyhf",
      "body": "OP if you look at any comment please make it this one, this person listed the exact two tests to look into this issue, push for your doctors to order these if at all possible. it may take a referral to a specialist, (assuming you have an okay relationship, your avg PCP would most likely not want to do the ordering themselves, not because they don’t want to treat you but because insurance may not approve a PA from a non-specialist office) but this is your best shot at answers",
      "created_utc": 1723137411.0,
      "score": 181
    },
    {
      "id": "lh4yik6",
      "body": "THISSSSS\n\nI've seen OP before in this subreddit, I hope he gives it a try",
      "created_utc": 1723137277.0,
      "score": 95
    },
    {
      "id": "lh56dky",
      "body": "I asked a neurologist about nerve conduction study and he said they can't do it on the penis nerves.",
      "created_utc": 1723139648.0,
      "score": 77
    },
    {
      "id": "lh50wrd",
      "body": "Exactly what I was thinking. Could be something neuro too",
      "created_utc": 1723138003.0,
      "score": 23
    },
    {
      "id": "lh4xw0h",
      "body": "best comment so far. With the dmg being proven, it will get easier. Even more since he didnt complain about it in his consult with a UROLOGIST",
      "created_utc": 1723137086.0,
      "score": 28
    },
    {
      "id": "lh9fryd",
      "body": "I was about to say this . Lawyer and nerve conduction test . If this is all true. Definitely have a lawsuit.",
      "created_utc": 1723204605.0,
      "score": 9
    },
    {
      "id": "lhalf2k",
      "body": "I second this, this doctor committing malpractice has no right to continuing practice. \n\nAs an attending trauma physician, if I did something that was only minor, I would report it. But to disfigure the OP in such a way is assault.\n\nI’d recommend a penile angiogram as well",
      "created_utc": 1723219201.0,
      "score": 11
    },
    {
      "id": "lhpkvwq",
      "body": "Please, I don’t mean to hijack, but can you tell me if there is a female equivalent? I had surgery on my cervix and promptly loss a ton of feeling in my vagina.\n\nEdit: I guess I should add, OP, that there are women in the same boat. I’m pretty much asexual now. And apparently, it’s extremely common for women. I think you will lead a happy life sans-working-penis. However, with the right care team it’s very likely that it can be fixed.",
      "created_utc": 1723446221.0,
      "score": 3
    },
    {
      "id": "lh4ss09",
      "body": "They don't even want to touch the case.  Which I get it.  It's such a weird one i know.  Who wants the guy that says he was hurt from a doctor exam.  I've even told them I view myself as being sexually assaulted.  And still they say it's so hard to prove.",
      "created_utc": 1723135532.0,
      "score": 869
    },
    {
      "id": "lh4ro8f",
      "body": "I genuinely don't know.  I would prefer to assume he was just careless in his roughness.  But idk.  I've tried to put myself in his shoes these past few months to understand why he was so rough.  I've learned that there have been other people on reddit report being stretched and injured by rough urologist exams.  Some urologists do these stretches to test for reflexes in the penis and test for elasticity.  I was unlucky in how severe my injury is from one.",
      "created_utc": 1723135197.0,
      "score": 196
    },
    {
      "id": "lh4qijc",
      "body": "I have tried calling many lawyers over the past few months.  They say it's too difficult of a case to prove",
      "created_utc": 1723134843.0,
      "score": 120
    },
    {
      "id": "lh79irc",
      "body": "im so sorry for you genuinely",
      "created_utc": 1723164157.0,
      "score": 18
    },
    {
      "id": "lh5qwns",
      "body": "I honestly don't know how I've made it so long.  These past four months have been a hellish blur.  Sometimes I want to tell myself this isn't actually happening and it's just a dream. I try to disassociate to cope.  But I know it's real.  Everything in my life is falling apart because of this.  I am no longer the same person.  I mean who would be?   Nobody truly understands until they are the one dealing with it.  I feel trapped and helpless and can't escape.",
      "created_utc": 1723145869.0,
      "score": 27
    },
    {
      "id": "lh53hbn",
      "body": "This. I have PSSD, from taking antidepressants my sexuality got completely erased and I can't feel anything down there literally. It feels like I am seperated from a core part of the human experience, i can never experience a real relationship or sex ever thanks to these doctors.",
      "created_utc": 1723138777.0,
      "score": 31
    },
    {
      "id": "lh6sk9e",
      "body": "Your condition sounds awful sorry to hear that.  I will say you do not want this.  Not trying to belittle your eye condition but I would gladly take that in a heart beat over a profoundly numb and broken penis.  Sex was such an important part of my identity and source of my happiness.  With that gone I no longer even feel male.  Or even human. Life is so cruel and unfair.  When people say the human body is an amazing thing I just want to tell them it's absolutely not.  It's shit and causes people so much unnecessary suffering.",
      "created_utc": 1723157897.0,
      "score": 13
    },
    {
      "id": "lh4ot8k",
      "body": "I've tried so hard.  I've lost count of how many lawyers I've called and none want a weird case like mine.  It's too difficult to prove they say.  Plus I can't even get other doctors to figure out what damage has been done.  They just say they don't know and try passing me to someone else.",
      "created_utc": 1723134316.0,
      "score": 89
    },
    {
      "id": "lh4nh3o",
      "body": "I've tried Viagra and Cialis both at maximum doses.  Neither do a thing.",
      "created_utc": 1723133912.0,
      "score": 41
    },
    {
      "id": "lh6px2j",
      "body": "I have tried a few times.  The subreddit is overwhelmed with posts and things get buried quickly.",
      "created_utc": 1723156965.0,
      "score": 9
    },
    {
      "id": "lh8punk",
      "body": "Any opinion on Tai Chi and isometric meridian work?",
      "created_utc": 1723189234.0,
      "score": 1
    },
    {
      "id": "lh5lvos",
      "body": "[removed]",
      "created_utc": 1723144342.0,
      "score": 11
    },
    {
      "id": "lh5g8bq",
      "body": "This comment makes me think that maybe OP should talk to people in the BDSM community who do genital torture/pain/crushing as a kink, as they might know more about the potential damage that can be done from someone doing it “wrong” and if there’s a way to fix it.",
      "created_utc": 1723142632.0,
      "score": 11
    },
    {
      "id": "lhakcuu",
      "body": "He stretched it too hard.  Like he was going to rip it off.  Why idk.  There's a variety of reasons uros do this but I don't know why he did.  He smashed it too hard too.  Nobody is giving hand jobs like this.  This is the type of injury guys that do penis enlargement exercises by stretching.  There's been guys that have permanently ruined their dicks with one bad stretch or jelq.  It goes numb and dead with total ED.  There's sad stories of guys never recovering for years and years.  Some have taken their life.  The penis is not indestructible and doesn't want to be strongly stretched in unnatural ways.",
      "created_utc": 1723218875.0,
      "score": 1
    },
    {
      "id": "lhdyrs9",
      "body": "I didn't expect my post to get so much attention.  In a way I'm glad that people see how fucked up my life is now and why I'm on this subreddit.  Be careful letting a doctor examine your dick.  You never known if they will do a fucked up test without your consent.",
      "created_utc": 1723262140.0,
      "score": 5
    },
    {
      "id": "lh52h0t",
      "body": "I have even been referred to prestigious hospitals.  I actually went to Cleveland clinic urology department 3 weeks ago.  And even they didn't know other than to try pelvic floor exercises.  Which I have already been doing.  For two months and they do nothing.  They said I could come back but I felt like they gaslit me too saying oh he couldn't have damaged anything.  So I'm just so discouraged from seeing doctors anymore",
      "created_utc": 1723138472.0,
      "score": 5
    },
    {
      "id": "lh5culh",
      "body": "I have lost respect in the American healthcare system.  I have never felt like such a number in my life since this happened.  Even from prestigious doctors.  Everyone just want the appointments over with so they can get to the next one.  All they care about is all the money they make.\n\nI struggle to even get out of bed or work since this happened.  I am in no shape to move to another country and work a minimum wage job.  Although before this happened I actually dreamed of doing something like that one day.  Unfortunately I have no interest in the idea any longer tho.",
      "created_utc": 1723141610.0,
      "score": 7
    },
    {
      "id": "lh61p3c",
      "body": "No I haven't.  Don't see them being much more help.",
      "created_utc": 1723149086.0,
      "score": 3
    },
    {
      "id": "lh64726",
      "body": "I actually have tried the circumcision/penis injury lawyers.  I called them but they aren't licensed for my state of WV.\n\nI have called many independent lawyers too.",
      "created_utc": 1723149834.0,
      "score": 1
    },
    {
      "id": "lh7hoob",
      "body": "“Cry your tears but with your chin up” beautifully put",
      "created_utc": 1723167269.0,
      "score": 2
    },
    {
      "id": "lha1m1v",
      "body": "I face also crippled from jaw surgeon my nose i can’t breath through nose again, so I’m not able to work my desease has no ICD Code Empty Nose Syndrome so I get no help from government only from family. I‘m 34 no one believe me so I understand you well my friend we must be strong.",
      "created_utc": 1723212927.0,
      "score": 3
    },
    {
      "id": "lh9b3kn",
      "body": "I know I'm in a fucked up situation.  I don't think I can make it much longer",
      "created_utc": 1723202410.0,
      "score": 1
    },
    {
      "id": "lha4x0a",
      "body": "Not really.  Doctors have rules out bladder emptying issues and any spinal issues with MRI.  I however have trouble starting to pee sometimes because I can't feel my urethra to open it if that makes sense.  But once I start I have no issues emptying.",
      "created_utc": 1723214020.0,
      "score": 3
    },
    {
      "id": "lh5equ8",
      "body": "Yes to both.  Reported him to the hospital and spoke to the patient advocate.  She said the vice president of the physicians would call me that day.  I waited and never received a call.  I called back the next day leaving messages to the patient advocate because she wouldn't answer my calls.  Next call I get shortly after is the urologist's office receptionist calling me saying she was calling about a complaint I had with my appointment.  I had already told her what happened when it first happened.  But I told her again.  She asked if I had been seeing other doctors about it.  I said yes.  And she wanted to know if they had found anything yet.  I knew it was the uro telling her to pump me for questions about what I've been finding out.  Basically to see if I had proof cause he's worried.  I then said in a really aggravated tone that other doctors are still figuring out what he's done to me.  After that the conversation was over and I regretted even answering the phone but I was upset and wanted to say something.  Patient advocate and hospital have basically ghosted me at this point.  They don't return my calls and are probably scared to talk to me in case I try to sue.",
      "created_utc": 1723142184.0,
      "score": 8
    },
    {
      "id": "lh5fmbb",
      "body": "Help so far is just telling me to keep trying Cialis and pelvic floor therapy.  Which I have already been doing both for months.  I don't even want to think about surgery on my penis.  Especially for something that wasn't even my fault.  I just can't bare the thought of getting my penis cut on by another doctor.  How can I trust basically gone penis in the hands of another.",
      "created_utc": 1723142449.0,
      "score": 3
    },
    {
      "id": "lh6uc0z",
      "body": "I'm struggling to hold on.  I debate every day would justice make me feel better.  It won't.  It won't bring my feeling and function.  I know everyone is trying to help and wants me to get a lawyer.  Sadly it still won't make me happy even if I win millions from a lawsuit and he goes to prison.  I'm broken.  Even if a doctor says heres the proof of damage.  There isn't anything that can be done.  I'm not coping well.",
      "created_utc": 1723158526.0,
      "score": 1
    },
    {
      "id": "lh7mi2e",
      "body": "Sorry to hear that.  I had no idea simply letting a doctor examine me was enough to maim me.  I'm in shock everyday at my life.",
      "created_utc": 1723169116.0,
      "score": 2
    },
    {
      "id": "lh9jn8d",
      "body": "I can't even orgasm anymore.  Can't ejaculate.  My dick and bulbocavernosous muscle are profoundly numb and dead.  The bulbocavernosous muscle is responsible for erections and ejaculations and that muscle I can feel is extremely numb along with the rest of my dick.  I honestly have no interest in sex anymore if I can't use my dick.  \n\nI know my story is shocking and fucked up.  I don't know what I did to deserve this.  But it's just my luck.  Here in WV we don't have the brightest doctors.  I took a risk and it was a fucking mistake going to one for something like TRT.  I don't think I'll be around much longer",
      "created_utc": 1723206289.0,
      "score": 3
    },
    {
      "id": "lh9k27n",
      "body": "It is I'm fucked.  I feel like I have a genuine reason to want to end it",
      "created_utc": 1723206461.0,
      "score": 3
    },
    {
      "id": "lha3rqb",
      "body": "Thank you and sorry that happened to you.  People don't realize that suing someone is not that simple and easy.  Especially doctors they can be untouchable it seems.  It's the irony that kills me knowing I went to a doctor to improve my health and it got destroyed instead.  I was supposed to feel safe in the presence of a doctor and I feel so betrayed.  I had no idea what he was gonna do.  I was told nothing.  I have been careful my whole life around doctors because I thought they were always too pushy with unnecessary medications.  It makes it that much harder to cope that the one time I trust one something as horrific as this happens.  I didn't deserve this.  I just want this nightmare to end.",
      "created_utc": 1723213644.0,
      "score": 2
    },
    {
      "id": "lh4q7gc",
      "body": "I've tried Viagra and nothing happens.  I even combined it with cialis and still nothing.  When I say it's dead it feels dead from the nerves being shut off to it.  It hangs lifelessly because of that.  There must still be blood flow going in and out for the tissues to still be \"alive\".",
      "created_utc": 1723134744.0,
      "score": 8
    },
    {
      "id": "lh52sss",
      "body": "I have tried several times.  That place is so over saturated with posts things get buried quick",
      "created_utc": 1723138573.0,
      "score": 3
    },
    {
      "id": "lh5mnzv",
      "body": "OP do not go to this sub. It’s super toxic.",
      "created_utc": 1723144586.0,
      "score": 3
    },
    {
      "id": "lh508l7",
      "body": "An implant still wouldn't bring back my sensation.  I'm just so numb that even if I were able to get erections I wouldn't be able to feel or enjoy them.  I just want this to be over at this point.",
      "created_utc": 1723137800.0,
      "score": 7
    },
    {
      "id": "lh78x9q",
      "body": "Thanks.  You have seen it I've posted before.  It's ruined my life.",
      "created_utc": 1723163932.0,
      "score": 1
    },
    {
      "id": "lh7ixuu",
      "body": "It is really fucked up.  I can't believe this is my life honestly.  It's like something out of a nightmare.  Can anyone really blame me for being on this subreddit?",
      "created_utc": 1723167753.0,
      "score": 5
    },
    {
      "id": "lh9as7f",
      "body": "This has me crying everyday.  I know my situation is very fucked up and I can't believe something like this has happened to me.  I can't believe something like this is even possible.  I don't know how much time I have left anymore",
      "created_utc": 1723202252.0,
      "score": 2
    },
    {
      "id": "lh9ft8p",
      "body": "They have to be licensed in WV",
      "created_utc": 1723204621.0,
      "score": 3
    },
    {
      "id": "lhckqb0",
      "body": "Apparently some urologists justify it as checking penis elasticity, reflexes, or for plaque.  They can be really rough and I got the roughest by a psychopath.  He ruined my life and I am wanting it to end.",
      "created_utc": 1723242084.0,
      "score": 1
    },
    {
      "id": "lhiu1j0",
      "body": "Hi I went in for low testosterone and to try to get HCG to keep my fertility.  My lab work showed I was low T.  I had low libido, low energy, and I happened to check a erectile dysfunction box on my sign in paper work .  But I didn't have erectile dysfunction.  I just had infrequent erections but all I could choose on my sign in paper work was low libido and erectile dysfunction.  So I checked both.  He said so you have erectile dysfunction?  I said very mild not really I think it's related to my low testosterone.  He said testosterone does nothing for erections.  Which is flat out wrong.  I just said oh well that's not what I've always learned.  We talked for a bit and then as I was about to leave he said let's go do a quick exam on my breathing.  Yes breathing.  I said ok.  When I get in the exam room he closes the door behind me and says to take off my pants and get in the exam table.  I was caught off guard but I just agreed because I didn't want to make things awkward by saying no.  He was a professional just doing his job I thought.  Biggest mistake of my life.  I wish I just listened to my gut and said I'm good down there.  But I didn't and now I'm ruined because of it.\n\nI have seen multiple other urologists.  My last one was at Cleveland clinic and she didn't know anything either.  I was in the appointment for 5 minutes after driving 5 hours.\n\nI'm sorry to hear about your bladder disease issues.  Losing yourself sexually is hard to cope with.  I personally don't think I can do it.  My sex drive was part of who I was.  And now the profound numbness and pressure I feel down there drives me crazy.\n\nI don't know if I have it in me to continue talking to lawyers or doctors anymore.  I know the damage is unfixable anyway.  I don't know how much longer I'll be here.",
      "created_utc": 1723338586.0,
      "score": 1
    },
    {
      "id": "lhtdzyk",
      "body": "Thank you.  I do consider it sexual assault but other urologists and doctors don't see it that way.  They just say it's normal to stretch and pinch/crush on the penis during exams.  I try to tell them how hard he did it and they still act like it can't be injured like that unless he was being crazy.  They basically don't know what to do with me and don't even want to get involved.  I get it.  I wouldn't want to deal with a patient that claims he got injured from an exam either.  But I'm a real victim of this man that has ruined my body and my life in one of the worst ways imaginable.\n\nI don't see justice coming.  No legal justice anyway.  He can just say he did everything by the book and that what he did didn't cause my issues.  I'm just fucked.  I cry everyday over how constantly uncomfortable i feel and over what I've lost.  I don't believe I have it in me to fight this anymore.",
      "created_utc": 1723500061.0,
      "score": 1
    },
    {
      "id": "li8dbdo",
      "body": "I'm sorry to you as well.  Yes it's so difficult to get lawyers to take on medical cases.  Unless you have substantial proof no lawyers want to be involved.  I too can't get a doctor to agree that what the uro did to me was the cause.  I have given up on lawyers.  Thank you for the comment but I'm just counting my days now.",
      "created_utc": 1723726307.0,
      "score": 1
    },
    {
      "id": "lk3eldp",
      "body": "I think it does happen regularly.  My own primary care provider sympathized with me because he said he went to a urologist once and the guy examined his testicles and squeezed them like he tried to crush them.  He said he almost punched the guy and yelled at him wtf he was doing.  He said after that he would absolutely believe they would injure a penis like what happened to me.  One guy I talked to said the uro pulled his penis and let go of it like you were starting a lawnmower.  Crazy inhumane shit.  The people I've talked with online have mostly been around the world unfortunately.",
      "created_utc": 1724715464.0,
      "score": 2
    },
    {
      "id": "lh62wvp",
      "body": "In the penis enlargement communities there are men that have been permanently injured by stretches.  One bad stretch leaves them with a numb penis and severe ED.  Look up jelqing injuries too.  The penis is not indestructible.",
      "created_utc": 1723149457.0,
      "score": 8
    },
    {
      "id": "lhvy7y2",
      "body": "Sigma😂😂🤣🤣",
      "created_utc": 1723543645.0,
      "score": 1
    },
    {
      "id": "lh8f720",
      "body": "Then, take your results to a malpractice lawyer.",
      "created_utc": 1723182613.0,
      "score": 87
    },
    {
      "id": "lh5haa9",
      "body": "have you been able to push for the doppler US? i’m not in neuro just FP so id definitely believe the neurologist, but a penile doppler US is a common procedure. \ndoctors hate doing 2nd opinion type things, it gets into local medical politics and its so stupid, but if you’re able, try to go to another unrelated facility, as connected health systems really push their providers to not step on each others toes. (i hate it too, it has caused our practice many headaches, and it jeopardizes the patient, but that’s healthcare in this society)",
      "created_utc": 1723142946.0,
      "score": 110
    },
    {
      "id": "lhbvvox",
      "body": "To the uro he views it as he did nothing wrong.  I called him the day after because I was sore and numb and couldn't get any erection.  I asked him could it have been what he did during the exam.  He said no I may have hurt my back getting up off the exam table.  I said no my backs fine.  And then he said I sounded stressed and asked if I had anything going on in my life.  I felt gaslit.  I said I'm only worried about this because I don't know what's going on.  He got defensive and said I assure you it's nothing from the exam causing your symptoms.  I kept my composure and said what should I do?  He said try taking some ibuprofen and waiting or come back and I'll examine you again.  I wanted to throw up when he said it because I knew I had been injured and he wasn't admitting it.  I said I'll let him know and I immediately went to my PCP and told her what he had done to me and I needed another urologist.\n\nI'll see about a penile angiogram thank you.",
      "created_utc": 1723233775.0,
      "score": 8
    },
    {
      "id": "lin579z",
      "body": "There was a woman on Quora a few years ago who got her clitoris permanently damaged after surgery (she lost all feeling and ability to orgasm), and the doctor refused to admit responsibility. She wrote prolifically about it. Sadly, I can't remember her name.",
      "created_utc": 1723939423.0,
      "score": 2
    },
    {
      "id": "lh4u3z5",
      "body": "Actually, I'm confused as to why they wouldn't jump on this case? It's clear medical malpractice, and it should be provable with some hard work. You could get a note from your primary care doctor stating that you didn't have any medically documented sexual issues up until that \"appointment\". That, and some imaging tests to prove sexual dysfunction would lay some strong ground work for a legal battle. I highly suggest speaking to a doctor about having some imaging work done on it, and maybe one of the doctors knows a lawyer who specializes in medical malpractice. Not only might this issue be correctable, but this is a multi-million dollar lawsuit. You could be rich and rock hard. Don't give up yet.",
      "created_utc": 1723135940.0,
      "score": 564
    },
    {
      "id": "lh68z1e",
      "body": "I know a guy in Maryland named Jack Johnston , he does penis cases , he had a calcified penis case he won , idk if he's still practicing though.. he's getting old..",
      "created_utc": 1723151277.0,
      "score": 21
    },
    {
      "id": "lh52yuh",
      "body": "Idk man but who wouldnt want to touch a case like you. I mean you can be in for big damages money if you win the lawsuit. Maybe try to find a different unconnected docotrs opinion?",
      "created_utc": 1723138624.0,
      "score": 8
    },
    {
      "id": "lh52ttq",
      "body": "Reading this comment made me think of a person who said their junk also didn't work after a urologist worked them over. I seriously wonder now just how common this really is...",
      "created_utc": 1723138581.0,
      "score": 86
    },
    {
      "id": "lh71km2",
      "body": "YOU NEED TO TALK TO A FUCKING INJURY LAWER BRO ",
      "created_utc": 1723161140.0,
      "score": 27
    },
    {
      "id": "lh68rob",
      "body": "Keep. Fucking. Trying. You don’t have to be a doctor or a lawyer to see this is poor treatment. Those lawyers are just afraid to go up against a doctor. If you testify, more may as well!! TRY DUDE!",
      "created_utc": 1723151212.0,
      "score": 38
    },
    {
      "id": "lh55xex",
      "body": "Plus the cost would likely put you into debt… sadly even if you could afford it they’d likely claim it was just an unlucky accident. Yeah, it may it have been but you’d think someone working with genitals for a living would understand how delicate genitals actually are?? Like you can break your dick! It’s not a bone but you can still break it! You can’t go yanking that thing around like a piece of laffy taffy 🫠",
      "created_utc": 1723139512.0,
      "score": 13
    },
    {
      "id": "lh7r73o",
      "body": "r/AskDocs may have some valuable information on how to proceed if you post your case there. it's a bit of a long shot but i've watched them give pretty helpful advice to people looking for help in medical malpractice cases and answers to complex medical problems like yours before",
      "created_utc": 1723170997.0,
      "score": 2
    },
    {
      "id": "lh9scxa",
      "body": "You need to look for lawyer’s that deal with medical injuries. There are lawyers out there that will help. You just need to find them. Because fuck that doctor. He could be destroying other penis’ as we speak. He needs to be stopped. I would also call in a complaint against him. I’m sure you can call the medical licensing people and put a complaint in on him as well.",
      "created_utc": 1723209695.0,
      "score": 1
    },
    {
      "id": "lip41u1",
      "body": "Go to a newspaper and tell your story",
      "created_utc": 1723976923.0,
      "score": 1
    },
    {
      "id": "lh6adym",
      "body": "I'm here because of pssd too- not a day goes past without thinking of how to reverse this or how to make life have meaning again. I don't know how to just give up and accept what's happened to me",
      "created_utc": 1723151723.0,
      "score": 10
    },
    {
      "id": "lh6itlp",
      "body": "I'm sorry that happened. Do you mind sharing which antidepressants were responsible?",
      "created_utc": 1723154479.0,
      "score": 3
    },
    {
      "id": "lh56oi0",
      "body": "i lost the ability to feel pleasure for other reasons but i can totally relate to your experience; this is probably the cause of my asexuality too",
      "created_utc": 1723139738.0,
      "score": 5
    },
    {
      "id": "lh644ag",
      "body": "Is this permanent?",
      "created_utc": 1723149811.0,
      "score": 1
    },
    {
      "id": "lh8rpxg",
      "body": "As a guy imma agree with you. It sucks since I was diagnosed with the eye condition (choroidal Osteoma) when I was just 14 (23 now) but fuck idk how I would handle a numb dick. Hopefully life will treat us better sooner or later.",
      "created_utc": 1723190470.0,
      "score": 3
    },
    {
      "id": "lh4uszn",
      "body": "To me, this sounds like a nerve issue. Sometimes nerves can be reattached if they get broken. You need some imaging of your penis. An ultrasound, an MRI, or a CT scan. The ultrasound would be the cheapest option, and the most likely for an insurance company to approve.",
      "created_utc": 1723136150.0,
      "score": 37
    },
    {
      "id": "lh6r2cy",
      "body": "Have you tried to go to a doctor and tell them you lost feeling in your penis but NOT saying it’s from another doctor? Their hesitation may be stepping on toes. Tell them that it was an injury from “someone else” pulling on it and leave it at that. Don’t lie but omit the truth.",
      "created_utc": 1723157366.0,
      "score": 19
    },
    {
      "id": "lh7j8lu",
      "body": "Did the lawyers tell you why it would difficult to prove? I have a hard time understanding this. If you went to the doctor, everything he did exam wise would be documented. If the lawyer sent you to their doctor and had their own exams and scans done showing there’s damage then this is an easily proven case, unless of course too much time has passed in between and they’re thinking there’s no way to disprove that you broke things yourself",
      "created_utc": 1723167868.0,
      "score": 5
    },
    {
      "id": "lh4q92w",
      "body": "Ever tried some natural aphrodisiacs? I dont know if it‘ll help but I once tried „Damiana“ and it worked fine. You can make tea out of it but you have to use a lot of it to make the tea really strong. You also may feel a bit relaxed too",
      "created_utc": 1723134759.0,
      "score": 9
    },
    {
      "id": "lh6as6j",
      "body": "[removed]",
      "created_utc": 1723151849.0,
      "score": 6
    },
    {
      "id": "lh5o9f2",
      "body": "That is a good thought. We tend to ignore frontline workers and their experience. I really hope he tries this. Even if not a full fix they may have coping techniques that could be helpful, or workarounds, hacks, whatever we want to call it. \n\nThings that a doctor just wouldn’t know because the circumstances and situations are just too different. \n\nDoctor: idk see a urologist or a therapist\n\nPro Domme: oh yeah I see this all the time, you gotta go left left up down ABAC start, while cupping the testicles.",
      "created_utc": 1723145070.0,
      "score": 4
    },
    {
      "id": "lh8qon0",
      "body": "Have you tried kinetic therapy?",
      "created_utc": 1723189787.0,
      "score": 1
    },
    {
      "id": "lh6euu7",
      "body": "There is an international hospital in Turkey where they’ll run as many tests as you want and it’s not very expensive. Have you looked into foreign healthcare?",
      "created_utc": 1723153165.0,
      "score": 3
    },
    {
      "id": "lha5ebs",
      "body": "Interesting as it’s mostly connected, holding it in before you go and expelling the last drops when you finish.\n\nHave you ever tried to have fun with someone since? Like someone patient who would stay the entire day?",
      "created_utc": 1723214180.0,
      "score": 1
    },
    {
      "id": "lha64kn",
      "body": "So I have pretty extreme ED since heart attack. I can be having sex and it just go while inside someone and yes I take cialis. Though for other health reasons may have to stop that soon.",
      "created_utc": 1723214418.0,
      "score": 1
    },
    {
      "id": "lh5lonr",
      "body": "Noo the surgery is an implant that when u touch it ur penis gets erect, u wont get cut nor anything LOL. But surgery would be the last option here, I would suggest u keep trying with doctors and try to cure this the least hurful way. What kind of doctors did u go to? Urologist? What did u tell them when u started speaking abt this? U should go to a doctor who espcializes in this topic (the penis, lost of sensation) and tell them all ur symtompts, how it happened, what have u been doing (clails, PF therapy, etc), then ask them \"IS THERE SOMETHING I CAN DO?\" to trap them into telling u 😭 but avoid the fact ur doctor did that unless they ask. And keep doing the cialiss and pelvic floor therapy dont stop it. With the lawyers I dont know what to do honestly.",
      "created_utc": 1723144282.0,
      "score": 1
    },
    {
      "id": "lh6v5qc",
      "body": "I understand the pain, really. But please bear un mind there is a very real chance this can be fixed. Nerve damage does heal but it takes a lot of time. Ive seen people who lost their ability to smell recover it after two years. With help you should have even more chances",
      "created_utc": 1723158820.0,
      "score": 2
    },
    {
      "id": "lh7pyoq",
      "body": "I'm honestly shocked by your story. He had to have been extraordinarily rough to cause that kind of trauma from a mere exam. It almost makes me wonder whether it was intentional.",
      "created_utc": 1723170499.0,
      "score": 3
    },
    {
      "id": "lhaijhe",
      "body": "This has pained me so much to hear , I’m so sorry . All I can say is keep trying doctors and specialists, don’t take no for an answer , exaggerate how bad it is and demand help ( in a nice way ) . At least keep going until you get a definitive answer about whether or not it’s curable . Do you have any family ?",
      "created_utc": 1723218320.0,
      "score": 2
    },
    {
      "id": "lh9k8l3",
      "body": "[deleted]",
      "created_utc": 1723206535.0,
      "score": 1
    },
    {
      "id": "lh9gpn9",
      "body": "You are young, don't give up hope. Medical science is on its peak. It could take some time but i am CERTAIN, your penis will work again. that being said, your agony still makes me sad.",
      "created_utc": 1723205022.0,
      "score": 2
    },
    {
      "id": "lhcnk4o",
      "body": "I'm so sorry this happened to you, I don't understand how this could be justified in any way and how someone could say to you something like \"just get over it\" i really hope you have had atleast one person that you can talk to in real life that will try to help",
      "created_utc": 1723243108.0,
      "score": 2
    },
    {
      "id": "li8wbqb",
      "body": ":( I’m so sorry! Are you really thinking of going through with it now?  ",
      "created_utc": 1723732962.0,
      "score": 1
    },
    {
      "id": "lh7d566",
      "body": "I thought I had ED for years. Couldn’t get it up ever. It was in my head. \n\nDon’t self diagnose yourself. If no doctor thinks your story is realistic, it probably isn’t.",
      "created_utc": 1723165521.0,
      "score": 1
    },
    {
      "id": "lh8gr5v",
      "body": "I second this. OP push for a penile doppler ultrasound.",
      "created_utc": 1723183530.0,
      "score": 32
    },
    {
      "id": "lhaa8hd",
      "body": "I scheduled a Doppler ultrasound for the 19th.  I'm scared of it tbh.  Some guys have reported being hurt by the injections during doppler.  They inject your penis with a drug to give an erection.  I believe it only tests the blood flow in the penis and not the nerves.  But I guess I will still try it.  I don't think my penis is going to get an erection from the shot.  It's that dead.  If it does then my blood flow is good so maybe that would confirm it's a nerve issue?  Idk I'm just so hopeless about whatever I find out.",
      "created_utc": 1723215725.0,
      "score": 30
    },
    {
      "id": "lioimfv",
      "body": "I don’t know how close the pudenal nerve runs to the cervix, but I’m about to ask for an EMG myself because this has been the suspicion the entire time so I really appreciate the above comment as I didn’t know what that was before reading it.\n\nThe surgeon who performed on me actually never even returned my calls after the procedure even though I had two hospital visits within two weeks after the procedure…. I learned a big lesson about researching doctors before letting them perform.",
      "created_utc": 1723962663.0,
      "score": 1
    },
    {
      "id": "lh4wbxv",
      "body": "It's because it's his word against mine basically.  Some lawyers have told me medical malpractice cases are some of the hardest to actually win.  Some have said the only cases they take are ones like wrongful deaths, bad surgeries that resulted in someone becoming paralyzed.  I guess I sound like a minor case on the phone.  To them I'm probably just a guy that claims his penis got damaged from an exam which I know they've never heard of.  I hadn't either.  But I've even tried telling them it was extremely rough how he did it.  I've even tried saying I viewed it as sexually assault because I didn't give consent on him touching my penis.  I thought I was getting checked for hernias.\n\nI've had some doctors they don't know of any imaging on the penis.  They say it wouldn't show nerve damage even if it was there.  I'm just so exhausted from doctors and lawyers at this point.  Even if I became rich my penis is still gone which depresses me.",
      "created_utc": 1723136612.0,
      "score": 278
    },
    {
      "id": "lh4x5jh",
      "body": "[deleted]",
      "created_utc": 1723136861.0,
      "score": -7
    },
    {
      "id": "lh6987u",
      "body": "Does he have a license for WV?",
      "created_utc": 1723151357.0,
      "score": 7
    },
    {
      "id": "lh55ayq",
      "body": "I've tried but lawyers don't want it and I've got to the point I don't even care about lawsuits anymore.  I just want it to end.  I went to Cleveland Clinic urology who said they didn't think he was rough enough to damage anything.  I even told them I've found reports of injuries like this happening before from exams.  They just said to try pelvic floor exercises and I could come back if it doesn't help.  Already been doing those exercises for months with no change.  Doctors just don't know what they're doing.",
      "created_utc": 1723139324.0,
      "score": 23
    },
    {
      "id": "lh5k2ir",
      "body": "There are others.  There have been others that have reported being injured by rough urologist exams.  One guy said in a post that a uro pulled his penis really hard and fast and then let go.  He said like what you do when starting a lawnmower.  He said the uro told him this was to test for a reflex in the penis.  Makes me think that what he was doing to me.  Checking my reflex.  It's supposed to check the bulbocavernosous reflex and ironically that's the muscle that i can now feel is dead and numb.",
      "created_utc": 1723143784.0,
      "score": 65
    },
    {
      "id": "lh71mq3",
      "body": "IM SO FUCKING SORRY THIS HAPPENED TO YOU, \n\n\nYOUR GONNA SUE THEM AND MAKE SO MUCH FUCKING MONEY",
      "created_utc": 1723161161.0,
      "score": 11
    },
    {
      "id": "lh57qu1",
      "body": "I really don't know why some uros have been reported to do this.  I know they don't treat their own dick like that.  It seems sadistic.  I wish every second of the day I never let that man come near me.",
      "created_utc": 1723140058.0,
      "score": 31
    },
    {
      "id": "lh5deho",
      "body": "Lawyers take medical malpractice cases without upfront legal fees, since they settle out of court with the doctor’s malpractice insurance in 99% of cases.",
      "created_utc": 1723141775.0,
      "score": 6
    },
    {
      "id": "lha0kb3",
      "body": "I already reported him to the hospital he works for.  The patient advocate told me the vice president of physicians would be calling that day.  I waited and never received a call.  Next day I called and couldn't get the patient advocate to answer.  I left a message asking her to call me and next person that called me was the uro's receptionist.  She said she wanted to know what my complaint was about my appointment with them.  I had already told her back when it first happened.  I explained to her again that he injured me and my penis is numb and broke with severe ED and my life is ruined.  She asked if I had been seeing other doctors and I said yes.  She asked if they had found anything wrong yet.  I knew it was the uro trying to get her to pump me for info because he might be scared.  I told her they're working on it in an aggravated tone.  After that the conversation was over.  I regretted answering the phone but I was so upset.  The hospital has been ghosting me ever since.  It's probably because nobody wants to talk to me in case I try to sue.  My life has been fucking ruined because of this doctor.  I have called almost every medical malpractice lawyer in my state of WV.  I struggle to even care about lawyers anymore.  I just want my life to be over now as bad as it sounds.",
      "created_utc": 1723212577.0,
      "score": 1
    },
    {
      "id": "lipag4j",
      "body": "Do people even read newspapers anymore?",
      "created_utc": 1723980820.0,
      "score": 1
    },
    {
      "id": "lh6aqip",
      "body": "I know exactly how much you are suffering. I should have died from this back then, but managed to survive until now. And people don't even fucking believe me when I tell them about this. Especially not doctors, the people who did this to me.",
      "created_utc": 1723151834.0,
      "score": 5
    },
    {
      "id": "lh65bhp",
      "body": "I think so for me at least.",
      "created_utc": 1723150175.0,
      "score": 1
    },
    {
      "id": "lh4s5zp",
      "body": "I'm actually on TRT since which is the best aphrodisiac there is.  It actually gives me great libido mentally.  But physically I'm destroyed because my penis is basically disconnected.",
      "created_utc": 1723135346.0,
      "score": 25
    },
    {
      "id": "lh6lqdo",
      "body": "I have not.  I can't imagine it being worse than American healthcare.  What's the name of the hospital.",
      "created_utc": 1723155483.0,
      "score": 2
    },
    {
      "id": "lha7xzt",
      "body": "I tried once and could not get it up or feel anything with her.  Even with high dose Cialis.  My life is ruined.",
      "created_utc": 1723214998.0,
      "score": 1
    },
    {
      "id": "lh7qgya",
      "body": "I don't know why he would want to but who knows.  There are just sadistic people I know.  I'm going to try to assume it was severe carelessness.  He was very rough.  I was sore for two weeks after and had electric shock nerve pains that shot thru my penis for two weeks as well",
      "created_utc": 1723170703.0,
      "score": 3
    },
    {
      "id": "lh9kv0e",
      "body": "I'm sorry man.  Physical problems can be the worst.  I've thought tho I would rather have almost any other physical problem than this.  I would give up my legs before my dick.  I just can't take this anymore",
      "created_utc": 1723206790.0,
      "score": 1
    },
    {
      "id": "lhcprt0",
      "body": "That was my own mother that told me to \"just get over it\".  She said I was weak for letting this affect me so much.  I told her that doctor just killed your son and that's all you can say?  I haven't spoken to her since.  She was never caring.  She was one of the few people I've told in real life and it was a mistake.",
      "created_utc": 1723243910.0,
      "score": 2
    },
    {
      "id": "lhakexf",
      "body": "What you could get is proof of your physical damage that you can take to a lawyer! That alone seems worth the “shot” (sorry, not laughing at you but trying to make light)",
      "created_utc": 1723218892.0,
      "score": 15
    },
    {
      "id": "lhcwouq",
      "body": "Hey man it’s worth the risk",
      "created_utc": 1723246450.0,
      "score": 4
    },
    {
      "id": "lhq73i7",
      "body": "[deleted]",
      "created_utc": 1723460762.0,
      "score": 1
    },
    {
      "id": "ljrmupr",
      "body": "I sympathize with you man, but cmon, don't be a pussy, do the test. I did it and it's fine. They inject you with a drug (which depends on the doc, mine just did a a mild one, but some do the full trimix/caverject). \n\nIt hurts a bit sure, but it's worth it. Not to be weird, but as a consolation, the nurse literally has to rub lube on your dick as the test is going on, not bad if you ask me.",
      "created_utc": 1724535769.0,
      "score": 1
    },
    {
      "id": "lipmfh6",
      "body": "I'm so sorry this happened to you! I wish you luck, and I hope you get justice!\n\nThe same goes for the OP! So many people injured and damaged by medical malpractice, it's awful!",
      "created_utc": 1723986608.0,
      "score": 1
    },
    {
      "id": "lh4xase",
      "body": "I just want to say, its too soon to know for sure whether this is permanent. There have been some other comments suggesting testing, and I think that's a good place to start alongside looking for lawyers. \n\n\nI know it's not the same, but I once experienced an injury to my toe and lost all sensation to it for nearly six months, only for it to be fully regained later. I can now feel it just as well as I ever could. So as traumatic and crazy as this situation is, please don't give up. ",
      "created_utc": 1723136906.0,
      "score": 172
    },
    {
      "id": "lh69lq6",
      "body": "you have literally lost something that for the typical man is paramount in self-fulfillment. The quality of your life has dramatically reduced due to the damage done by the incompetence and subsequent malpractice of a doctor. You could go the long route of going to a psychiatrist, to a psychologist, to a new urologist, neurologist, anything to get some more idea of what is wrong and why it happened.\n\nBut yeah, this is definitely something that I would imagine a judge wincing at after hearing.",
      "created_utc": 1723151475.0,
      "score": 45
    },
    {
      "id": "lh5c846",
      "body": "Every doctor carries medical malpractice insurance, and lawyers jump on even the smallest of potential claims because the insurance’s modus operandi is to settle without going to trial…. \n\nI suspect something else is amiss here because this is an open and shut easy case for any lawyer… they take these things on the contingency that if you win you pay their fee.",
      "created_utc": 1723141421.0,
      "score": 52
    },
    {
      "id": "lh6ifsc",
      "body": "If you have your medical chart available, I would print out a hard copy of everything uro and your PCP when you just talk about genital/repro stuff. I think you have a case. I have sat in a federal court for interrogation for non medical things- you have this made. Gather your proof, make a timeline, and include ALL medical documents that show that before their “examination”, you were fine. Your penis worked. But if you have bruising, take pictures. Anything abnormal take pictures. Go to a second opinion and tell them what “examination” was done and now your issues hit you NEED to ask “could this (list symptoms you’re experiencing) be a result of the “examination”?….you just need a yes from someone and you’re set imo",
      "created_utc": 1723154350.0,
      "score": 11
    },
    {
      "id": "lh54usn",
      "body": "[removed]",
      "created_utc": 1723139191.0,
      "score": 48
    },
    {
      "id": "lh5w597",
      "body": "All this seems fishy. Lawyers like money. Doctors have it . They also have malpractice insurance... while most cases are settled, it doesn't mean you don't have one.",
      "created_utc": 1723147434.0,
      "score": 14
    },
    {
      "id": "lh7fju3",
      "body": "medical malpractice IS hard to win because doctors are held to the standard in their field and so other doctors will testify “yep thats proper protocol”. only super outlandish stuff is worth litigating, although i would think this would qualify?",
      "created_utc": 1723166445.0,
      "score": 2
    },
    {
      "id": "lh8tedu",
      "body": "The lawyer doesn’t need to win the case, a very achievable goal is a settlement. I had to go thru like 5 lawyers to find one for a minor bike accident . \nI would have rather had no pain though, \nI’m so sorry this is happening",
      "created_utc": 1723191579.0,
      "score": 1
    },
    {
      "id": "li4qk0h",
      "body": "This might sound like a crazy idea, but have you tried to contact your local District Attorney’s Office to inquire about pressing criminal charges? The doctor sounds dangerous and if his roughness went outside the scope of the medical care you consented to, then maybe they could bring a case? It’s hard to get cops and DAs to take cases against the rich/powerful seriously, but might be worth at least looking into? I’m so sorry for the pain you are experiencing. ",
      "created_utc": 1723667320.0,
      "score": 1
    },
    {
      "id": "likj04n",
      "body": "i would share very little on the phone when making the appt just find a medical malpractice attorney and ask for a consultation and try to gather any medical documentation that can prove you were fine before this exam even the phone call the day after lawyers don’t want to take a case that has no evidence if you can gather enough evidence and bring it to them there shouldn’t be an attorney who says no",
      "created_utc": 1723905423.0,
      "score": 1
    },
    {
      "id": "lh551pv",
      "body": "WTF is wrong with you? If you think it’s fake don’t comment. It’s that simple. It’s free to mind your own business but costs you your reputation to go around advertising the kind of person you are",
      "created_utc": 1723139248.0,
      "score": 10
    },
    {
      "id": "lh52m1r",
      "body": "It isn't fake, this person is in extreme pain what the heck is wrong with you...",
      "created_utc": 1723138515.0,
      "score": 16
    },
    {
      "id": "lh4xubn",
      "body": "[removed]",
      "created_utc": 1723137072.0,
      "score": 1
    },
    {
      "id": "lhdx0wo",
      "body": "https://www.jhjohnstonlaw.com I’m thinking this is the lawyer they’re talking about.",
      "created_utc": 1723261322.0,
      "score": 3
    },
    {
      "id": "lh5oqbe",
      "body": "My first question is who told you that he destroyed your bulbocavernosous muscle? If you've been seen by a doctor who examined you and made that statement, that's a huge important piece of evidence in your favor.\n\n\nThat being said, I would maybe look at big city or national law firms. They would have the resources to help you. I think it will help you to conquer this medically by fighting back legally.",
      "created_utc": 1723145211.0,
      "score": 29
    },
    {
      "id": "lh5cwlp",
      "body": "Pelvic Floor PT is incredibly valuable in your case, but you need to be regularly going to an accredited PT so they can guide you through the exercises and try other approaches depending on the feedback you give. You’re not going to get results going once and following a print out of exercises.",
      "created_utc": 1723141627.0,
      "score": 18
    },
    {
      "id": "lh6379f",
      "body": "It 10000000% is sadistic! We need the dick ripper off the streets asap \n\nTry a lawyer out of their reach that they don’t already have in their pocket. Idk where you are but there’s some big time injury lawyers on the East Coast (US) that would step up to the plate for you.",
      "created_utc": 1723149542.0,
      "score": 17
    },
    {
      "id": "lhb8nn5",
      "body": "Have you tried looking for lawyers outside of WV? Does your family know about this? I think you should sue that doctor and the hospital for not being more empathetic of your situation. I am really really sorry you are going through this. Reading what you’ve had to say so far breaks my heart for you. I know that doesn’t help you but I would look into trying to find lawyers outside of your state. \n\nI had a friend whose family lives in Missouri and the gas company had come out to do work and the next day the house exploded and her uncle died. They used a lawyer here in Texas because he specialized with that type of lawsuit/situation. \n\nAnd if there is anything I can do to help, please let me know. I am in Texas but I don’t start my new job till the 19th so I have free time to try and help you if you do not have anyone.",
      "created_utc": 1723226391.0,
      "score": 1
    },
    {
      "id": "liq0swj",
      "body": "I meant media in general",
      "created_utc": 1723992130.0,
      "score": 1
    },
    {
      "id": "lhrfhh8",
      "body": "Yup, another PSSD sufferer here with the same experience. My life ended seven years ago when I took those pills, and no one believes me. If I have to deal with another doctor gaslighting me I'll strangle someone, but thankfully I won't be around for much longer.",
      "created_utc": 1723477872.0,
      "score": 2
    },
    {
      "id": "lh6ntb8",
      "body": "Memorial Şişli Hastanesi",
      "created_utc": 1723156211.0,
      "score": 2
    },
    {
      "id": "lh7rabe",
      "body": "How long has it been? Nerve regeneration and healing can take years, albeit most of the improvement will occur within the 1st year post-injury, to the extent it occurs at all.",
      "created_utc": 1723171034.0,
      "score": 3
    },
    {
      "id": "lh9l9r4",
      "body": "Trust me, if the problem was your eyes you would say the same thing. I had heart problems before and I said \"I would give my legs to not having problems with my heart\"",
      "created_utc": 1723206958.0,
      "score": 2
    },
    {
      "id": "lhd7ywl",
      "body": "You are most definitely not weak for letting you get effected by this, you got an important part of your body taken away from you, for no reason at all and you have been going through this for 4 months, the least a mother could do is help you get through this. Again sorry this happened to you and sorry how your mom treated you it's just so fucked how you have gon through this for months and no one has tried to help, even though you are embarrassed about the situation you have contacted doctors about it and it seems they are not trying to help either",
      "created_utc": 1723250772.0,
      "score": 1
    },
    {
      "id": "lhb68iz",
      "body": "I know maybe it would be proof.  Or maybe not.  I just so depressed that I am still damaged in the end.",
      "created_utc": 1723225647.0,
      "score": 8
    },
    {
      "id": "lhqj4na",
      "body": "I wouldn't enjoy a payout without my dick.  Nothing can make this nightmare end.",
      "created_utc": 1723466477.0,
      "score": 1
    },
    {
      "id": "liqa1h8",
      "body": "Most of the urologists in my area have lawsuits against them. I haven’t even bothered looking at the OBGYN lawsuits, I’m sure it’s far worse. Sucks!! In my opinion, doctors are worse than cops - they overprescribe medications where natural remedies could be used, they gatekeep referrals and testing, they have a holier-than-thou attitude, and to them you are literally stupid. In the US, at least. It’s like paying to get punched in the face lol",
      "created_utc": 1723995311.0,
      "score": 1
    },
    {
      "id": "lhd1ecr",
      "body": "This is how it maybe used to be, and was what I used to think as well.\n\nAt least in the US (which we do kinda have a reputation worldwide for being litigious as all hell) this was not my experience. I’m going to try and condense this as much as possible while still being understandable. I used to be a very successful self employed dog groomer. In 2017 I was getting more and more pain in my right hip, and nothing (physical therapy, massages, acupuncture, chiropractic adjustments- I tried everything) was helping.\n\nSo I was referred to a highly respected surgeon in my area. He did some different tests and imaging, and said there was a labral tear that was the problem. He could fix it with endoscopic surgery (I think- this was in 2018 by this point) and I’d have 4 or 5 one inch incisions, and should be good to go after 6-8 weeks. \n\nWoke up from surgery with the feeling that something was very, very wrong. It was. I had 1 one inch incision, and then another that was approximately 5-6 inches down the front of my thigh. I was told that when they got in there the labrum wasn’t actually torn, so to get “better visibility” he pretty much butterflied my thigh like a chicken leg. He said the pain was caused from a “hip impingement” so he shaved down the head of my femur, popped it back into place, and all would be well in 8-10 weeks. \n\nNope. Leg constantly gave out on me, causing me to fall (and break teeth). Physical therapy wasn’t helping, and I was being accused of not doing my home exercises because otherwise I would be getting better. Finally my GP referred me to another surgeon to take a look at everything- he wasn’t local but again, great reviews and all the info I could find on him was positive.\n\nHe was extremely careful in the way he worded his diagnosis. (OP, if you’re reading this, this is an important part to look out for.) He “understood my frustration and how things didn’t go according to plan, but sometimes imaging just doesn’t show the whole picture.” He was very careful to NOT say that the previous surgeon made a mistake or did anything wrong; it was unfortunate but there is always a risk in surgery that something could go wrong. A good surgeon can minimize that risk, but it’s still there. \n\nSo he came up with a plan to “fix” everything (my word, not his, because that would imply the first surgeon screwed up). I was pretty nervous about a second surgery, but I couldn’t even walk around my house safely without my leg just suddenly giving out, so once more into the breach…\n\nHaven’t been without crutches, a walker or wheelchair since. Lost my business, am on full disability, and even though I had a very healthy “emergency fund” (which all self employed people should have at least double the recommended amount) I am now buried in a mountain of debt. No other doctors will even look at my case. And I spoke to MANY attorneys who specialize in medical malpractice cases- after reading all the paperwork from the surgeons, hospital staff, physical therapists, etc they said not one of those people even wrote a note that would hold up in court about anyone making a mistake. And because of how many medical professionals have looked at my files, there’s no way a semi competent defense attorney couldn’t convince a judge or jury that it was just a very unfortunate outcome but not the fault of anyone involved.\n\nAnd sadly this WAS the short version. I really hope OP has better luck. But based on my experience? The doctors cover each other and so do the support staff. They don’t really need the malpractice insurance, but I’m glad someone’s making money off of them since they can ruin people’s lives and then just shrug and move on to the next patient/paycheck.",
      "created_utc": 1723248214.0,
      "score": 2
    },
    {
      "id": "lh6kfmj",
      "body": "I got hard copies of my medical records from everyone.  I had severe swelling of my penis veins afterwards that I took pictures of.  No bruising.  Thing is I was seeing him over low T and fertility.  I never had full on erectile dysfunction only infrequent erections due to low libido.  But on my chart he wrote that I said I had some erectile dysfunction.  Which could obviously be interpreted as me having ED before I saw him.  Low T has a symptom of erectile dysfunction but I never had trouble getting an erection when I was low.  My low T has since been corrected but my penis is still broken.",
      "created_utc": 1723155032.0,
      "score": 13
    },
    {
      "id": "lh55m16",
      "body": "I really don't care about getting rich anymore",
      "created_utc": 1723139417.0,
      "score": 47
    },
    {
      "id": "lh5xnhg",
      "body": "Medical malpractice cases are notoriously hard to win apparently.  I just read an article describing a large scale study that found that doctors won 80-90 percent of jury trials that involve weak evidence of negligence.",
      "created_utc": 1723147892.0,
      "score": 19
    },
    {
      "id": "lh7i74s",
      "body": "I told another urologist and she said oh we stretch penises all the time that's normal.  But I told her he pulled it extremely hard to the point it caused me an injury.  She said well it's not supposed to be done hard like that.  But her saying stretching is normal is probably enough for this uro to get out of a lawsuit.  Idk anymore",
      "created_utc": 1723167468.0,
      "score": 2
    },
    {
      "id": "li4v57e",
      "body": "Thank you.  I have not contacted them no.  I feel like I would be treated the same as other lawyers.  Nobody takes me seriously even tho I try to explain how rough he was.  I mean nobody even knows what to say when I tell them.  Which I understand cause it is such a strange case.  I've even reminded them of technically not giving consent to touch my penis.  Doesn't matter.  Still nobody wants the case.  This has me hopeless and I just have lost interest in lawsuits anymore.  My penis is still gone unfortunately.  All feeling is gone.  Just uncomfortablely numb jelly inside and out.  The inside of the penis being numb is what really drives me crazy.  I used to be able to feel the blood rushing thru it during erections and I had control over \"bouncing\" it but not anymore.  Can't get an erection at all anymore because the nerves/muscle is damaged most likely.  I feel like I got sent to hell and there's no way out.",
      "created_utc": 1723668764.0,
      "score": 1
    },
    {
      "id": "lh4xw5w",
      "body": "DiCM",
      "created_utc": 1723137087.0,
      "score": 1
    },
    {
      "id": "lhdxd3t",
      "body": "That's for taking the time to find him.  Unfortunately it says on that page he only serves Maryland, dc, and Virginia.  I'm in West Virginia.",
      "created_utc": 1723261480.0,
      "score": 3
    },
    {
      "id": "lh72esc",
      "body": "I hope op has insurance, this is so fucked up man. So fucked up. I'm actually tearing up, I want ro help op some how but I dont know what to do\n\n\nI feel powerless it's not fucking fair what happened to him, ans he's not even the only one ",
      "created_utc": 1723161451.0,
      "score": 7
    },
    {
      "id": "lh63vtr",
      "body": "I'm in West Virginia.  A lawyer would have to be licensed in my state in order to take my case.  I've called a few out of state and they say they can't do anything in WV anyway.",
      "created_utc": 1723149742.0,
      "score": 13
    },
    {
      "id": "lhs0dci",
      "body": "Nobody believes me either. I can write a detailed comment here on reddit and get hundreds of downvotes just for saying what happened to me. Sad thing is, most of us die from this condition and it is just labeled as a normal suicide.",
      "created_utc": 1723484418.0,
      "score": 2
    },
    {
      "id": "lhaaoap",
      "body": "You're right I'm sorry I didn't mean it that way.  I'm just really struggling rn",
      "created_utc": 1723215866.0,
      "score": 1
    },
    {
      "id": "lh58o5f",
      "body": "I wonder if down the line you could see a surgeon. Phalloplasty surgeons could potentially give you an erectile implant and see about nerve hookup maybe, not sure precisely how much they can help but I think they could help at least a bit. Maybe go check out r/phallo for surgeon recommendations",
      "created_utc": 1723140340.0,
      "score": 56
    },
    {
      "id": "lh8pe8s",
      "body": "This isn't about getting rich. This is about you making sure that idiot doctor doesn't hurt anyone. Go get an EMG, that's your proof.  If your lawyers haven't suggested that yet, they're quacks.",
      "created_utc": 1723188935.0,
      "score": 10
    },
    {
      "id": "lhb719q",
      "body": "Yes. I was disabled in a car accident bc of a seizure. Bc a Dr chose not to put me on medication after my first seizure weeks before. \n\nNo lawyer will represent me. Even with hard facts and being disabled. If I was put on the medication for seizures it would have never happened. Since being medicated I’ve had 0 seizures. And no lawyer will take it. Even though it seems open and shut and I literally can’t walk. \n\nI hope you can get a lawyer and stuff but what they’re telling you- that they are almost impossible to win was my exact same experience.",
      "created_utc": 1723225894.0,
      "score": 4
    },
    {
      "id": "lh80cs1",
      "body": "Did that study yet include out of court cases?",
      "created_utc": 1723174929.0,
      "score": 2
    },
    {
      "id": "lh7ilyc",
      "body": "this is awful. i cant imagine how you feel. i really hope you receive justice and peace and comfort",
      "created_utc": 1723167625.0,
      "score": 4
    },
    {
      "id": "lh8pjjx",
      "body": "This like cops protecting other cops. Forget urologists and see an neurologist for an EMG",
      "created_utc": 1723189032.0,
      "score": 1
    },
    {
      "id": "li88t9c",
      "body": "Maybe that lawyer knows someone and can refer you.",
      "created_utc": 1723724471.0,
      "score": 1
    },
    {
      "id": "lh65ce2",
      "body": "That’s so corrupt fuck how is that even legal… could you sue him in a civil case? Or sue the medical office he works at? How the hell hasn’t he even tried to get you to settle out of court or anything. If this ever got out to the media all of America would be on your side.",
      "created_utc": 1723150182.0,
      "score": 16
    },
    {
      "id": "lhtr7u1",
      "body": "This condition really opened my eyes to how little a human life is worth. Sad state of affairs",
      "created_utc": 1723504730.0,
      "score": 1
    },
    {
      "id": "lh5qf4c",
      "body": "Dr Blair Peters at OHSU is also a nerve specialist. Might be worth OP trying to get an appointment with him to see if he can help",
      "created_utc": 1723145721.0,
      "score": 41
    },
    {
      "id": "lh9cde9",
      "body": "I know I'm sorry I'm just really struggling.  I've heard an EMG can't test penile nerves",
      "created_utc": 1723203033.0,
      "score": 6
    },
    {
      "id": "li8civy",
      "body": "I'm sorry but I have given up on lawyers.  I've been referred to many.  Still nobody wants my case.  It's impossible.  I am just counting my days now.",
      "created_utc": 1723725992.0,
      "score": 1
    },
    {
      "id": "lh678h2",
      "body": "This made me tear up.  I wish I could believe that many people would be on my side.  But it feels like few people even believe me or care.  He deserves his reputation ruined but I could never go public out of humiliation.",
      "created_utc": 1723150741.0,
      "score": 20
    },
    {
      "id": "lha77s2",
      "body": "I'd still consult a neurologist, or 2-3 of them for more opinions as needed.\n\nSorry you're going through this OP",
      "created_utc": 1723214766.0,
      "score": 1
    },
    {
      "id": "lh6a3nw",
      "body": "Stop it now you’re gonna get me cryin too. He absolutely deserves that and then some, he’s a menace to society and needs to be stopped. I don’t wanna think about how many other people have had their lives ruined by this unstoppable moron. Please do not let yourself feel shame about being wronged like this, or about your current condition for one second, none of this is on you man. You deserve your pride and peace of mind back at the very least. And HEFTY compensation",
      "created_utc": 1723151633.0,
      "score": 8
    }
  ]
}