{
  "id": "1ikezjo",
  "title": "Sick of seeing bullshit advice and cliches",
  "selftext": "\"SuIcIdE iS a PeRmAnEnT sOlUtIoN tO a TeMpOrArY pRoBlEm\" \n\n\"It GeTs BeTtEr\" \n\n\"YoU hAvE sO mUcH tO lIvE fOr\"\n\n\"MaKe YoUrSeLf A cUp Of TeA\"\n\n\"PeOpLe CaRe AbOuT yOu\"\n\n  \nFuck up! You have no idea what my situation is and have probably never been suicidal before. I'm gonna go apeshit if I see another fucking cliche",
  "created_utc": 1738988874.0,
  "score": 494,
  "num_comments": 101,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ikezjo/sick_of_seeing_bullshit_advice_and_cliches/",
  "comments": [
    {
      "id": "mbm3l0g",
      "body": "It's nothing but useless platitudes, and the internet is full of them.",
      "created_utc": 1738992260.0,
      "score": 138
    },
    {
      "id": "mbm0e80",
      "body": "It’s so condescending",
      "created_utc": 1738990825.0,
      "score": 91
    },
    {
      "id": "mbm7k6x",
      "body": "That first one...pisses me off, too. That last one..........so my pain is irrelevant? These people aren't dealing with this ish. I should live for others? What about my own happiness. ",
      "created_utc": 1738994139.0,
      "score": 83
    },
    {
      "id": "mbm8cfu",
      "body": "Yuh I see them everywhere on here. I don't get them on my posts because I think people know I'm cooked for life. \n\nI personally hate “God gives His toughest battles to His strongest soldier.” I don't get it; it feels like a tough battle I will never get out of. Just a constant reminder that I'm not strong or worth living.",
      "created_utc": 1738994527.0,
      "score": 55
    },
    {
      "id": "mbn4hlz",
      "body": "HaPpiNeSs iS a ChOiCe, aNd sO iS sAdNeSs\n\nFoCuS oN ThE gOoD tHiNgS iN yOuR LiFe",
      "created_utc": 1739013157.0,
      "score": 45
    },
    {
      "id": "mbmlbtm",
      "body": "“It’s AlL iN YoUr HeAD”",
      "created_utc": 1739001719.0,
      "score": 36
    },
    {
      "id": "mbn7tf9",
      "body": "They don't understand. \nPeople have been taught that's what to say. \nIt's not.\nIt's actually unhelpful & demeaning.\nThey don't realise that. \n\nIt would be interesting to know how many people who are \"teaching\" others how to interact with those of us who are suicidal, have truly been through it themselves. \n\nI feel dismissed when someone says such things to me. It's due to them not getting it. Some have been suicidal to a degree and perhaps those platitudes helped them - yet they've never helped me. \nI've always felt diminished and dismissed like I'm just meant to \"get over it\".\n\nDoesn't work that way.\n\nI hear you OP.",
      "created_utc": 1739015056.0,
      "score": 30
    },
    {
      "id": "mbmjldb",
      "body": "It feels like an endless battle.",
      "created_utc": 1739000707.0,
      "score": 26
    },
    {
      "id": "mbmyw7v",
      "body": "The first one is so stupid because it feels like everything BUT a “temporary problem”.\nIt’s been years. Every time i thought it was over, that I’d healed and that I could be happy now, i had another episode, another mental breakdown and wanted it all to end. They don’t know how it feels, they can’t fathom that this is not a temporary problem for most.",
      "created_utc": 1739009789.0,
      "score": 21
    },
    {
      "id": "mbmhzsw",
      "body": "Finally someone says it, I fully agree.",
      "created_utc": 1738999766.0,
      "score": 18
    },
    {
      "id": "mbmnrr0",
      "body": "They're all fucking bullshit. But the cup of tea one has no right to piss me off as much as is does for some reason",
      "created_utc": 1739003130.0,
      "score": 20
    },
    {
      "id": "mbmv7m4",
      "body": "the first one is almost a paradox (i guess) because if there was a permanent solution to any problem, i'd take it.",
      "created_utc": 1739007583.0,
      "score": 16
    },
    {
      "id": "mbndf1c",
      "body": "”Thoughts and prayers “. That’s always a good one. Solves everything. 🌊😫",
      "created_utc": 1739017934.0,
      "score": 11
    },
    {
      "id": "mbnez98",
      "body": "Moreover, you can't even say \"these sayings are bullshit\" without making more people hate you... Lose lose situation.",
      "created_utc": 1739018646.0,
      "score": 9
    },
    {
      "id": "mbmb4pn",
      "body": "Yea they don’t get that it’s not a choice at all.",
      "created_utc": 1738995965.0,
      "score": 22
    },
    {
      "id": "mbp161a",
      "body": "I don’t care if it’s a “Temporary problem” I don’t want to fight anymore.",
      "created_utc": 1739037649.0,
      "score": 8
    },
    {
      "id": "mbmvq06",
      "body": "I actually agree with the first one, like why wouldn't you want a permanent solution to a problem",
      "created_utc": 1739007889.0,
      "score": 13
    },
    {
      "id": "mbp2ar0",
      "body": "It's part of the ignorance regarding mental issues. People don't know how to deal with this stuff because they've never experienced or didn't know what they experienced. I mean you have old people saying depression is a modern thing made up by the younger, when even animals can fall into a depressive state.\n\nI've never heard about the \"cup of tea\", but it sounds pretty condescending.",
      "created_utc": 1739037973.0,
      "score": 7
    },
    {
      "id": "mbpeog4",
      "body": "I hate \"it gets better\" coz it never does.",
      "created_utc": 1739041497.0,
      "score": 7
    },
    {
      "id": "mbn36hg",
      "body": "Yeah, it's getting worse and people don't care about me. My depression isn't a temporary problem. I've been suffering with it more than 15 years.",
      "created_utc": 1739012388.0,
      "score": 6
    },
    {
      "id": "mbnb72e",
      "body": "I totally agree. It’s such bullshit advice.",
      "created_utc": 1739016850.0,
      "score": 6
    },
    {
      "id": "mbnuvef",
      "body": "I feel weird about them in a few  ways. One, it takes the focus off the person going through the pain. I get it that the people around the suicidal person will feel their absence, but at this moment, the suicidal person needs the most care and support. This issue is not about anyone else EXCEPT the suicidal person.\n\nThis won’t stop everyone from killing themselves. Some are so dead set on doing it that no fluffy words will get them out of that mindset. It’s not good advice.\n\nSuicide is complex asf and I wish people understood that.",
      "created_utc": 1739024861.0,
      "score": 6
    },
    {
      "id": "mbnwhtv",
      "body": "Yes I hate that thing where they make \"\"\"cool phrases to help suicidal people\"\"\"\" thinking they are helping",
      "created_utc": 1739025423.0,
      "score": 6
    },
    {
      "id": "mbp0z36",
      "body": "HaVe YoU trIEd tAKing a WAlk?",
      "created_utc": 1739037594.0,
      "score": 5
    },
    {
      "id": "mbpq7e2",
      "body": "lol I was telling someone how I’m sick of life and every new thing I get into never helps yet their wonderful advice was ‘maybe you should get another hobby to make life more interesting’. \n\npeople honestly just don’t care and reach for the most generic words to get you off their backs (this is just what I think) but yeah, it’s a nice reminder to never open up to people (and then get blamed for being too closed off)",
      "created_utc": 1739044820.0,
      "score": 6
    },
    {
      "id": "mbmgnmg",
      "body": "they're just a bunch of pathetic fucks who wants to feel better about themselves because \"they're trying to empathize and help\"",
      "created_utc": 1738998997.0,
      "score": 20
    },
    {
      "id": "mbp90vf",
      "body": ":( it’s the worst. “YOU ARE SO YOUNG!!”",
      "created_utc": 1739039891.0,
      "score": 6
    },
    {
      "id": "mbn8rv0",
      "body": "I agree. It’s just filler bullshit. Hope and resilience is all we have and it’s hard to find it in the darkness.",
      "created_utc": 1739015580.0,
      "score": 4
    },
    {
      "id": "mbnn0v3",
      "body": "It feels like they aren't trying to sympathize with you but just feel better about themselves by othering you as strange",
      "created_utc": 1739021990.0,
      "score": 5
    },
    {
      "id": "mbo8ios",
      "body": "I especially dislike the first and second one. Some problems ARE permanent. It would be much better to ask how they can support you, and actually acknowledge your pain, instead of trying to lie to you about your own life.",
      "created_utc": 1739029270.0,
      "score": 4
    },
    {
      "id": "mbp2dzu",
      "body": "People say this shit because they feel incredibly uncomfortable around the idea of not wanting to be alive.\n\nYes, thank you Janet, just being positive really DID make everything better. Thanks. Wish I would have known about that sooner 🙄",
      "created_utc": 1739037999.0,
      "score": 4
    },
    {
      "id": "mbp7h6k",
      "body": "\"People care about you\" \n\nyeah they'll only start caring once im dead cuz they never did in the first place 😂 quit sugarcoating it",
      "created_utc": 1739039455.0,
      "score": 5
    },
    {
      "id": "mbpm1ph",
      "body": "I totally agree with you. If only it was that easy to change the way we feel none of us would be feeling the way we do",
      "created_utc": 1739043611.0,
      "score": 4
    },
    {
      "id": "mbpshzw",
      "body": "They've been telling me it gets better for ten years. For ten years, it's gotten worse and worse. It's never getting better",
      "created_utc": 1739045501.0,
      "score": 4
    },
    {
      "id": "mbpuk6v",
      "body": "\"oThErS cAn oNLy LoVe yOu iF yOu LoVe yOuRsELf!\"\n\ni hate that one so much. so you're telling me if i am not taught of a basic life skill i am not worthy of love? ok.",
      "created_utc": 1739046114.0,
      "score": 4
    },
    {
      "id": "mbopxk3",
      "body": "[deleted]",
      "created_utc": 1739034403.0,
      "score": 6
    },
    {
      "id": "mbmidtf",
      "body": "[removed]",
      "created_utc": 1738999993.0,
      "score": 18
    },
    {
      "id": "mboifbo",
      "body": "would unconditional love help?",
      "created_utc": 1739032212.0,
      "score": 3
    },
    {
      "id": "mbq7sug",
      "body": "It's so degrading. It always makes me feel dehumanized whenever people talk to me like this. :/",
      "created_utc": 1739050041.0,
      "score": 3
    },
    {
      "id": "mbsccgo",
      "body": "Its going to be shit but it can be pretty if you search for it I've felt good times at my lowest I wasn't even looking and it was good at I fucked it up but that's life I wont say any of the cliches but I hope you give it a lil just for a few more good times and see if you want to check out still",
      "created_utc": 1739076766.0,
      "score": 3
    },
    {
      "id": "mbnv65y",
      "body": "Yeah, these annoy me too. One of the most helpful videos I ever watched started by acknowledging “You have no reason to believe with any certainty that things will get better if you stay alive.” She built off of it from there, talking about how there are endless possibilities for the future, but that first part was important for me.\n\nWe see you. You are heard.",
      "created_utc": 1739024965.0,
      "score": 6
    },
    {
      "id": "mbp6keq",
      "body": "Yes but some people are saying that not to change your emotions but as a way to reach out to you as sincerely as they can. That's why people say \"I'm sorry\", like it's an honest response because they're at least saying they see your pain. Some of these other phrases are used in similar contexts, although I agree sometimes they are simply shared to be condescending",
      "created_utc": 1739039195.0,
      "score": 2
    },
    {
      "id": "mbsl5h5",
      "body": "the permanent solution one drives me crazy. i once posted somewhere on reddit about how spending my whole life in poverty with no way out has led me to feeling this way. someone said that cliche to me and i had to laugh. like? idk, poverty has been a consistent part of my life. the idea that i can ever escape at all isn't realistic in any way. how could i not consider it a permanent problem?",
      "created_utc": 1739080819.0,
      "score": 2
    },
    {
      "id": "mbn55qq",
      "body": "Alcohol is my best friend",
      "created_utc": 1739013549.0,
      "score": 3
    },
    {
      "id": "mbs347b",
      "body": "I’m sorry you’re going through such a hard time.",
      "created_utc": 1739072951.0,
      "score": 2
    },
    {
      "id": "mbn9490",
      "body": "What do you expect?\n\n\"No, it never gets better and you will always struggle. You are as worthless as you think? Please do the world a favour and just do it?\"\n\nCome on.",
      "created_utc": 1739015769.0,
      "score": 2
    },
    {
      "id": "mbmxmx2",
      "body": "Hi,\n\nand  yet you would never respect the one who says that to you , but by \"cliché\". I think people here should admit they're just terrible to be arround with, if people were underminding you as you do them , you would never want to be beside them, with a purposeful life or not.",
      "created_utc": 1739009031.0,
      "score": 1
    },
    {
      "id": "mbscoxl",
      "body": "In all honesty nobody cares most times that's why they say cliches it what they heard in movies I barely even know how to show emotions but I can read people and I see patterns they mostly say these things so they don't feel bad not cause of care",
      "created_utc": 1739076918.0,
      "score": 1
    },
    {
      "id": "mc0yxqu",
      "body": "Fucking MOOD.",
      "created_utc": 1739200908.0,
      "score": 1
    },
    {
      "id": "mc3f0we",
      "body": "first one pmo like ok? a solution is a solution like sycau",
      "created_utc": 1739231832.0,
      "score": 1
    },
    {
      "id": "mc58qtj",
      "body": "It helps me to be here, to be with other suicidal people, who understand and won't judge or criticise you. Mental illness was always real and never fake, why would you be proud of sharing your mind wants to die everyday? It's not a choice it's also valid human emotions. No clichés or quotes, just understand and be there as much as you can. Everyone is different as a person, for me I'm very spiritual and I love the good things only, about religion. I'm going to say that Jesus or Yeshua was always God to me in the unconditional love state and never that other mistaken human version. Try to just hang out with people like yourself. Because suicide and mental illnesses is just like other bodily illnesses, why was this so difficult to understand??? Group therapy with people like you guys has helped me tremendously, just knowing I'm never ever alone in my life's issues.",
      "created_utc": 1739256821.0,
      "score": 1
    },
    {
      "id": "mcfbbqq",
      "body": "Yeah, most people (Including me) just dont know what to say. I mean, what IS there to say? I think they just wanna help in any way they can. ❤️",
      "created_utc": 1739390981.0,
      "score": 1
    },
    {
      "id": "mcx1ozv",
      "body": "Couldn't have said it better myself. I've heard \"it GeTs BeTtEr\" for almost 20 years now.",
      "created_utc": 1739635195.0,
      "score": 1
    },
    {
      "id": "mbqwxsi",
      "body": "Although I agree I absolutely always try making a cup of tea. It has helped. \nOne that I really hate is “suicidal people don’t want to die they just want the pain to end.” Fuxk you telling me what I want. I said I want to die and that’s what I want. I’m not so stupid I don’t know what I want.",
      "created_utc": 1739057974.0,
      "score": 1
    },
    {
      "id": "mbnd5ev",
      "body": "honestly? we won't stop everyone from committing \nbut so it after you've tried EVERYTHING\ngo and do a bungee jump\ngo broke and break a bank\ndrive exotic cars with friends\ndo this do that work here work there\nbe kind to others get that revenge\ngain fame\ndon't finish your life without experiencing the beauty of it first",
      "created_utc": 1739017810.0,
      "score": 0
    },
    {
      "id": "mboacks",
      "body": "It gets better dw",
      "created_utc": 1739029817.0,
      "score": 0
    },
    {
      "id": "mbryt4m",
      "body": "I think the one that kind of helps is how if you look yourself you won’t know what’ll happen in the future. I mean sure nothing will probably improve but you’ll never be able to find out if you’re dead.",
      "created_utc": 1739071299.0,
      "score": 0
    },
    {
      "id": "mcgvpr2",
      "body": "I've been suicidal. Sometimes still am. The only thing that I didn't flip off was when ( surprise surprise i was once Christian, then stop believing, but I know God is real, it's complicated) God told me he didn't want me to die, and as soon as I become willing to come back he'll heal me. Suicide cam through the tendency I have to pity myself for the things I've done and have hurt me. So I didn't listen the right way? Now I'm depressed? And so on. It will lead to a point where I'm shaking and desperate to curl up and not move. It gets hard to keep up with life when something is pressing down on you. Hating myself doesn't help either. Really the only time I wasn't suicidal was when God was with me. But I left him. So now, here I am.",
      "created_utc": 1739407565.0,
      "score": 0
    },
    {
      "id": "mbt71fm",
      "body": "Healthcare workers do this too. It’s all lip service and gaslighting. And when we aren’t immediately fixed by the useless comments, we are “difficult”.",
      "created_utc": 1739092698.0,
      "score": 23
    },
    {
      "id": "mbn6fin",
      "body": ">I personally hate “God gives His toughest battles to His strongest soldier.”\n\nOkay that's just a really dumb saying, so God is supposedly purposely pushing people to suicidal thoughts to test them? How is that supposed to be loving or uplifting?",
      "created_utc": 1739014277.0,
      "score": 46
    },
    {
      "id": "mbn97x7",
      "body": "I really dislike both of these. They're terrible aren't they? \nThis line about happiness being a choice - what a crock.",
      "created_utc": 1739015824.0,
      "score": 19
    },
    {
      "id": "mbt7asj",
      "body": "Lmao I’m a mental health nurse with autism, depression and anxiety and my supervisor told me I just wasn’t “manifesting” properly and my reality was based on my negativity. My problem is not due to me being negative, it’s due to me being consistently optimistic that I’ll be treated with respect.",
      "created_utc": 1739092846.0,
      "score": 6
    },
    {
      "id": "mcx1xa0",
      "body": "Especially the second half gets me going. Good things in life?! When!? Where!? How?!",
      "created_utc": 1739635269.0,
      "score": 1
    },
    {
      "id": "mbna2f6",
      "body": "I love (fucking despise) that one especially because yes, indeed, that's why it's called mental illness.",
      "created_utc": 1739016269.0,
      "score": 30
    },
    {
      "id": "mbo31k2",
      "body": "I wish I can upvote more then once because I heard this one far too many times\nIt's like nobody understands me",
      "created_utc": 1739027600.0,
      "score": 7
    },
    {
      "id": "mbrw7bp",
      "body": "Yeah like no shit, where else would it be? In my appendix? Up my ass and to the right? Like wtf",
      "created_utc": 1739070338.0,
      "score": 5
    },
    {
      "id": "mbqx2v8",
      "body": "Hahahahahhahahah I mean yeah!????? Lmfao but these people can’t imagine what it’s like to be in a head like this.",
      "created_utc": 1739058021.0,
      "score": 5
    },
    {
      "id": "mbn9f77",
      "body": "Oh and the line about how suicide is selfish. \nI find those people saying that stuff to be the selfish ones. \nThey made the issue all about them.",
      "created_utc": 1739015933.0,
      "score": 17
    },
    {
      "id": "mbnkmi7",
      "body": "It is an endless battle, with no time to heal your wounds. The permanence Of S is its most attractive quality,",
      "created_utc": 1739021043.0,
      "score": 12
    },
    {
      "id": "mc4tin4",
      "body": "Omfg i hate that so fucking much",
      "created_utc": 1739249471.0,
      "score": 3
    },
    {
      "id": "mbn8b43",
      "body": "Could be they're really trying to help? They don't know what to say, so they fall back to what they've been taught to say? Doesn't make them bad people (I don't like people, to me, pretty much all people are bad), yet ignorant people. People who don't have the knowledge, lived experience, or emotional development to handle such a moment?",
      "created_utc": 1739015326.0,
      "score": 10
    },
    {
      "id": "mc4nbqm",
      "body": "Its not about advice. Just be there and listen and try to empathize. Talk to them and encourage them to express the depths of their pain and fear. They just wanna feel heard and acknowledged for a start.",
      "created_utc": 1739247032.0,
      "score": 4
    },
    {
      "id": "mbx2rca",
      "body": "Probably validation. “Yes, this is a shitty situation.” “Yes, you are going through a terrible fucking time.” “Damn, I can’t believe that happened to you. That’s pretty bad shit.” etc. Not saying it will work for everyone, but just being able to be validated and not trying to brush away or minimize pain can do more than you think.",
      "created_utc": 1739140833.0,
      "score": 3
    },
    {
      "id": "mbsspy7",
      "body": "That’s what’s so sad to me… usually the people who say cliches do want to help you, but it’s impossible for them to give true words of love if they don’t know you since suicide is such a personal thing…",
      "created_utc": 1739084766.0,
      "score": 2
    },
    {
      "id": "mbx2z7y",
      "body": "Can you PM the video? Or just post it…idk the sub’s rules that well",
      "created_utc": 1739140902.0,
      "score": 1
    },
    {
      "id": "mbykapq",
      "body": "Steal the bastards that make you poor. They don't feel bad to exploit you. Plus, I am going to make a big assumption but if you are commenting this kind of stuff in this kind of sub I guess that you don't have a lot of things too loose",
      "created_utc": 1739158938.0,
      "score": 1
    },
    {
      "id": "mbykkrd",
      "body": "Just give me a hug or something like that, not stupid bullshit for HR.",
      "created_utc": 1739159041.0,
      "score": 2
    },
    {
      "id": "mbuqw52",
      "body": "Yup. Therapists and the like will say the most basic shit and when you explain why that doesn't work for you, they get angry.",
      "created_utc": 1739116827.0,
      "score": 8
    },
    {
      "id": "mbpvusq",
      "body": "And what about the people that actually kill themselves? God gave them a hard battle knowing that they would actually end it? Complete bs",
      "created_utc": 1739046502.0,
      "score": 14
    },
    {
      "id": "mbo4sp5",
      "body": "Exactly. I have been thinking the same thing that what kind of a test am i being given. It's almost like a test to see how long I can hold on, but it has caused more suffering than good. I don't think it supposed to be loving or uplifting, though people do say it on here.",
      "created_utc": 1739028143.0,
      "score": 6
    },
    {
      "id": "mbnyfhw",
      "body": "Yeah. I’ve never liked how that puts the blame on the victim. Like, sure, sometimes it is a choice to wallow in misery, but that line ignores everything that may have led up to that. The person probably has some very valid reasons for experiencing sadness or any other negative emotion.",
      "created_utc": 1739026070.0,
      "score": 10
    },
    {
      "id": "mbokzfi",
      "body": "And if someone commits suicide and they have loved ones, suddenly it's magically no longer a choice to be sad or not.",
      "created_utc": 1739032956.0,
      "score": 7
    },
    {
      "id": "mc6ee12",
      "body": "Ikr. Because that’ll fix everything /s",
      "created_utc": 1739279696.0,
      "score": 2
    },
    {
      "id": "mbx7xfc",
      "body": "I’ll see if I can find it. Feel free to give me a poke if I don’t reply for a long while.",
      "created_utc": 1739142524.0,
      "score": 3
    },
    {
      "id": "mbyjmll",
      "body": "Me too please",
      "created_utc": 1739158692.0,
      "score": 2
    }
  ]
}