{
  "id": "1ilxfm1",
  "title": "\"you’re not alone\" YES, the fuck i am",
  "selftext": "no matter how many stupid phrases strangers post on the internet, no matter how many times someone looks at my arms and tells me with false empathy that “I'm not alone,” the truth remains the same: I am. I always have been\n\nit's so fucking easy to say that when you have someone, when there's a group of people who hold you up even when you break. But many of us don't have that. Some of us know that at the end of the day, when the lights go out and the noise of the world fades away, all that's left is the echo of our own thoughts and the weight of an existence that never asked to be lived.\n\nThere are no messages of support that can change that. There are no magic words that can fill the void or arms that can embrace what's already dead inside. In the end, the only certainty is that just as I lived in solitude, I will also die in it. And it's stupid for anyone to pretend otherwise just because they're unable to accept the reality of those of us who carry this every day.",
  "created_utc": 1739160271.0,
  "score": 592,
  "num_comments": 44,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ilxfm1/youre_not_alone_yes_the_fuck_i_am/",
  "comments": [
    {
      "id": "mbzfn5i",
      "body": "same, if i dont kill myself, im probably gonna die alone sitting in front of the tv one day, and no one will even notice im gone until weeks later when my body starts rotting and people complain about the smell. i dont even feel real anymore",
      "created_utc": 1739174064.0,
      "score": 141
    },
    {
      "id": "mc02sd9",
      "body": "Those that say that don't know what it's really like.",
      "created_utc": 1739188335.0,
      "score": 46
    },
    {
      "id": "mc047s8",
      "body": "Seriously! There is not a single thing anyone has ever said to me that was supposed to be comforting that didn’t just make it worse.\nIt’s like the less they actually know about your situation the more they feel the need to try to fix it so they end up saying things that don’t apply to you and just make you feel like shit",
      "created_utc": 1739189072.0,
      "score": 40
    },
    {
      "id": "mbznc7s",
      "body": "[deleted]",
      "created_utc": 1739178958.0,
      "score": 24
    },
    {
      "id": "mbzvvmf",
      "body": "Also, so what if other people feel shitty too?  That doesn't make me feel any less shitty.",
      "created_utc": 1739184376.0,
      "score": 27
    },
    {
      "id": "mc06tqs",
      "body": "Seriously, my bad i just *forgot* that other people exist. They totally want to hear about how theyve ruined me and im going to k myself because of them",
      "created_utc": 1739190343.0,
      "score": 13
    },
    {
      "id": "mbywrba",
      "body": "I'm sorry you feel this way I get what you mean by this even if strangers reached out and offered to talk to you, you would still not feel understood there's not much I can say but I hope you get better I truly do :( <3",
      "created_utc": 1739163977.0,
      "score": 12
    },
    {
      "id": "mc3x8cy",
      "body": "I hate that sentence. It's false and empty.",
      "created_utc": 1739238030.0,
      "score": 8
    },
    {
      "id": "mc4thxy",
      "body": "i understand this completely. every time i call the hotline, that automated voice says “you are not alone” and i want to hang up just because of how frustrated it makes me. i think one of the most isolating things about this kind of pain is that so few people actually understand what you’re feeling. if you ever meet someone else who’s suicidal, neither of you will likely ever know, because this is just something that you can’t talk about. \n\ni know that in the worst of it, nothing can change your mind. i want to tell you, anyway, that i get it. i get you. we all do. you’re not alone in that sense, and i hope your brain doesnt lie to you about that when it matters most. i hope youre doing alright, friend.💕",
      "created_utc": 1739249463.0,
      "score": 10
    },
    {
      "id": "mc2ps3h",
      "body": "Who does not die alone? Raise their proverbial hand. Even surrounded by others, you are still in your own reality in which no one else exists. We all know this somewhere as we trudge through life, and these clumsy words from others are attempts at compassion, their best. Tell me you have not made the same attempt at some point in your life. This moment will pass or you will choose not to let it. That's it.",
      "created_utc": 1739220273.0,
      "score": 6
    },
    {
      "id": "mc2o4td",
      "body": "My family is barely speaking at the moment. Most are mad at me (long story) my friends have their own lives. I feel like what’s left?",
      "created_utc": 1739219569.0,
      "score": 5
    },
    {
      "id": "mc2o65c",
      "body": "I’m really sorry that all I can say is “same.”",
      "created_utc": 1739219585.0,
      "score": 4
    },
    {
      "id": "mcaaowm",
      "body": "All of those dumb phrases people say to try to sympathetic always feels so empty. I'd also like to add \"it gets better\" / \"it's all part or gods plan\" / etc. Because these just feel so so insulting and most of the time these ppl aren't suffering in that way and can't understand :/",
      "created_utc": 1739321251.0,
      "score": 3
    },
    {
      "id": "mcgmroz",
      "body": "The worse part is having people, but still feeling alone. It never seems to be enough and you just start to feel like a giant burden to everybody after a while.",
      "created_utc": 1739404663.0,
      "score": 3
    },
    {
      "id": "mcwlag1",
      "body": "Yes. This. And It sucks.\nAnd I hate it when people say \"the worst part is having people but feeling alone\" and I'm like, that would be a step up for me, just stop.",
      "created_utc": 1739629755.0,
      "score": 3
    },
    {
      "id": "mbz4r0j",
      "body": "You have us, we will support you in any way internet strangers can",
      "created_utc": 1739167850.0,
      "score": 6
    },
    {
      "id": "mc2o5cx",
      "body": "My family is barely speaking at the moment. Most are mad at me (long story) my friends have their own lives. I feel like what’s left?",
      "created_utc": 1739219575.0,
      "score": 2
    },
    {
      "id": "mcbov8j",
      "body": "Go in the woods and live a true wolf experience",
      "created_utc": 1739340586.0,
      "score": 2
    },
    {
      "id": "mcvqzpk",
      "body": "A wise man once told me “alone separate is more depressing than alone together.”",
      "created_utc": 1739614876.0,
      "score": 2
    },
    {
      "id": "md12vh7",
      "body": "You Are Already Here….Time To Do Something Heroic….Amazing Before You Go….Save Someone Or Something Cute & Adorable While You Have Arms…Legs & Intelligence & Ability To Do So….Never Heard Of A Ghost Doing Something Spectacular & Useful For Mankind….",
      "created_utc": 1739683979.0,
      "score": 2
    },
    {
      "id": "md38334",
      "body": "Exactly what I feel every waking moment of my life \n\n\nCouldn't have phrased it any better ",
      "created_utc": 1739721803.0,
      "score": 2
    },
    {
      "id": "mc0f9mv",
      "body": "[removed]",
      "created_utc": 1739193973.0,
      "score": 1
    },
    {
      "id": "mc08vf1",
      "body": " Christ this this hits home :( I’m sorry you’re suffering.",
      "created_utc": 1739191290.0,
      "score": 34
    },
    {
      "id": "mc2zr2y",
      "body": "Ikr",
      "created_utc": 1739224709.0,
      "score": 6
    },
    {
      "id": "mcwdu0p",
      "body": "I was once on a site where people were navel gazing about their minor problems. It was a site a forum of very wealthy people. They started posting about their therapists and on a site where people were navel gazing about their minor problems. It was a site, a forum of very wealthy people. They started posting about their therapist and using a bunch of pseudoscientific buzz words from Pop psychology to brag about their minor pain. So I wrote three words stop being fake. You can imagine how well that went over. ",
      "created_utc": 1739626972.0,
      "score": 3
    },
    {
      "id": "mcbozlt",
      "body": "You should go in the woods at night it's calming but terrifying at the same time it's cool",
      "created_utc": 1739340650.0,
      "score": 4
    },
    {
      "id": "md76kxj",
      "body": "mmhmm. agreed. also, i get annoyed when people say \"it could be worse\" when i'm feeling low.",
      "created_utc": 1739767576.0,
      "score": 4
    },
    {
      "id": "mcbbeyv",
      "body": "Thanks for this ",
      "created_utc": 1739334353.0,
      "score": 2
    },
    {
      "id": "mc0fehl",
      "body": "IFS therapy is wonderful.  There are lots of videos online and some good books too by Richard Schwartz",
      "created_utc": 1739194026.0,
      "score": 3
    },
    {
      "id": "mc4co2s",
      "body": "Cute icon 💜",
      "created_utc": 1739243228.0,
      "score": 2
    },
    {
      "id": "mcld8bt",
      "body": "Been thinking about this myself",
      "created_utc": 1739471781.0,
      "score": 2
    },
    {
      "id": "mc4cy3p",
      "body": "Thanks ❤️",
      "created_utc": 1739243323.0,
      "score": 2
    }
  ]
}