{
  "id": "1iz69zl",
  "title": "You were wrong. It doesn’t get better.",
  "selftext": "Fuck you. All of you who say that sentence. I wish I could saw you in half just so you feel how your words made me feel. ",
  "created_utc": 1740626399.0,
  "score": 706,
  "num_comments": 107,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1iz69zl/you_were_wrong_it_doesnt_get_better/",
  "comments": [
    {
      "id": "mf0rvkd",
      "body": "I just love how there’s an alarming rate of suicide and it’s horrifying they still push these same tactics and platitudes that clearly aren’t working. What’s worse is people who overcame it will preach it like some former cult member. If life worked in such a simple way then the rate would be going way down. Suicidal people just shouldn’t be treated like pariah or oversensitive. They are constantly dismissed, overlooked and ultimately treated with stigma rather than given real solutions and guidance. Most just end up medicated and ostracized for an attempt. I think if we treated it less like criminal behavior then maybe, idk.. maybe if they felt less stigma in general would help. \n\nSuicide is sad and uneasy to deal with no matter how you look at it but denying what someone is going through by these phrases is exhausting. How can someone say this so casually as if its helping smh. The best one “you’re not alone” when this is often the reason behind someone’s suicide.",
      "created_utc": 1740632222.0,
      "score": 229
    },
    {
      "id": "mf14293",
      "body": "Everyone says it gets better with time. It's been 5 years now I've been suicidal and it just doesn't happen. If anything then it just gets worse with time",
      "created_utc": 1740638110.0,
      "score": 67
    },
    {
      "id": "mf0f7or",
      "body": "So true. People have been telling that to me for years and it only got 10 times worse",
      "created_utc": 1740627168.0,
      "score": 148
    },
    {
      "id": "mf1dzqp",
      "body": "4 years of feeling suicidal and nothing pisses me off more than seeing it gets better or some other variation of that bullshit. Id genuinely go apeshit shouting at someone if they’ve said it to me in real life",
      "created_utc": 1740643868.0,
      "score": 34
    },
    {
      "id": "mf0t1tk",
      "body": "This, fuck it I wanna dip",
      "created_utc": 1740632733.0,
      "score": 32
    },
    {
      "id": "mf10xsf",
      "body": "LOL \"it gets better\" is right up there with \"how you doin?\" said to someone as you continue walking. Also, \"Ah! Whadaya gonna do!\" I genuinely & strongly prefer to talk to chatgpt about my problems!",
      "created_utc": 1740636465.0,
      "score": 28
    },
    {
      "id": "mf25zxk",
      "body": "Every year its just getting worse, its always a decline.",
      "created_utc": 1740659627.0,
      "score": 14
    },
    {
      "id": "mf15pi8",
      "body": "I agree; fuck everyone who said that shit. It doesn’t get better. It’s a stupid lie",
      "created_utc": 1740639010.0,
      "score": 26
    },
    {
      "id": "mf1g991",
      "body": "yes, i would never say it gets better.  i would say there is a chance it gets better, because that is only logical, but to say it gets better definitively is a dangerous promise that doesn't always come to fruition.",
      "created_utc": 1740645285.0,
      "score": 9
    },
    {
      "id": "mf15tbq",
      "body": "It didn’t get better. I made it better. It wasn’t passive, it didn’t just “happen”. I did hard things, really hard things. I would never say “it gets better” to anyone because that’s not true. I fully understand that it could have become worse. It still could even though today is okay.",
      "created_utc": 1740639070.0,
      "score": 40
    },
    {
      "id": "mf1cbj5",
      "body": "I can’t tell you anything personally, but from my experience, it gets much worse before it gets better but I’m still here if that says anything",
      "created_utc": 1740642852.0,
      "score": 7
    },
    {
      "id": "mf1ieo5",
      "body": "agreed. while for some people it will get better i’ve never used the phrase to comfort someone because it’s not a promise i can keep for them, it’s not something i can guarantee, empty promises are not the way to help those of us struggling with suicide. it just builds up resentment towards those who tried to help & comfort you.",
      "created_utc": 1740646656.0,
      "score": 7
    },
    {
      "id": "mf1tay0",
      "body": "I think they just dont know what else to say, because they too dont know how to help us",
      "created_utc": 1740653325.0,
      "score": 5
    },
    {
      "id": "mf1wrzr",
      "body": "i tried to prevent it getting worse when it was mundane by offing myself. got found out. a yr later my life is indeed Worse! :D",
      "created_utc": 1740655279.0,
      "score": 4
    },
    {
      "id": "mf2fcuc",
      "body": "i fully agree",
      "created_utc": 1740663298.0,
      "score": 4
    },
    {
      "id": "mf373at",
      "body": "Nope sometimes it feels like it will and then something happens and it doesn’t! Usually over sensitive people (guilty of that) can’t really recover. Been like this for about 15 years, at first it was anger throughout the earlier years then as I got older I swallowed my anger and the build up turned into mostly sadness and fear and it’s persistently been like that! Those 2 emotions run/ruin the show of my life",
      "created_utc": 1740672157.0,
      "score": 3
    },
    {
      "id": "mf3kc0x",
      "body": "Atp death is just the greatest mercy",
      "created_utc": 1740675917.0,
      "score": 4
    },
    {
      "id": "mf5t4an",
      "body": "Even when you've tried everything and nothing works people will still lie to you that it gets better because they don't wanna be sad when you go. At this point I don't even care, I just want the torture to end.",
      "created_utc": 1740699354.0,
      "score": 3
    },
    {
      "id": "mf6mwah",
      "body": "I've been suicidal and depressed my whole life. It doesn't get better truly. Each year my brain gets number and number and it feels like I'm becoming resistant to happiness or joy. Like the things I once thought or barely even dreamed of doing, those things feel like nothing.",
      "created_utc": 1740709467.0,
      "score": 3
    },
    {
      "id": "mf4htc1",
      "body": "It got to a limit that nothing makes me think that I will get better ... I should be convincing you that something will change and eventually be better for you, but I'm here cursing my own life telling me over Reddit that things won't change and there's no chances for me :(",
      "created_utc": 1740685371.0,
      "score": 3
    },
    {
      "id": "mf5qhl0",
      "body": "have to agree with you, it never got better, only going downhill from here on",
      "created_utc": 1740698478.0,
      "score": 3
    },
    {
      "id": "mf60m9a",
      "body": "It never gets better unless you get lucky.",
      "created_utc": 1740701832.0,
      "score": 3
    },
    {
      "id": "mf6pw16",
      "body": "It definitely does NOT get better",
      "created_utc": 1740710526.0,
      "score": 3
    },
    {
      "id": "mf7yncc",
      "body": "It never gets better and the \"happiness\" I get is temporary. Material things fade away, people leave, distractions don't last, and at the end of the day I am still miserable, and the cycle repeats.",
      "created_utc": 1740731088.0,
      "score": 3
    },
    {
      "id": "mf17xyl",
      "body": "Cheers to that. I hope my former friend rots in hell too. Deceit to those that think us close is the most sinful of all. I’d even go to hell with him if it meant he got what he deserves for using me.",
      "created_utc": 1740640256.0,
      "score": 4
    },
    {
      "id": "mf3asqp",
      "body": "It wont , you just get used to it so it feels like it got better but it didnt",
      "created_utc": 1740673225.0,
      "score": 2
    },
    {
      "id": "mf3c0im",
      "body": "My mother would always tell me to put my big girl pants on or something else insensitive like “brush it off”.  Always fkn pissed me tf off",
      "created_utc": 1740673568.0,
      "score": 2
    },
    {
      "id": "mf5ifo0",
      "body": "Exactly it never gets better they just don't have anything else to say",
      "created_utc": 1740695912.0,
      "score": 2
    },
    {
      "id": "mf5qbmr",
      "body": "When you been treated like garbage by people who “help “you, then they screw you financially to the point where you’re homeless and living out your car? The whole phrase “ it gets better” or “ you’re not alone “ becomes a lie! If I’m not alone then why don’t I have any friends in this small town I live in? And the question to differ “ it gets better?” Ya lol I’m STILL homeless and on days like this, no absolutely no money….then it’s hard for words like “you’re not alone” to be taken seriously.",
      "created_utc": 1740698424.0,
      "score": 2
    },
    {
      "id": "mf6l532",
      "body": "it doesnt just get better on its own. its gonna take changing your life in ways like cutting people out, not being a people pleaser, or figuring out what ever else is making ur life shit and attempting to find a solution other than suicide. it doesnt just get better over time. it can get better with work though.",
      "created_utc": 1740708849.0,
      "score": 2
    },
    {
      "id": "mff7vkw",
      "body": "i feel you. 4 years! 4 years i’ve been trying and yea maybe it gets a little better for what? a few weeks and then something shitty happens and i’m worse again.",
      "created_utc": 1740832885.0,
      "score": 2
    },
    {
      "id": "mf4if7o",
      "body": "We have to make it better. But that shits really hard. And some folks can't do it. And that not to shame them.\n\nI live what many would consider a nice life and yet.. still have the ideation. I dont tell people who haven't gone through it because they just ask why or give me some of the same things OP was frustrated with. Or they treat me differently. \n \nI don't really have much to complain about. I'm technically fine.\n\nSuicide is deeply personal. It's extremely difficult to deal with or understand. It's also, at times, irrational. (Again, I'm not trying to mock anyone)\n\nI still think most don't want to die. They just want to not be suffering. To feel peace, to be loved, and understood.",
      "created_utc": 1740685540.0,
      "score": 2
    },
    {
      "id": "mf4q76v",
      "body": "Let's make a group on WPP and help each other",
      "created_utc": 1740687748.0,
      "score": 1
    },
    {
      "id": "mf5ph9t",
      "body": "People forget saying it only gets better if YOU want it. For example I don't even want to get better. I'm way too into my own illness, my own misery. It's the only feeling I've known my whole life. I feel comfortable with it. Loneliness is my friend now.\nIt used to hurt before it got numb and stayed that way.\nSure many people want to get better but again it's only up to you. And many people in depression don't have that energy.",
      "created_utc": 1740698147.0,
      "score": 1
    },
    {
      "id": "mg18dhq",
      "body": "I agree, op.  It doesn't get better for most of us.",
      "created_utc": 1741123733.0,
      "score": 1
    },
    {
      "id": "mf0x4mn",
      "body": "[deleted]",
      "created_utc": 1740634594.0,
      "score": -2
    },
    {
      "id": "mf0oami",
      "body": "[deleted]",
      "created_utc": 1740630709.0,
      "score": -14
    },
    {
      "id": "mf3alvi",
      "body": "I say the same word even tho I… I mean, not like I don’t have thoughts nowadays but I got better\n\nI just kept convincing myself until I convinced myself, idk\n\nBut now I am just someone who find no purpose in life yet no reason to die",
      "created_utc": 1740673170.0,
      "score": 0
    },
    {
      "id": "mf1ghjz",
      "body": "Look. Life sucks I know. My life has been in ruins for about 7 years now. I had wanted to give up too. But what I found out was that you can always stay happy with the little things in life eve though life doesn't get better as a whole. One more thing, to make life better, you need to work for it.\n\nMaybe the solution you are thinking isn't working out, try another one. I never had anyone to tell me \"Everything would get better\", everyone around me tells me that my life would never change and I'll stay where I am. It might be true and it made me very frail and suicidal for some years of my life, but what keeps me going right now is that I am hell bent on proving them wrong. Try to prove life wrong you know. Life would appreciate that.\n\nEveryone's life isn't the same and 'better' is very subjective. You dont have to look at others' lives and feel miserable that your life isn't like that. Your life can be better in different ways. You can always do what you love to you know? There are a lot of opportunities in this world. Doing what you love makes your life 10 times better.\n\nI'd never say 'Everything would get better\" to anyone because it doesn't unless you yourself work towards making it better. And you can't tell me that life doesn't get better even if you are working hard to make it better.\n\nIf you want to talk, there are always people there who want to listen. Maybe talk to me if you can't find anyone to talk to. I'll gladly listen. Maybe I or anyone won't be able to solve your problems, but talking alone lets a lot of frustration out.",
      "created_utc": 1740645431.0,
      "score": -7
    },
    {
      "id": "mf16vmf",
      "body": "How old are you?",
      "created_utc": 1740639651.0,
      "score": -16
    },
    {
      "id": "mf1arb7",
      "body": "it does tho… i have tried to kms so many times. sh, drug abuse, reckless driving, etc are what led me to talk to my coworker. she got me to confess in gay, at jesting\n\nedit: forgot to put the important part in. so with my current list of meds i feel pretty good. a lot better than i had been. i know it’s cliche af and whenever i hear it, even now it still annoys tf outta me. but anything can happen, maybe you will find something that motivate you and brings you joy. just oleaebv praij",
      "created_utc": 1740641916.0,
      "score": -12
    },
    {
      "id": "mf4uy8k",
      "body": "Live out of defiance.  The world is saying fuck you so I put my middle finger up and keep living out of spite.  Fuck them.",
      "created_utc": 1740689103.0,
      "score": -5
    },
    {
      "id": "mf3uf3d",
      "body": "I hate when people say “youre not alone” or “you’re so loved” like no. You don’t know me. Youre never there for me. I am alone & unloved.",
      "created_utc": 1740678745.0,
      "score": 83
    },
    {
      "id": "mf29kki",
      "body": "\"What’s worse is people who overcame it will preach it like some former cult member.\" \n\n\nTHANK YOU, finally someone said it. This phrase makes me always feel more bad cause it's like I choose to stay like this when I tried everything to get better and nothing changed or I got worse.",
      "created_utc": 1740661085.0,
      "score": 67
    },
    {
      "id": "mf4ij3d",
      "body": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡐⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠄⠴⠄⠄⠂⠰⠠⠰⠄⠤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⠠⢘⠀⣱⢀⠀⠢⠨⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⡀⢀⠠⠀⢄⠠⠀⠂⠈⠄⡈⠀⢐⠀⡁⠂⢐⠐⠀⠄⠤⢀⠄⢠⠀⡀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠱⡀⣑⠑⠤⠢⠀⠄⢂⠨⢂⠄⢅⠸⢀⡂⣡⠀⡆⠂⠄⠡⠘⢄⠅⠎⠘⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠈⠂⠀⠀⠃⠘⠰⠨⢂⠡⠢⠈⠂⠐⠀⠀⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠁⢄⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠂⠢⠀⢁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠀⠈⠄⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⢀⠀⢐⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠔⡈⠒⡐⡀⠠⠂⢕⠘⡐⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠂⠈⠀⠀⠰⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
      "created_utc": 1740685571.0,
      "score": 5
    },
    {
      "id": "mf4c37y",
      "body": "[removed]",
      "created_utc": 1740683753.0,
      "score": 5
    },
    {
      "id": "mgmwnkd",
      "body": "truth!",
      "created_utc": 1741408985.0,
      "score": 1
    },
    {
      "id": "mf1w3x4",
      "body": "I feel you, but do you want it to get better?",
      "created_utc": 1740654914.0,
      "score": -21
    },
    {
      "id": "mf18dbj",
      "body": "And it's get even worse the more i live.",
      "created_utc": 1740640505.0,
      "score": 46
    },
    {
      "id": "mfvk79u",
      "body": "Ahhh nailed it! It's not even a genuine encouragement, it's a dismissal!",
      "created_utc": 1741047768.0,
      "score": 2
    },
    {
      "id": "mf6p7cv",
      "body": "But there’s only so much a person can do and a person can handle. Some illnesses are incurable, some types of traumas ruin lives. Of course we decide how to deal with things like these, but I think it’s perfectly human to get suicidal about things like these. Some illnesses that you used to die from 50 years ago are now manageable but incurable. How do we expect people to not get depressed about having illnesses like that? Normally, we would’ve just passed away as the illness would’ve ran it’s course",
      "created_utc": 1740710283.0,
      "score": 12
    },
    {
      "id": "mf3z9a1",
      "body": "This got me thinking on how personalized suicide is. There is not a one size fits all solution, everyone recognizes that. Despite knowing this, platitudes and cliches OP mentions are still thrown out as if it is helpful for everyone. Too general and it simply doesn’t apply to everyone or it’s just not personalized enough for anyone to take action on. It’s a rough situation to be in, and u can’t just plug in the holes with empty words",
      "created_utc": 1740680121.0,
      "score": 7
    },
    {
      "id": "mf6q37n",
      "body": "Same. I sat down today and realised I haven’t laughed in months. The worst is when you realise that you’ve no goals, that there’s no things left for you that you want to experience, nothing to look forward to. Basically nothing to stay alive for",
      "created_utc": 1740710595.0,
      "score": 2
    },
    {
      "id": "mfvml3v",
      "body": "I can't agree. I worked my ass off finishing 2 honors programs in uni just to end up so poor I was homeless last year and about to be again. I walk to work on an empty stomach, eating foods I like is a privilege I can't have, I've lost all my friends because I can't keep up with them going out for fun stuff, I wanted to apply to go back to school for a scholarship and couldn't even afford the application fees. I've applied to 100s of job, no hyperbole or exaggeration. I'm a total fucking failure and a loser despite working my fucking ass off to survive capitalism. All I have to show for it is isolation, hunger, and completely crushed dreams.",
      "created_utc": 1741048546.0,
      "score": 2
    },
    {
      "id": "mf1p59f",
      "body": "Doubling down on doing something they clearly hate is supremely unhelpful",
      "created_utc": 1740650857.0,
      "score": 4
    },
    {
      "id": "mf0sttc",
      "body": "[removed]",
      "created_utc": 1740632636.0,
      "score": 28
    },
    {
      "id": "mf0tb0t",
      "body": "People say this to make THEMSELVES feel better, not the person who is hurting. They want to pat themselves on the back for doing a good deed that means fuck all irl.",
      "created_utc": 1740632846.0,
      "score": 28
    },
    {
      "id": "mf1p0y6",
      "body": "Someone can in fact be blamed for doing something unhelpful",
      "created_utc": 1740650785.0,
      "score": 7
    },
    {
      "id": "mf4nnqb",
      "body": "https://www.reddit.com/r/SuicideWatch/s/41lVAvokmk",
      "created_utc": 1740687021.0,
      "score": 2
    },
    {
      "id": "mf2zf6n",
      "body": "And tell me, isn't lying also a negative thing to say? ",
      "created_utc": 1740669929.0,
      "score": 3
    },
    {
      "id": "mf6b2yx",
      "body": "You're the exact person this post is talking about\n\"You sound straight out of a cult\"",
      "created_utc": 1740705342.0,
      "score": 8
    },
    {
      "id": "mg18i62",
      "body": "Exactly.  A lot of us are alone and a lot of us have noone who loves us.",
      "created_utc": 1741123770.0,
      "score": 7
    },
    {
      "id": "mf6o9bz",
      "body": "Exactly. Of course it got better for them because otherwise they wouldn’t be here. The people for who it didn’t get better, they’re not here to tell the story obviously. Also, I’ve experienced depression two times now and this time I don’t feel like speaking up about it because of how it was handled the first time. I believe some people that seem to be “cured” of their depression are just simply better at hiding it than before",
      "created_utc": 1740709948.0,
      "score": 7
    },
    {
      "id": "mf64sj1",
      "body": "Make a good plan and execute. But don't ask People to decide to youself. Its a waste of time.",
      "created_utc": 1740703214.0,
      "score": 3
    },
    {
      "id": "mf7wt2p",
      "body": "hm But what if I'm so egotistical that I'm patient only with myself, and nobody else. Most times, even with small things, I don't want to help my family or any other people if I dont care and if I care enough to start, it feels like I MUST do it now or else Im a selfish person. but i feel scared of consciousness of not helping, ashsmed, butthurt, guilty, or feel pity for someone if I don't so I still tolerate people.",
      "created_utc": 1740729966.0,
      "score": 2
    },
    {
      "id": "mf2lr7n",
      "body": "I did but after 4 years of constantly trying to fix it I just gave up. It's just not worth it anymore, I'm so touch starved and would do anything to just hug someone.",
      "created_utc": 1740665553.0,
      "score": 26
    },
    {
      "id": "mf6oo67",
      "body": "Nobody wants to get worse. And at first, you’ll try to get better, but after years of trying and of life throwing more shit your way, you give up. And then, as a cherry on top, there’s people like you, who will judge you for not wanting to get better, as if you haven’t tried for years",
      "created_utc": 1740710093.0,
      "score": 6
    },
    {
      "id": "mfz74eh",
      "body": "Of course that everyone wants to get better. But when you constantly try and work hard and it doesn't, you just give up at some point ",
      "created_utc": 1741103458.0,
      "score": 3
    },
    {
      "id": "mf198up",
      "body": "Exactly I really wish that I had died a long time ago",
      "created_utc": 1740641016.0,
      "score": 28
    },
    {
      "id": "mf6shj0",
      "body": "I agree. I have a stupid chronic illness too. My life will never be what I wanted it to be—what it should have been. I was actually trying to agree with the poster. It doesn't get better. You can accept or adjust. but to me, that's not \"better\". Some things like toxic relationships and abuse and debt can get better, but it's tough to get out.   \n  \nAnd sometimes, even if you work hard to make your life empirically \"better,\" it doesn't \\*feel\\* any better. So for me it's a day-by-day thing. Don't do anything drastic; just try and wait for the pain to pass.",
      "created_utc": 1740711450.0,
      "score": 7
    },
    {
      "id": "mfzqlx9",
      "body": "Oh I didn't mean it about life and accomplishments. It was only about the depression part. Depression and self harm thoughts are curable with enough will, which I don't have.\nYeah I agree sometimes whatever you do it does not work. I haven't even bothered to work my ass ofd because I don't have that energy.",
      "created_utc": 1741108819.0,
      "score": 1
    },
    {
      "id": "mf0unsl",
      "body": "[deleted]",
      "created_utc": 1740633448.0,
      "score": -7
    },
    {
      "id": "mf845ly",
      "body": "Hi. I couldn't stop thinking about what you said you know. I don't really understand what you mean but I guess I understand that my comment kind of feels wrong and cold in the situation. Do you think I should delete it? I never meant it to be cold. I just wanted to help op.",
      "created_utc": 1740734580.0,
      "score": 1
    },
    {
      "id": "mfz6hs1",
      "body": "Exactly! I just realized that no one can actually help you, they all just say things that they think you want to hear! It doesn't get better! You just go numb and used to it. And this comes from someone who is depressed for the past 15 years, and attempted once.. ",
      "created_utc": 1741103282.0,
      "score": 2
    },
    {
      "id": "mf9dzis",
      "body": "[removed]",
      "created_utc": 1740754890.0,
      "score": 1
    },
    {
      "id": "mf1h6zr",
      "body": "Same, I don’t why I’m still here I just want to go .",
      "created_utc": 1740645880.0,
      "score": 19
    },
    {
      "id": "mf6ykds",
      "body": "I relate very much to this myself and my chronic illness turned out to be caused my medical neglect by my doctors, parents and partly myself. No divine intervention or anything, just pure stupidity. How to get over that? You don’t. Indeed, you accept or adjust and after 5 years of trying I feel like I won’t ever accept this and would rather die. The wasted potential though of what could’ve been. I just can’t. It eats at me and it makes me physically sick, to the point of throwing up. I see all my dreams and ambitions for the future slipping away and I’m only 22. I don’t know about you but my illness is in fact progressive, it won’t get better it can only get worse. The realisation that this is the healthiest I’ll ever be and I’m miserable takes me out. People tell me to be happy because “it might get worse in the future and you’ll regret not enjoying right now” makes me wanna off myself right now.",
      "created_utc": 1740713656.0,
      "score": 3
    },
    {
      "id": "mf4mkiy",
      "body": "Total BS. Postivity and mindset mean nothing. You can be postitve as hell and still be fucked. I faked it for a whole 2 years and guess what! Everything sucks and gets worse lmao.",
      "created_utc": 1740686711.0,
      "score": 8
    },
    {
      "id": "mi3bvaa",
      "body": "Thanks for answering. It made me think more clearly",
      "created_utc": 1742135420.0,
      "score": 2
    },
    {
      "id": "mf1ml14",
      "body": "I don't even get angry anymore just pure disappoinment",
      "created_utc": 1740649279.0,
      "score": 15
    },
    {
      "id": "mfevlxi",
      "body": "I read your post history. You are dealing with such a shit hand. Like, the absolute worst. I'm so deeply sorry, and I can completely understand your position. I know there is nothing meaningful I can say or do to help, but you are seen, and you are heard. The worst is when you are intelligent with drive and potential, and you have to \"sit life out\" because you can't do normal physical things safely and with energy. You are obviously not someone who would be satisfied with anything less, and I think it's unfair to expect yourself to accept less (I know, I feel it too).  No amount of \"practicing gratitude and acceptance\" will ever help, will ever not seem contrived. If my body worked, I swear I could have taken over the world.",
      "created_utc": 1740825919.0,
      "score": 2
    },
    {
      "id": "mf1ppsm",
      "body": "Samee , let’s not forget the sad face all the time 😔",
      "created_utc": 1740651197.0,
      "score": 7
    }
  ]
}