{
  "id": "1g5jueq",
  "title": "Teen daughter tried to commit suicide. Found her suicide note today",
  "selftext": "Throwaway account.  Daughter(14) tried to commit suicide Sunday night by taking a lethal dose of Tylenol and Advil.  Luckily school has been hitting the suicide hot line pretty hard with the students and she texted them before and after taking the pills.  They were able to convince her to give up our address.  Wife and I were home and had no idea until a frantic police man came up to the door.  Long story short, she survived with no permanent damage.  She started inpatient care yesterday.  We went thru her phone and the texts to the hot line indicate she has been having these feelings for two years.  We started going thru her room today and found her note.  It was addressed to her best friend and didn't even mention my wife and I.  That was a gut punch.  This was so out of the blue.  She is such a great kid.  Fantastic grades, lots of friends, very well liked at school, and highly empathetic towards others.  In her texts to the hot line, she was guilt ridden on how good her life was.  She couldn't understand why her life was so good when many others around her struggle with single parents, bad parents, poor, etc while she seems to have it all.  This is tearing me up.  We meet with the social worker tomorrow.  I assume family sessions will occur at some point.  She is on fall break this week, so her absence from school won't be noticed, but if she is out when school starts back up next week it is going to be harder and harder to explain.  I want her to stay as long as needed inpatient, but I'm scared how cruel teenagers can be if it gets out at school.  How do you manage all of this?",
  "created_utc": 1729143561.0,
  "score": 790,
  "num_comments": 58,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1g5jueq/teen_daughter_tried_to_commit_suicide_found_her/",
  "comments": [
    {
      "id": "lsbo2an",
      "body": "What a nice parent. Thanks for not berating her like my Nmom do.\n\nKeep it strong, tides will turn and she will be alright soon.\n\nWhat you do is right, sorry, I'm not a parent, I probably won't have any advice but to say years down the road, she will look back and appreciate for what you and your wife have done. \n\nI've met a few teenager whom have open mind towards mental health, so it is all good. But can't say for all, you have both good and bad in a crop.",
      "created_utc": 1729144747.0,
      "score": 332
    },
    {
      "id": "lsbt2gq",
      "body": "I'm 26 now, but I did the exact same thing in middle school (at age 13ish). I wrote a note (mainly to express my feelings to myself and i didnt think of it much like a letter to my family/friends) and took a bunch of Tylenol and some other random pills. Maybe 20-30 in total. I ended up just vomiting them up in the middle of the night. \n\nMy parents heard the noise, woke up, and came to the door of the locked bathroom I was in. They asked through the door what was up, I said ah i just feel sick, and they said ok and went back to bed. To this day, I have never spoken of that night with them. Actually, to think of it, ive never talked about anything mental health-wise with them at all.\n\nAt the time I was relieved that I didn't need to explain anything else or get \"found out\", but honestly my mental health never really got better. I now wish that my parents had investigated a bit more and looked a bit closer at my wrists and at the empty blister packs and pill bottles. Maybe I would have gotten the help I needed/need. I'm glad you're taking it seriously and are there for your child. They'll thank you later.",
      "created_utc": 1729147915.0,
      "score": 236
    },
    {
      "id": "lsbs835",
      "body": "The friends might be supportive. When I was in high school and my friend got back from inpatient, I was so happy she was still here",
      "created_utc": 1729147374.0,
      "score": 135
    },
    {
      "id": "lsbt8xv",
      "body": "[removed]",
      "created_utc": 1729148032.0,
      "score": 55
    },
    {
      "id": "lsc46m8",
      "body": "Chances are she didn’t want to face leaving you guys behind. I had a plan, wrote a note to every one of my friends, but not to my parents because the thought of it made me sick. I had attempted the night before and was unsuccessful so I had planned something more drastic during my lunch period. Thankfully my parents found the note and called the school. A police officer talked to me and I lied and said I didn’t have a plan and the note was from over a year before that, but that whole interaction made me think and I decided not to do it. \n\nPoint is, as much as it might have seemed like she just didn’t care enough to give yall closure, she most likely didn’t want to face leaving you guys behind. You guys are obviously loving parents. Parents I wish I would’ve been gifted with. She loves you too much to face letting go.",
      "created_utc": 1729155643.0,
      "score": 40
    },
    {
      "id": "lsc75y0",
      "body": "First things first. You are right that other kids might not understand or be sympathetic, but that's really not that important at the moment. Focus on getting them better now and in the long term. It seems like you are already doing a good job overall, so good job on you because this is such a difficult situation. I would encourage you to try and deal with these kind of worries (what will others think and say and do) and kinda get them out of the way so that you can focus on what really matters. Because other peoples opinion on all of this doesn't matter. It might have an impact yes, but it does not matter. There's this stigma on mental health and if you let these kind of worries be too present, you are perpetuating the stigma. Also: lots of grownups are not understanding either, it's not really an age thing, I find kids to be maybe more ruthless in treating others but also waaay less judgemental, so if you're worried about that I think there are other corners judgement and a lack of sympathy might be coming your way. But the same still applies: never ever let these kind of things take center stage. Your kid already has shown to be impacted by the stigma around mental health, they already judge themselves for being unwell, so don't add to it by putting any kind of significance on whatever people might think of this situation. I know this is easier said than done, but I think it's really important if you want to be a safe person in all of this.",
      "created_utc": 1729157750.0,
      "score": 13
    },
    {
      "id": "lsboulu",
      "body": "I managed it by transferring to a new school. But to be fair, I didn’t have a choice because the administration decided to kick me out for it since they knew a student suicide would wreck their reputation and then they would lose tuition money.",
      "created_utc": 1729145232.0,
      "score": 22
    },
    {
      "id": "lsc6sdi",
      "body": "At 15 I ended up going to a hospital for an attempt and (granted I was just kept there overnight and for the next day and when I said I wouldn't do it again they sent me home) my friends knew because it was mid-week and nobody was cruel about it. There was a bit of tension then one of them cracked a joke about it and it was like things went back to normal (in a good way). I didn't leave a note for my parents because that time was a spontaneous decision but I had written a note that my parents found when I was 13 and in classic teenage fashion I got really embarrassed about it above anything else.\n\nI receieved weekly therapy for a while that stopped abruptly because of covid. At 17 I was going to try again and had been making a plan but then my mom suddenly got a kitten and I ended up deciding i'd stick around to take care of it. That kind of thing can't cure mental illness but it did give me a vague feeling of purpose that still holds up today. I also ended up getting the help I needed the year after that compared to the generic therapy i'd received before so it can be worth making sure there isn't an underlying cause that's not just depression.",
      "created_utc": 1729157485.0,
      "score": 11
    },
    {
      "id": "lscmlfy",
      "body": "> We started going thru her room today and found her note. It was addressed to her best friend and didn't even mention my wife and I.\n\nif it makes you feel a little better, i also did not write to my parents in my suicide note. my parents are wonderful people, but i didn't address my note to them. i wrote it to my best friend.\n\n> This was so out of the blue. She is such a great kid. Fantastic grades, lots of friends, very well liked at school, and highly empathetic towards others. [...]\n She couldn't understand why her life was so good when many others around her struggle with single parents, bad parents, poor, etc while she seems to have it all. \n\ni was in a similar situation as your daughter, when i was 14, and again at 18. depression is one hell of a struggle, and i'm glad she has supportive parents. a good support system is vital when dealing with these extreme emotions.\n\n> if she is out when school starts back up next week it is going to be harder and harder to explain.\n\nregarding to the absence from school, she could always say she was sick. her classmates don't really need to know. i hope she returns to school when she's ready to, because you're right, some teenagers are a bit rude to others.\n\ni hope your daughter and your family will get through this. do remember to take care of yourself aswell.",
      "created_utc": 1729166438.0,
      "score": 11
    },
    {
      "id": "lscmq47",
      "body": "Please check on her and make sure she's okay often. I'm 35M. When I was 11 I witnessed r\\*p\\* in an inpatient facility with two men & a 16 yr old & then I experienced SA a day later. I really didn't understand what I saw at the time though. Two men came out from a room and one had a needle and they pushed a black girl who was laughing at them into a room and slammed the door behind them, but they did it so hard it didn't latch and cracked open. That's when I saw pants get torn off and one of them got mad at one point and slammed the door shut and didn't come out for a long time. She woke up the next day complaining it hurt to pass stools (to put it sfw) and she didn't know why.  \n  \nI think it was happening to everyone there. After what happened to me I was told if I told anyone I would be cut up from head to toe and the person said he would tell the doctors I did it to myself and would have to stay in a place like that past the age of 18. \n\nSo yes just please make sure she's okay regularly. For all I know this was a very unusual situation. I've been told by a lot of psych nurses that they generally take male-female separation very seriously, but I guess in certain facilities predators infiltrate and I don't want to talk about it because it's upsetting. I just thought I would share bc your daughter seems like she really needs help & want her to get the care she deserves and needs <3 Thank you for being good parents. It's not your fault. Continue to be gentle and kind with her.",
      "created_utc": 1729166498.0,
      "score": 8
    },
    {
      "id": "lse372v",
      "body": "I’m not sure what she’s interested in, but it might be worth encouraging her to take up some charity work or volunteering in the future, as a way of feeling like she’s paying forward her good fortune. Sending her well wishes",
      "created_utc": 1729184750.0,
      "score": 3
    },
    {
      "id": "lsh002h",
      "body": "The family sessions are really important. also if you can afford it, get yourself and your wife therapy too. You can support her better if your going to be okay yourself. \n\nI firstly attempted at that age too (I´m doing pretty good now tbh) and i can give you list of what NOT to do more than a list of what to do. (Thanx to my mom ofc)\n\n  \n1 - don´t start going thru her stuff on regular basis, it can´t become a habit because it will absolutely demolish any trust or bonds and its gonna be invasive to her privacy  \n2 - don´t control her on walks, especially if ur gonna be taking her on weekend when shes gonna be in hospital. I mean - dont setup maximum distance she can be away from you, dont go thru her stuff and dont watch her like a police would  \n3 - dont EVER EVER EVER guilttrip, gaslight, dont EVER use it against her cuz that shit would break her heart in a milion pieces and don´t make it a your sob story, don t scream at her  \n4 - don´t make the situation about yourself (in front of her) before shes going to be more okay and stable  \n5 - don´t tell it to everyone! Like there is no need why her cousins uncles should know everything and every detail, same with your friends (that are not the close ones)\n\n  \nFrom how it sounded like, you don´t have to worry about this, but just in case. The long term pain, some trauma and just stuff like this can change you and your reactions, so be careful and take care of yourself too! Take breaks, practice mental hygiene, care for yourself physically! Again you have to be okay yourself to properly help her! And it was really traumatic event for you and your wife, so dont underestimate it.\n\nSending lots of love and energy. You can do this!",
      "created_utc": 1729221171.0,
      "score": 4
    },
    {
      "id": "lscxtle",
      "body": "This may seem like the worst scenario now - but I’m so glad you found out while she was 14. I’ve had suicidal ideation and severe depression since 15 (I’m 34 now) but because my family and life was so great, I felt immense guilt for feeling depressed because I “didn’t have a good reason” so I never spoke to anyone until I started hitting substances pretty hard in my twenties to cope. I think about it now and i could have saved myself a lot of damage if I just told someone earlier.\n\nEdit: as someone who has been in her shoes, please know this is not something you did. She likely didn’t want to tell you because she didn’t want you to think it was your fault. At least, that’s how I felt.",
      "created_utc": 1729171117.0,
      "score": 3
    },
    {
      "id": "lsd1275",
      "body": "I don't know if you want advice, but I found volunteering helps with the thoughts that she's having. Perhaps you could do a family or parent-child volunteer day?",
      "created_utc": 1729172322.0,
      "score": 3
    },
    {
      "id": "lsds44h",
      "body": "You guys are amazing parents and it hurts so much to read this judging by how well she is being treated by both of you. Please have a good talk with her stating various ways of emotional defensiveness. As her empathy rises through the sky she doesn’t realize she is more vulnerable to bad people. She needs to be taught how to deflect all negative people and their toxicity that comes through her path. Best of luck my heart is with you.",
      "created_utc": 1729181240.0,
      "score": 3
    },
    {
      "id": "lscms2y",
      "body": "Have a blood test done on her and check vitamins, get the results YOURSELF and check ferritin/iron especially. I had 10 in ferritin as a teenager, had it for more than 10 years and was in severe suicide risk the whole time. Doctors don't know how to check for this stuff, they don't care, my suicidal depression improved dramatically when I fixed my low iron that was due to sibo I later found out. Or check if she is on the autism spectrum or has adhd or something of the sort. I was a severely suicidal teenage girl, and they put me on meds back then, that made me insane and I still can't orgasm or feel romantic feelings towards people 10 years later and off the psych meds. I strongly recommend you do blood tests and see the numbers yourself, before blindly trusting doctors who want to push her on psych meds.",
      "created_utc": 1729166523.0,
      "score": 7
    },
    {
      "id": "lsccevt",
      "body": "Poor thing, hope things get better for you and her soon.",
      "created_utc": 1729161133.0,
      "score": 2
    },
    {
      "id": "lscsehk",
      "body": "I was 11 (sixth grade) when I had my first attempt. My mom had me hospitalized in the psych ward of a Catholic hospital with no children's unit for two months. I didn't speak to anyone before I attempted, I didn't leave a note, I didn't tell anyone anything that happened to me. I spent so much time away from school, I was afraid to go back and have kids ask me where I've been. \n\nI ended up transferring schools completely, and when I did, I made lifelong friends. I was able to (somewhat) return to normal and things got better for a little bit. I've always struggled with my mental health. \n\nOne thing I wish my mom did was just listen, hug me and tell me everything is going to be ok. What I was feeling was normal (considering the things I had been through at that age). Having that unconditional love and support is critical in situations like this. Take it day by day. Go with the flow. Be supportive and not judgemental. Emotions are very intense and different for kids, as they don't understand them and it's harder for them to process. She sounds like she has a lot of empathy and compassion for others, which is beautiful. Reminds me a lot of myself at that age. The world is a cruel, cold place, that's why people like your daughter are worth saving. We need people like that in this world. \n\nApproach the situation with love and understanding. Listen to her wants/needs. Work with the therapist/psychiatrist and form a plan that is best for your daughter. I hope everything works out for the best. Stay strong.",
      "created_utc": 1729168974.0,
      "score": 2
    },
    {
      "id": "lsdp3rb",
      "body": "having supportive family is half the battle, encourage her to find healthy outlets for how she feels - encourage her to get involved in activism maybe ? as someone who is overly empathetic and suffers from mental health issues / suicidal thoughts and ideations.. i find that giving back to my community has helped me immensely. i hope you all find the strength to navigate through this and get your girl to a better place.",
      "created_utc": 1729180294.0,
      "score": 2
    },
    {
      "id": "lsg660w",
      "body": "I'm not a parent, but I know how your kid feels, although I'm so far from having a good life, I was raised by my mom and maternal grandparents who loved me a lot but we're very poor in a struggling country, I'm disappointed by my own decisions regarding my future and a big etcetera, but still, I know my family loves me, I have a place to call home and I eat three meals a day and those simple facts eat me alive at night, because I know I don't deserve any of that and I find it extremely unfair that I get to live with safety and dignity while there's so many people out there living on the streets or alone without any food in the whole day, and I know there are kids working in terrible conditions (in my town there's kids working in fields) and I know there's elderly people being abused and there's thousand of people dying in Palestine and there are so many dogs and cats living and dying on the streets and when I think that I feel that I don't deserve to live I do nothing to deserve my life and I have no money nor power to change the injustices of my city alone and that makes me think of killing myself too. Now I don't have the answer to stop feeling that way since I too feel suicidal at times but I try help as much as I can and it does makes me feel a bit better for some time at least. I've rescued, fostered and re-homed 5 cats and 3 dogs I feed 7 stray cats from my street, and I give money to people on the streets when I see them and that does make me feel like I can do something useful as little as it may be. \nSo TLDR my advice would be take your kid to therapy because feeling that guilty is not healthy at all and the thought won't go alone and maybe talk to her about some cause she could help in her free time like working in a rescue group from the city or in a soup kitchen or maybe donating some money monthly to a cause. I know that would make me feel better (if it existed in my city). \nI also think talking more with your kid and going out together to just talk would be good too. \nI hope your kid feels better and I wish you luck.",
      "created_utc": 1729209759.0,
      "score": 2
    },
    {
      "id": "lsgai49",
      "body": "Hi, I was in a pretty similar spot at 16. I attempted and got hospitalized. I had been depressed since 13 but nobody knew. I was an A-B student, did activities, and seemed happy. In reality, I was breaking inside and only a select few people knew. \n\nI know this is scary. I know you’re worried and I can see you really care. It’s so terrible that it came to that point, but I am glad she’s getting help. Hospitalization started helping things turn around. i still struggled with heavy depression towards the beginning. but it is now significantly more manageable through my meds and therapy. \n\nThe rest of the school doesn’t need to know. Average place of inpatient while I was in the hospital was about 6 days, but it varies depending on how they’re doing while inpatient. i got out on a wednesday and went back the following monday. if she misses the first few days back, some people may check in. and she can choose if or what she wants to share. she could say she was sick with something if she wants to. \n\nAs for you and your wife, if you need to want support, therapy or support groups can be super helpful. I believe NAMI (national alliance on mental illness) has some support groups for family members. \n\nhaving social support is huge and i’m glad she has that from you guys and her friends. I wish her and you the best in terms of recovery <3",
      "created_utc": 1729211356.0,
      "score": 2
    },
    {
      "id": "lsgiqs3",
      "body": "Hey, I was in her exact position in freshman year. My answer would be, see if the school has an alternative program or something like that. They’re the kind of thing they send the kids with bad grades or mental health struggles to. It was really helpful and usually it minimizes the social impact because they can just say they were there. Tell her you love her, be there for her if she needs you, and stay strong <3",
      "created_utc": 1729214399.0,
      "score": 2
    },
    {
      "id": "lsh3fdi",
      "body": "Whatever you do, please do not send her to any kind of private youth residential facility. There are no good ones.",
      "created_utc": 1729222683.0,
      "score": 2
    },
    {
      "id": "lshf2m5",
      "body": "You might not have been mentioned because nothing you did was a problem. I wouldn't mention my parents in my note; both of them are kind people who took care of me and did their best. There's no reason to guilt or blame them for my own life.",
      "created_utc": 1729228654.0,
      "score": 2
    },
    {
      "id": "lscyzgt",
      "body": "It could be why do I have this and so many don't. Can't say that is the reason or only reason but hopefully you will have good communication and can help her deal with these issues in a way that works for her",
      "created_utc": 1729171551.0,
      "score": 1
    },
    {
      "id": "lsd4wmr",
      "body": " tell her that she can rest if she wants to. that it's okay if she has to redo a class or two. that she can stay home and rest as long as she wants to. a lot of teens don't know that they're allowed to take a break.",
      "created_utc": 1729173691.0,
      "score": 1
    },
    {
      "id": "lsdc7zo",
      "body": "You reacted so well to this, you must be great parents. She hid it really well for a reason, often when we are struggling with depression even though we have a good life, we feel like there is no reason for us to tell anyone. That's unfortunately how I was in high school. Now that you know, you can be a really good support for her. On the length of stay in inpatient, if she needs to stay past her school break, she should. Other classmates don't need to know the details unless she wants them to. Obviously get her straight into therapy that she can see regularly and make sure to tell her how much she means to you and your wife and make sure you reiterate that there is nothing shameful about anything she is going through.",
      "created_utc": 1729176170.0,
      "score": 1
    },
    {
      "id": "lsgdoly",
      "body": "Hi! Im 20 years old and have been in and out of hospitals all through out high school one thing I learned is to ease the transition that’s something very important so she doesn’t get too overwhelmed when going back but I say allow her a little time to stay home before going back to school \nI remember sophomore year I went right back to school almost immediately after my discharge and had a complete anxiety attack at school \nIt can be a lot to take in \nEven just being back home\nThose places if your unlucky enough they sometimes break you in a way \nPlease be understanding and just make sure she feels safe to come to you let her know you are her safe space make sure she knows you love her\nDefinitely take it easy on her \nSometimes you come back so medicated you feel numb and it can be hard to connect with people and family like before \nThis kind of stuff takes a toll on a child just as much the parent \nIdk if your an affectionate family \nBut some good hugs can do a lot <3",
      "created_utc": 1729212513.0,
      "score": 1
    },
    {
      "id": "lt2vj6h",
      "body": "As a teen who also, has urges to commit or attempt I’m sorry. I also am good at school, I in fact just got a positive referral today bc I was nice to the sub. I have good grades and it does NOT matter how happy we look or how well we are doing we are not okay. There are so many things that happen at school I don’t tell my parents cuz I don’t want them to worry about me. Maybe try checking in on her, ask if there’s anything going on at school that is bothering her. Another amazing thing my parents allow me to do since they know my mental state isn’t the best is they let me take mental health days. Ask her if she needs some sometimes. Sometimes it’s nice to have a break from all the stress. I wish her well and hope she’s alright <3 ",
      "created_utc": 1729548831.0,
      "score": 1
    },
    {
      "id": "m4hide8",
      "body": "i’m not much older than her. just be there for her. i’ve been in and out of the mental hospital for lots of things about 5 or 6 times now. my parents weren’t, neither until last november, which it was only my mom. take her out to eat at her favorite restaurant, talk to her about it when she’s ready. light her favorite candle or spray some of her favorite perfume on her bed so it smells familiar when she’s home. watch her from a distance, don’t be overbearing at first. have your wife or both of you sleep on her floor next to her bed and y’all get snacks to watch a movie. it’s gonna be okay",
      "created_utc": 1735539930.0,
      "score": 1
    },
    {
      "id": "lsccvp8",
      "body": "Ask her if she wants to change schools.\n\nConsider all the pros and cons with this decision.\n\nI am so sorry.\n\nConsider a flip phone instead of a smart phone with social media.",
      "created_utc": 1729161410.0,
      "score": -10
    },
    {
      "id": "lsd6s6x",
      "body": "It really sucks because I have a note labelled suicide note and really it's more addressed to my friends more than my parents because those are the only people that really stood by me when I had no one else( they're no longer friends) but yes I always wondered how my parents would feel if they were to find it one day.",
      "created_utc": 1729174344.0,
      "score": -2
    },
    {
      "id": "lsc8j7z",
      "body": "[removed]",
      "created_utc": 1729158687.0,
      "score": -17
    },
    {
      "id": "lsdo7op",
      "body": "Hugs. I hope you find your joy.",
      "created_utc": 1729180017.0,
      "score": 25
    },
    {
      "id": "lsd1nw8",
      "body": "If you’re not seeing a therapist, you should, 82d old account with a leaning toward depression and suicide subs. Please, for me, the random stranger on the internet who knows the world would be less without you.",
      "created_utc": 1729172543.0,
      "score": 58
    },
    {
      "id": "lsesd3z",
      "body": "Do you not have any contact with them to this day? I’m sorry you had to go through that alone. I’m here if you ever want to talk.",
      "created_utc": 1729192684.0,
      "score": 4
    },
    {
      "id": "lsbsi5l",
      "body": "Her close friends are great.  One already knows and has talked to her on the phone.  It is the rest of the school I'm worried about.",
      "created_utc": 1729147551.0,
      "score": 86
    },
    {
      "id": "lsbtioc",
      "body": "[removed]",
      "created_utc": 1729148210.0,
      "score": 29
    },
    {
      "id": "lsd9sj4",
      "body": "My wife and I have talked about that as one possible way to help her understand that being well off gives you the ability to help others in need so it doesn't have to be a bad thing.  Will bring that up with her doctors/therapist.",
      "created_utc": 1729175366.0,
      "score": 3
    },
    {
      "id": "lsdcy2a",
      "body": "Also I know high schoolers can be a little nosier, but I had an inpatient stay in college and almost no one asked me why I missed class except my closer friends. I think if people do ask and she doesn't want to share, she can say that it was for a medical thing and she doesn't really want to talk about it",
      "created_utc": 1729176408.0,
      "score": 1
    },
    {
      "id": "lsdtsh4",
      "body": "Such a disgusting toxic comment, please use your eyes and process whatever OP has stated in their post.",
      "created_utc": 1729181777.0,
      "score": 6
    },
    {
      "id": "lsbsliz",
      "body": "They don't have to know anything. She can tell them if she wants. If anything, say it was medical",
      "created_utc": 1729147611.0,
      "score": 78
    },
    {
      "id": "lsbwifs",
      "body": "She can just say she was sick in the hospital. She's not lying,  and it's really nobody's business unless she wants it to be. She doesn't owe anyone an explanation, and hopefully, any staff members that need to know will be understanding. I would talk to the school counselor first",
      "created_utc": 1729150221.0,
      "score": 69
    },
    {
      "id": "lsbu5vu",
      "body": "That sounds like a great first step in ensuring things go okay once she's ready to head back. Hopefully they provide you with the information you need and a good plan of action for keeping her experiences known only amongst family and any necessary staff so she doesn't have any trouble from classmates.",
      "created_utc": 1729148632.0,
      "score": 10
    },
    {
      "id": "lsbwp5z",
      "body": "That's an awesome first step! I just recommended reaching out to the school counselor in a different comment. Hopefully, they have some resources for you. The social worker probably will as well",
      "created_utc": 1729150350.0,
      "score": 11
    }
  ]
}