{
  "id": "1hs4uty",
  "title": "My sister walked in.",
  "selftext": "My sister walked in on me trying to take my own life. She kind of just stood there and stared at me. I stared back for a minute and my sister started saying how she knew this would happen because of the bad things I think about. I broke down and started crying in my sister's arms, and after I stopped crying she told me that she knew I was trying my best, and sometimes your best feels like your worst, she told me that she loved me and that she wanted to see me smile but some days that just isn't an option, Then she grabbed my arm and she took me outside to play in the snow and distract me, we made a snowman and god I'm so glad I got to make that damn ugly snowman. (Snowman melted though, it's unfortunate.)\n\nBut she shouldn't even know what it means to commit suicide, she's 11, and I'm 19. That is what truly hurt me, our parents educated her on suicide, what it means, and how to act if she ever sees somebody trying to kill themselves, they knew it would happen one day or another.",
  "created_utc": 1735852961.0,
  "score": 1043,
  "num_comments": 35,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1hs4uty/my_sister_walked_in/",
  "comments": [
    {
      "id": "m54344g",
      "body": "You have a wonderful sister who loves you very much.",
      "created_utc": 1735869236.0,
      "score": 263
    },
    {
      "id": "m53f0zk",
      "body": "Every time you're about to end your life or something, think of her. How much she loves you. I know that this is not the solution to put an end to your problems, but believe me, it can prevent the worst temporarily.",
      "created_utc": 1735861422.0,
      "score": 379
    },
    {
      "id": "m53v8w6",
      "body": "That’s so kind",
      "created_utc": 1735866545.0,
      "score": 67
    },
    {
      "id": "m549orh",
      "body": "You are needed here, as is she. You two are specially bonded.",
      "created_utc": 1735871575.0,
      "score": 107
    },
    {
      "id": "m54cydb",
      "body": "I’m so sorry, I hope you understand that she loves you, please don’t leave her.",
      "created_utc": 1735872731.0,
      "score": 55
    },
    {
      "id": "m55g7hs",
      "body": "> But she shouldn’t even know what it means to commit suicide, she’s 11, and I’m 19. That is what truly hurt me, our parents educated her on suicide, what it means, and how to act if she ever sees somebody trying to kill themselves, they knew it would happen one day or another.\n\nThat's likely not true. I'm a teacher and you'd be surprised by how thoughtful, sensitive and sympathetic we are as kids/pre-teens. We seem to lose that with time but most students I've had were great at dealing with situations such as this naturally, in ways adults would never, and without being instructed to. Trust me, I've dealt with lots of bad stuff and my students always surprise me.",
      "created_utc": 1735890584.0,
      "score": 42
    },
    {
      "id": "m55mi4e",
      "body": "My little sister was 7 when I was 20 and placed in the ICU from my attempt.  It was almost right after her birthday.  She couldn’t come in and see me because of COVID, but she had to be explained what happened and she knew.  She’s never looked at depression the same and is so scared of becoming suicidal.  I really hate to say it like this, but kids these days are having to grow up so quickly and it just makes me so sad.  She is so observant of her friends’ emotions and will tell my mom if she notices any signs.",
      "created_utc": 1735894552.0,
      "score": 16
    },
    {
      "id": "m55evns",
      "body": "I never ever say this-but her witnessing it, makes it meant to be. I don’t believe that “everything happens for a reason” but this sounds like kismet. She was meant to be there in a vulnerable, terrible time where she came in right when you needed her. You guys have a special bond. Don’t forget what you’d be leaving if you went away. She obviously looks up to you and loves you. You are very blessed. Sending hugs.",
      "created_utc": 1735889781.0,
      "score": 17
    },
    {
      "id": "m54ykv4",
      "body": "This is so beautiful I teared up",
      "created_utc": 1735881316.0,
      "score": 13
    },
    {
      "id": "m55fge9",
      "body": "Until you can find your reason to stay please let your sister be your reason for now. She loves you so much and she still needs you...maybe you stay for her at least for now",
      "created_utc": 1735890129.0,
      "score": 12
    },
    {
      "id": "m5731bn",
      "body": "[removed]",
      "created_utc": 1735919092.0,
      "score": 8
    },
    {
      "id": "m55xiuk",
      "body": "I know it’s meaningless, but I’m sorry for whatever you’re going through that’s brought you to this point at such a young age.",
      "created_utc": 1735901476.0,
      "score": 6
    },
    {
      "id": "m551dtj",
      "body": "It feels good to be loved. This reminds me ina way of the plot of the catcher in the rye. Great book to read if you're interested.",
      "created_utc": 1735882622.0,
      "score": 5
    },
    {
      "id": "m55r2f7",
      "body": "I started crying, when reading this, and am currently crying while writing this. Just know that. You are loved. Even though it doesn't feel like that. You have a good family😢❤️‍🔥❤️‍🔥",
      "created_utc": 1735897463.0,
      "score": 4
    },
    {
      "id": "m53gd3s",
      "body": "You're lucky to have her, I hope things will get better for you, please if you wanna talk I'll always be available.",
      "created_utc": 1735861854.0,
      "score": 2
    },
    {
      "id": "m5ig4k8",
      "body": "That’s funny my parents told me killing myself was retarded watched me attempt And only stopped me when they were convinced I’d go through with it",
      "created_utc": 1736079995.0,
      "score": 1
    },
    {
      "id": "m5rthup",
      "body": "I wish i had someone to help me like that",
      "created_utc": 1736201979.0,
      "score": 1
    },
    {
      "id": "m5vd6we",
      "body": "I feel the same way and a thing similar to that has happened which is the only reason I'm still here to this day.",
      "created_utc": 1736257918.0,
      "score": 1
    },
    {
      "id": "mc9brr2",
      "body": "She is your reason to stay. She looks up to you, you know.",
      "created_utc": 1739310479.0,
      "score": 1
    },
    {
      "id": "m55yhyd",
      "body": "You have a younger sister that loves you . Be an example of a good older brother and find motivation in caring for a younger sibling",
      "created_utc": 1735902059.0,
      "score": 1
    },
    {
      "id": "m57jc01",
      "body": "I unfortunately learned about it age 3.",
      "created_utc": 1735924074.0,
      "score": 6
    },
    {
      "id": "m6w7as9",
      "body": "Me too 😢",
      "created_utc": 1736758951.0,
      "score": 1
    },
    {
      "id": "m58hxih",
      "body": "Sometimes even small things like this can change your life",
      "created_utc": 1735934309.0,
      "score": 5
    },
    {
      "id": "m5ambk0",
      "body": "SMALL!?!??! This hits harder than nothing that could be measured in any metric system.",
      "created_utc": 1735959537.0,
      "score": 5
    }
  ]
}