{
  "id": "1g7pmci",
  "title": "“Suicide is a permanent solution to a temporary problem” 🙄",
  "selftext": "It’s bullshit when people say “suicide is a permanent solution to a temporary problem” the temporary problem being my whole life? I feel like I’m not even my own person; I was born for other people’s satisfaction and pleasure. Everyone just treats me like a dumb sack of meat, which I guess I am in a way.\n\nEdit: thank you to everyone that has commented, a few of youse have actually given me some sort of hope. I’m seeing my therapist in an hour and I’m going to tell her about my thoughts getting worse, I don’t think I’ll get the help I need though. ",
  "created_utc": 1729393989.0,
  "score": 505,
  "num_comments": 77,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1g7pmci/suicide_is_a_permanent_solution_to_a_temporary/",
  "comments": [
    {
      "id": "lsthmoa",
      "body": "Autism is very much my permanent problem.",
      "created_utc": 1729417050.0,
      "score": 115
    },
    {
      "id": "lssk95t",
      "body": "Yeah wtf is temporary about me being alive 🙄",
      "created_utc": 1729396676.0,
      "score": 143
    },
    {
      "id": "lstbj3c",
      "body": "What is temporary about being in chronic pain?",
      "created_utc": 1729412787.0,
      "score": 117
    },
    {
      "id": "lst92b9",
      "body": "Permanent solution to a gnarring, daily, inward/outward hatred.",
      "created_utc": 1729411080.0,
      "score": 27
    },
    {
      "id": "lst8seo",
      "body": "\"I was born for other people's satisfaction and pleasure\" -> perfectly worded",
      "created_utc": 1729410891.0,
      "score": 64
    },
    {
      "id": "lsu57yd",
      "body": "Where is the cure for ADHD?",
      "created_utc": 1729430249.0,
      "score": 15
    },
    {
      "id": "lsti7o1",
      "body": "sadly there isn’t easy way to get out of it ,,,the permanent solution might cause permanent problem which why most don’t attempt I hope one day there will be way to get out peacefully",
      "created_utc": 1729417463.0,
      "score": 14
    },
    {
      "id": "lsu0ihq",
      "body": "It's so easy to say don't die, but nothing is said of the damage a depressed person has gone through. You don't just \"snap out of it\". it's not a cold, it's like a tree as it has roots. Calling depression a temporary problem is dismissive, and there are people who are being eaten alive by their severe insecurity about being depressed.\n\n\nDepression is a temporary problem only if you get treatment for it. Other than that, it's a tree. ",
      "created_utc": 1729428229.0,
      "score": 28
    },
    {
      "id": "lsu8z8d",
      "body": "My looks are the permanent problem.",
      "created_utc": 1729431771.0,
      "score": 11
    },
    {
      "id": "lstwl61",
      "body": "I've never got why people say that like why wouldn't you want a permanent solution to a problem. Like let's say you have a flat tire, why would you not want a permanent solution to that?",
      "created_utc": 1729426326.0,
      "score": 10
    },
    {
      "id": "lswwjjb",
      "body": "ppl who says this are lucky to be so ignorant lul",
      "created_utc": 1729462206.0,
      "score": 8
    },
    {
      "id": "lsuu9ai",
      "body": "People who quote that don’t know what they’re talking about.",
      "created_utc": 1729439177.0,
      "score": 8
    },
    {
      "id": "lsv7k5r",
      "body": "CPTSD, generational trauma, abuse, ADHD, shitty genetics leading to deformities like scoliosis and didelphys...yeah, nah. None of that shit is temporary.",
      "created_utc": 1729443420.0,
      "score": 7
    },
    {
      "id": "lsuqdml",
      "body": "\"So you are saying its a solution?\"\n\n\n\nWould be a funny answer to that",
      "created_utc": 1729437904.0,
      "score": 6
    },
    {
      "id": "lsxnw5t",
      "body": "\"temporary problem\" chronic, incurable disabilities:",
      "created_utc": 1729472251.0,
      "score": 4
    },
    {
      "id": "lsxrdr4",
      "body": "I once called out a social worker for saying this to me. It hurts to know that so many specialists who want to help people are just regurgitating things that they think fit.",
      "created_utc": 1729473544.0,
      "score": 4
    },
    {
      "id": "lsvrlu3",
      "body": "suicide is a permanent solution to a permanent problem",
      "created_utc": 1729449472.0,
      "score": 6
    },
    {
      "id": "lsueras",
      "body": "it is true that this life is a temporary problem 🤔 they aren't wrong, technically. \nretarded? yes. \nattempting to come across in a different way? yes. \nstuck in the loop of that blissful ignorance I am so jealous of? absofuckinglutely. \nlucky bastards ☹️",
      "created_utc": 1729433941.0,
      "score": 3
    },
    {
      "id": "lswphwi",
      "body": "If the permanent solution would stop me from getting more worse problems later on, then I'd gladly take it",
      "created_utc": 1729459826.0,
      "score": 3
    },
    {
      "id": "lswz8a9",
      "body": "I am an addict, which is a permanent problem too. It can be treated, but there is no full recovery, so I could slip up anytime and get worse and worse life quality. I once heard that only a few percent actually manage to stop taking hard drugs for life. Society would probably do better just shooting all of us addicts",
      "created_utc": 1729463159.0,
      "score": 3
    },
    {
      "id": "lsxq43v",
      "body": "the man who said this actually commited suicide, he didnt even originally want to say that, they made him. i hope he rests in peace",
      "created_utc": 1729473073.0,
      "score": 3
    },
    {
      "id": "ltctf0y",
      "body": "if the problem was temporary, i wouldnt be living the permanent effect. fuck everyone who talks like this 👍 ",
      "created_utc": 1729697411.0,
      "score": 3
    },
    {
      "id": "lssh0qb",
      "body": "It’s a well intentioned phrase but it doesn’t apply to everybody. In my case, I was once a optimistic person who had the support of family and friends to put myself through a gruelling degree. Now I’m jobless with no end in sight to my unemployment. I consider suicide a lot because there is no way I will be hired in this economy no matter what I do and I don’t think I’ll ever get to live a life where I can actually buy stuff and be financially independent. This problem has only been with me for a few years as opposed to you chronically having it your whole life.\n\nFor someone like you, you feel like you’ve suffered all your life, and it’s not your fault that you got the short end of the stick for life. Don’t hate yourself for what others perceive of you, you’re smart enough to want to stand up for yourself and rant about superficial sayings here. I wish you could get the support you need. Suicide will mean you’ll never experience bad things in the future, but you will also never live to experience if anything remotely good does happen to you.",
      "created_utc": 1729395269.0,
      "score": 7
    },
    {
      "id": "lssx3hh",
      "body": ">the temporary problem being my whole life?\n\nwell, actually.. if you think about it:\n\n Life is temporary + To some it is a problem => the saying makes  sense!",
      "created_utc": 1729403236.0,
      "score": 7
    },
    {
      "id": "lsug7vp",
      "body": "For real. I feel like my family who i live with forces me like a slave. Also, people from my school treat me like if i were an idiot (they are the only idiots)",
      "created_utc": 1729434468.0,
      "score": 2
    },
    {
      "id": "lsvt7fj",
      "body": "There are technically an infinite amount of scenarios that could possibly happen to you in the period of a day that could change your perspective and set you on the right track. You never know when the moment that could shock you back to a positive path could happen. Ending your life is final, the path is completely severed you’re basically ending all possible outcomes that could  ever be beyond that point. Staying alive is the prerequisite to staging a comeback, you can do it.",
      "created_utc": 1729449967.0,
      "score": 2
    },
    {
      "id": "lszfq0x",
      "body": "Remember those negative thoughts about yourself are not true so stop saying them firva start and add the real ones who you are\nUpset, feeling low, a house person,  add add your good qualities \nStop saying the bad thoughts about yourself ",
      "created_utc": 1729506020.0,
      "score": 1
    },
    {
      "id": "ltdnjjd",
      "body": "I know exactly how you feel. I get bad headaches. I have had them for 36 years. I’ve been through every medication that is available. I have seen numerous neurologists and doctors. I have been to the Mayo Clinic 3 times. I spent a total of 3 weeks. Mayo Clinic found masses deep in my brain. My headaches cost me my family. My wife of 28 years left me. My children are grown and on their own. It’s just me and my dog. I pray to Christ everyday. I pray for Christ to take my pain away or take me. I miss my wife. I’m tired of being a burden on my friends and family. ",
      "created_utc": 1729706517.0,
      "score": 1
    },
    {
      "id": "ltgbyyb",
      "body": "I agree... it seems to me that the permanent problem for me is the pain and darkness inside of me..I want to end the pain permanently.. I'm in so much pain inside..\nThe temporary solution is I'm supposed to go get a job and work a night shift and walk around like a zombie... but hey I'll be a contributing member of society because I have a job..\nThat will make someone happy.. but it won't make me happy. My dog just died and I want to go find him",
      "created_utc": 1729738579.0,
      "score": 1
    },
    {
      "id": "lsuojif",
      "body": "There are a lot of people for whom the sentiment of that phrase rings true. A certain state of mind can make you only see the \"easy\" way out when there really are prospects for a life you can bear and enjoy, even if it takes some time.",
      "created_utc": 1729437292.0,
      "score": 1
    },
    {
      "id": "lssi5va",
      "body": "U cant get better if u find comfort in the things that actually hurt u and you know its bad but u think its a comfort zone when its only a place that wants to swallow u whole. Once ur trapped in it its hard to get out of it but its not impossible. Im aware it sounds like im talking bs and that it actually never gets better but say u have abt 60 years left to live. Theres still change that can happen but it can also only happen if u are ready to make changes.",
      "created_utc": 1729395759.0,
      "score": -12
    },
    {
      "id": "lsu90fh",
      "body": "Same",
      "created_utc": 1729431784.0,
      "score": 22
    },
    {
      "id": "lsutv9r",
      "body": "Exactly",
      "created_utc": 1729439050.0,
      "score": 15
    },
    {
      "id": "lstkssv",
      "body": "Same",
      "created_utc": 1729419267.0,
      "score": 20
    },
    {
      "id": "lsvqudu",
      "body": "real",
      "created_utc": 1729449240.0,
      "score": 10
    },
    {
      "id": "ltk0bbn",
      "body": "For real my permanent problem too. ",
      "created_utc": 1729794917.0,
      "score": 2
    },
    {
      "id": "lsuhx7a",
      "body": "A lot of people live and thrive w autism everyday",
      "created_utc": 1729435072.0,
      "score": -24
    },
    {
      "id": "lstagem",
      "body": "I mean life is by definition temporary",
      "created_utc": 1729412044.0,
      "score": 48
    },
    {
      "id": "lsuhsv0",
      "body": "Yea technically being alive is temporary.  We all die eventually!!",
      "created_utc": 1729435030.0,
      "score": 14
    },
    {
      "id": "lstf387",
      "body": "yepp. its ruined my life",
      "created_utc": 1729415257.0,
      "score": 32
    },
    {
      "id": "lswn6as",
      "body": "[deleted]",
      "created_utc": 1729459082.0,
      "score": -1
    },
    {
      "id": "lstd73f",
      "body": "I was put on this earth without my permission and now I have to deal with the consequences?",
      "created_utc": 1729413935.0,
      "score": 50
    },
    {
      "id": "lswfinz",
      "body": "This is exactly what I’m afraid of",
      "created_utc": 1729456744.0,
      "score": 1
    },
    {
      "id": "lswfvix",
      "body": "I’d rather end my life and know I won’t suffer anymore than stay hoping for change that most likely won’t happen",
      "created_utc": 1729456847.0,
      "score": 4
    },
    {
      "id": "lswgari",
      "body": "I think I do find comfort in the things that hurt me but I don’t know how to get out of the cycle",
      "created_utc": 1729456970.0,
      "score": 2
    },
    {
      "id": "lsukyoe",
      "body": "And there’s more of us that ain’t thriving and wish we never had it.",
      "created_utc": 1729436098.0,
      "score": 48
    },
    {
      "id": "lsyeux7",
      "body": "Why bro. Why comment",
      "created_utc": 1729482775.0,
      "score": 9
    },
    {
      "id": "lsyonzp",
      "body": "But it is a disorder my guy.... a lot of people STRUGGLE with it. It's not normal... so the people who thrive have at least struggled before.",
      "created_utc": 1729487892.0,
      "score": 7
    },
    {
      "id": "lsym0ys",
      "body": "Support needs vary. Some Autistics need (and do not receive/lack) a more substantial amount of care. Just because some have less debilitating symptoms, does not mean others do not.",
      "created_utc": 1729486411.0,
      "score": 4
    },
    {
      "id": "lsujjsi",
      "body": "Dude nothing temporary about decades of pain.",
      "created_utc": 1729435629.0,
      "score": 25
    },
    {
      "id": "lsviqd1",
      "body": "Yeah I'm not waiting other 35 years for this shit to end.",
      "created_utc": 1729446819.0,
      "score": 20
    },
    {
      "id": "lsvnm1s",
      "body": "Plus, if you're like a lot of people who believe in reincarnation, then there's definitely no such thing as permanency as all lives are temporary states of existence.",
      "created_utc": 1729448283.0,
      "score": 1
    },
    {
      "id": "lsyf5i4",
      "body": "Can we stop with \"technically\" it's decades. I don't care if it's \"technically\" temporary, it ain't temporary to me.",
      "created_utc": 1729482912.0,
      "score": 1
    },
    {
      "id": "lstn41l",
      "body": "But if you talk about certain solutions to those consequences, you’re selfish and should think about all the people you would hurt. No win situation.",
      "created_utc": 1729420847.0,
      "score": 22
    },
    {
      "id": "lt1c9ou",
      "body": "I mean but wouldn’t even the slight chance of finding true happiness be worth it? Its possible",
      "created_utc": 1729531759.0,
      "score": 0
    },
    {
      "id": "lsv4xzb",
      "body": "[removed]",
      "created_utc": 1729442599.0,
      "score": 1
    },
    {
      "id": "lt2tbxo",
      "body": "[removed]",
      "created_utc": 1729548062.0,
      "score": 1
    },
    {
      "id": "lsvzpx9",
      "body": "Truth is god created us for laughter so you either get with the program or leave it. Everything we do makes god giggle and laugh.",
      "created_utc": 1729451962.0,
      "score": -5
    },
    {
      "id": "lsubi0q",
      "body": "How is this a no win situation? I get to be free from all this shit. Its a win in my book and also its not like anybody gives a fuck if I live or not\n\nI am damn sure people will be delighted to hear that I am gone",
      "created_utc": 1729432734.0,
      "score": 9
    },
    {
      "id": "lsv5h46",
      "body": "[removed]",
      "created_utc": 1729442765.0,
      "score": 1
    },
    {
      "id": "lt45sfd",
      "body": "Yeah and autistic people can also have “real”problems on top of autism living and dealing with all the other shit life throws at them along with being isolated from the rest of society. The fuck was the point of your comment.",
      "created_utc": 1729565800.0,
      "score": 9
    },
    {
      "id": "lsw49hl",
      "body": "I'm leaving it alright",
      "created_utc": 1729453335.0,
      "score": 14
    },
    {
      "id": "lswrha2",
      "body": "God isn’t real",
      "created_utc": 1729460480.0,
      "score": 7
    },
    {
      "id": "lsx7d4j",
      "body": "Shut up.",
      "created_utc": 1729466084.0,
      "score": 6
    },
    {
      "id": "lsyorlq",
      "body": "are you dumb....??? God most certainly does not giggle at our behavior",
      "created_utc": 1729487950.0,
      "score": 5
    },
    {
      "id": "ltbrg0n",
      "body": "If God is real I hope he gives up on life as well",
      "created_utc": 1729683826.0,
      "score": 2
    },
    {
      "id": "lsxdtv8",
      "body": "Thats nice, so he was laughing during the Romanian genocide, the holocaust, and everytime a school shooting is announced. Seems more like a deity tbh.",
      "created_utc": 1729468491.0,
      "score": 4
    },
    {
      "id": "lsv5yh8",
      "body": "[removed]",
      "created_utc": 1729442914.0,
      "score": 1
    },
    {
      "id": "ltdkjv0",
      "body": "Bc I fucking can that's why. Everyone in here is poor me poor me when yalls problems are so dumb and stupid that's why",
      "created_utc": 1729705622.0,
      "score": 0
    },
    {
      "id": "ltdo4b7",
      "body": "And people are free to tell you that your opinion sucks and is stupid.",
      "created_utc": 1729706694.0,
      "score": 6
    },
    {
      "id": "lueu9px",
      "body": "This whole sub reddit forum what the fuck ever this shit is sucks and is dumb as shit. None of these problems yall have are actually problems to be suicidal over and I just can't fathom harming myself over such dumb problems.",
      "created_utc": 1730234901.0,
      "score": -1
    }
  ]
}