{
  "id": "1dveziq",
  "title": "My grandfather said I had big “boobs” and a “good body” when I was in a swimsuit. ",
  "selftext": "It’s like my family doesn’t care anymore. They just say “oh it’s just what he does”. But it’s weird. He also used to bully me for being bigger. I lost weight because I forget to eat sometimes. Now he says this shit.",
  "created_utc": 1720120860.0,
  "score": 616,
  "num_comments": 73,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1dveziq/my_grandfather_said_i_had_big_boobs_and_a_good/",
  "comments": [
    {
      "id": "lbobtbp",
      "body": "Next time he does it (and there will be a next time), state loudly enough for the whole room to hear \"Would you please stop making lewd and creepy comments about my body.\" \n\nIf necessary add this: \"I'm underage and you're old enough to know better than to make pervy comments about your own grand daughter.\"",
      "created_utc": 1720139028.0,
      "score": 424
    },
    {
      "id": "lbn8vp2",
      "body": "Sounds like you should cut him out of your life and refuse to be anywhere near him.",
      "created_utc": 1720123565.0,
      "score": 406
    },
    {
      "id": "lbnw1bv",
      "body": "as someone who also got SA'ed by a family member this is disgusting and its terrible you have to go through this its sick how so many people get away with shit like this just because they are \"family\" if you can find a relative you can stay with that would probably be the best because you shouldn't be near him",
      "created_utc": 1720132309.0,
      "score": 103
    },
    {
      "id": "lbo26o4",
      "body": "This is creepy. Stay away from him plus your family that dismisses it",
      "created_utc": 1720134852.0,
      "score": 31
    },
    {
      "id": "lbonmic",
      "body": "Is straight up telling him \"ew that's gross\" an option",
      "created_utc": 1720144545.0,
      "score": 15
    },
    {
      "id": "lbnkto4",
      "body": "My in laws comment on my daughters looks, it fucking pisses me off.",
      "created_utc": 1720127894.0,
      "score": 56
    },
    {
      "id": "lbo2fd9",
      "body": "Respect for reaching out. I have daughters and wouldn’t think twice about confronting someone older with an attitude like his. Age gives no1 a pass to act like that. Do you have an aunt or even an older cousin that you could talk to about this? I’m pretty sure he’s more than likely been this way with other family members in the past.",
      "created_utc": 1720134952.0,
      "score": 16
    },
    {
      "id": "lbpaqyl",
      "body": "My grandparents lived with us for several years while I was growing up and my grandfather was a huge creep. Telling me my body looked good, if he won at the game of pool, I have to show him my boobs and kiss him. He was very touchy and while growing up it made me so uncomfortable. Forcing kisses on my lips, having his hand wander and caress my leg when I was in the front passenger seat next to him in the car. Watching me sleep on the couch and wake up to him staring at me. Constantly saying I’m fat and critiquing anything I’d make to eat. It really planted seeds of self hatred for myself and depression. My mom and her sisters apparently had to deal with that sort of stuff while growing up and they always said ‘that’s just how he is’. He had them walking around in bikinis when he would have friends over to play cards. I just want to tell you it gets better. He will die and things will be ok. Not sure of your age but you can separate yourself from him once you are of age and never have to deal with him again. That’s what I did. I refused to go to family events if my grandfather would be there. If it was a major holiday, I would go but act like he wasn’t there and not acknowledge his presence. It really does get better. Of all things to leave this world over- don’t let him be the reason you do it. If you ever need to talk, I’m always here, friend.",
      "created_utc": 1720156306.0,
      "score": 7
    },
    {
      "id": "lbohnfq",
      "body": "I legitimately thought I was on two sentence horror for a second. Christ. I’m so sorry.",
      "created_utc": 1720141693.0,
      "score": 12
    },
    {
      "id": "lbnc2k9",
      "body": "Asshole or cognitive decline?",
      "created_utc": 1720124711.0,
      "score": 37
    },
    {
      "id": "lbo6i6j",
      "body": "It's OK for grandparents to comment on how pretty (or handsome) a grandchild is, in a respectful way to make the grandchild feel good about themselves. But *those* comments, and saying things like that... that is not innocent. That is completely unacceptable, and totally inappropriate. NO *MAN* in the family should ever make any comment even remotely like that about a lady or girl in the family. It's extremely and wildly inappropriate. That is NOT ok, don't EVER let anyone in your family make you think that's OK. Next time anything like this is said, threaten to call family services.",
      "created_utc": 1720136682.0,
      "score": 17
    },
    {
      "id": "lbsn3k6",
      "body": "Tell him he has Alzheimer's.  As brain deterioration is the only plausible explanation why he would say something so gross.  Make some comments about putting him in a ward/home.",
      "created_utc": 1720210618.0,
      "score": 4
    },
    {
      "id": "lbpkc3q",
      "body": "Your parents let him get away with that? Tell him you’re gonna notify the police if he continues to be an inappropriate ass.",
      "created_utc": 1720162183.0,
      "score": 6
    },
    {
      "id": "lbns40u",
      "body": "Beat his ass, or have your bf beat his ass.",
      "created_utc": 1720130714.0,
      "score": 21
    },
    {
      "id": "lbqorm5",
      "body": "Dirty nonce.. 😡",
      "created_utc": 1720186242.0,
      "score": 3
    },
    {
      "id": "lbqyczu",
      "body": "that's fucked up. Can't even show some respect to his own granddaughter. some people never grow the fuck up. I wish you could respond next time and just tell him to shut the fuck up.",
      "created_utc": 1720189923.0,
      "score": 3
    },
    {
      "id": "lbr6fb6",
      "body": "This is weird, but even more weird if you’re male.",
      "created_utc": 1720192802.0,
      "score": 3
    },
    {
      "id": "lbs9u0q",
      "body": "The next time just say out loud, \"Why are you such a p e d o that you're sexualising your own granddaughter, and that too a minor?\"",
      "created_utc": 1720206078.0,
      "score": 3
    },
    {
      "id": "lbtijyl",
      "body": "Cut ties with him completely and immediately.  That's incest and it is disgusting.  He's thinking about you more than you know.",
      "created_utc": 1720222311.0,
      "score": 3
    },
    {
      "id": "lbwpzvp",
      "body": "He is pervert",
      "created_utc": 1720281528.0,
      "score": 3
    },
    {
      "id": "lbp9vjc",
      "body": "AAAAAAAA NO NO NO NO! GET HIM OUT OF HERE!!!!!",
      "created_utc": 1720155802.0,
      "score": 6
    },
    {
      "id": "lboa7gr",
      "body": "Wow that is wrong on all levels.",
      "created_utc": 1720138305.0,
      "score": 4
    },
    {
      "id": "lbwv1ko",
      "body": "I feel bad for you :(",
      "created_utc": 1720283383.0,
      "score": 2
    },
    {
      "id": "lbqatfm",
      "body": "if hes fat you can compliment his boobs as well. maybe its gonna stop him from saying it next time",
      "created_utc": 1720179771.0,
      "score": 3
    },
    {
      "id": "lbo3slw",
      "body": "I read this as \"boyfriend\" first and it confused me",
      "created_utc": 1720135527.0,
      "score": 4
    },
    {
      "id": "lby4z2i",
      "body": "That’s what my aunt said. It was fucking disgusting :/",
      "created_utc": 1720299587.0,
      "score": 1
    },
    {
      "id": "lc413hx",
      "body": "That's not supposed to happen...you are completely right for being pissed! My birth mother had said something similar to that tbh...\nIt's honestly fucked up that people like that get away with it bcs it's \"just a comment\" ",
      "created_utc": 1720393839.0,
      "score": 1
    },
    {
      "id": "lbq6vd4",
      "body": "i dont care if its just a thing he does thats still weird imagine he wasn't your grandfather and it was some creepy man in his 70s you totally have the right to say shit about it if you want to",
      "created_utc": 1720177551.0,
      "score": 0
    },
    {
      "id": "lbpp395",
      "body": "Grandpa is just being nice",
      "created_utc": 1720165372.0,
      "score": -6
    },
    {
      "id": "lbneamb",
      "body": "[removed]",
      "created_utc": 1720125513.0,
      "score": -31
    },
    {
      "id": "lbq3ay6",
      "body": "Fucking hit the dog",
      "created_utc": 1720175321.0,
      "score": -4
    },
    {
      "id": "lbp7120",
      "body": "I second this. Also agree with those mentioning avoid any circumstance where there's a possibility of being alone with him.",
      "created_utc": 1720154204.0,
      "score": 104
    },
    {
      "id": "lbpqtzk",
      "body": "Yeah, definitely say something like this, and make sure there are people who can hear it, it might take a lot of confidence but I too think it'd be good",
      "created_utc": 1720166589.0,
      "score": 17
    },
    {
      "id": "lbnbq4e",
      "body": "I honestly can’t, I am a minor and my parents will just tell him to stop (he won’t)",
      "created_utc": 1720124584.0,
      "score": 211
    },
    {
      "id": "lbtip5u",
      "body": "She definitely should, completely and immediately.  It is incest.",
      "created_utc": 1720222370.0,
      "score": 3
    },
    {
      "id": "lbnkmvb",
      "body": "a mix of both",
      "created_utc": 1720127822.0,
      "score": 32
    },
    {
      "id": "lbsal0t",
      "body": "Not safe to be around children either way",
      "created_utc": 1720206334.0,
      "score": 5
    },
    {
      "id": "lbspyhx",
      "body": "I’m female and my mom says the same thing to me and even creepier stuff than this. It makes me really uncomfortable also because I’m a lesbian. But she’s a woman and apparently it doesn’t count when it’s another female.",
      "created_utc": 1720211603.0,
      "score": 5
    },
    {
      "id": "lbpat82",
      "body": "Perfect silliness with somewhat seriousness. Made me laugh :)",
      "created_utc": 1720156342.0,
      "score": 5
    },
    {
      "id": "lfdjfuu",
      "body": "Dude 😑",
      "created_utc": 1722192744.0,
      "score": 1
    },
    {
      "id": "lbs3ldt",
      "body": "[deleted]",
      "created_utc": 1720204037.0,
      "score": 0
    },
    {
      "id": "lbnj7et",
      "body": "They are a minor bro, not that them being overage is any better, but they’re a fucking minor… there’s no excuse",
      "created_utc": 1720127287.0,
      "score": 33
    },
    {
      "id": "lbpbbvd",
      "body": "No, he knows better, he’s a grown man. He has just been getting away with being a creep for too long and thinks he can do it to anybody.",
      "created_utc": 1720156644.0,
      "score": 5
    },
    {
      "id": "lbso3xv",
      "body": "> Hit him in the face with a pie if he does not stop. Kick him in the shin\n\nI'm all for this but legality might be an issue \n\n> Rise above it and move on\n\nI'd imagine it would be a lot easier to do so after one gives him a good beating with a slideshow bob final.",
      "created_utc": 1720210963.0,
      "score": 2
    },
    {
      "id": "lbpeh9q",
      "body": "“not many years left to live” okay??? that’s a good thing",
      "created_utc": 1720158505.0,
      "score": 3
    },
    {
      "id": "lbp7w63",
      "body": "Yes. Absolutely that.",
      "created_utc": 1720154684.0,
      "score": 28
    },
    {
      "id": "lbndqj6",
      "body": "You can contact your state’s department of family services. Most likely scenario, they tell your parents your grandpa is not allowed near you. If they don’t follow through, you call again and they put you somewhere else. \n\nOr you could kick the old man in the crotch. Being old doesn’t excuse incest and sexual harassment.",
      "created_utc": 1720125313.0,
      "score": 154
    },
    {
      "id": "lbneiqx",
      "body": "So he's a pedo also, even more of a reason to not talk to him. Depending on how old you are, start saving up money so when you turn 18, you'll be financially secure enough to move away from the creep.",
      "created_utc": 1720125593.0,
      "score": 100
    },
    {
      "id": "lbo4bt9",
      "body": "You shouldn't have to go through this, but have you also told him directly yourself to stop making comments about your body and that it makes you uncomfortable? There's no guarantee, but maybe he will start to feel some shame and embarrassment and keep those thoughts to himself.",
      "created_utc": 1720135751.0,
      "score": 15
    },
    {
      "id": "lbnn3v2",
      "body": "Regardless something has to be done, because creepy old man being a perv is not okay",
      "created_utc": 1720128767.0,
      "score": 32
    },
    {
      "id": "lbodgj5",
      "body": "[removed]",
      "created_utc": 1720139768.0,
      "score": 8
    },
    {
      "id": "lboyntm",
      "body": "Record the nasty shit he says and get him put in prison. Sick men like him shouldn’t be allowed to roam free. Who knows what he says or does to kids he isn’t related to.",
      "created_utc": 1720149814.0,
      "score": 8
    },
    {
      "id": "lbpg1fb",
      "body": "Call the authorities. Not only is he an old man, but hes also your grandfather.",
      "created_utc": 1720159458.0,
      "score": 4
    },
    {
      "id": "lbtixy0",
      "body": "Your dad needs to man up.  You need to report both your parents immediately.",
      "created_utc": 1720222470.0,
      "score": 2
    },
    {
      "id": "lby523x",
      "body": "I’m so sorry to hear that, that’s just disgusting. ",
      "created_utc": 1720299617.0,
      "score": 2
    },
    {
      "id": "lbs4npl",
      "body": "I'll take that as a compliment, thank you kind sir",
      "created_utc": 1720204382.0,
      "score": 0
    },
    {
      "id": "lbniiym",
      "body": "Yes, this. Report him to police",
      "created_utc": 1720127033.0,
      "score": 54
    },
    {
      "id": "lbtj119",
      "body": "Her parents enable it too.",
      "created_utc": 1720222505.0,
      "score": 2
    },
    {
      "id": "lbon89n",
      "body": "Those are also mandated reporters, and if they didn't file a complaint, I would be shocked.",
      "created_utc": 1720144358.0,
      "score": 5
    },
    {
      "id": "lbv1x7x",
      "body": "That was very much an insult",
      "created_utc": 1720249574.0,
      "score": 1
    }
  ]
}