{
  "id": "1frpof6",
  "title": "Suicide is.. scarier the closer it is. Ending it soon. I was somebody ♡",
  "selftext": "This isn't the \"coward's\" way out. It really isn't.\n\nEven though I'm unbelievably fortunate this method is relatively painless, quick, and unassuming enough not to look gruesome, a part of me *is* scared. I used to say \"when I have a peaceful method, it'll be easy..\" but now that the time has come, I was really naive. I believe in the afterlife and consciousness after death, but I honestly don't mind if I am just unaware and I'm no more troubled than when I'm asleep..\n\nTo the people reading, I am so, so sorry you are trapped in atrocious circumstances or suffering such as war, unjust treatment, domestic violence, inescapable poverty, loneliness, crimes against humanity, the terror of being your biological gender but not having the resources and support to transition, and so many other injustices you do not deserve. This world is unabashedly brutal and horrible and I'm disheartened and disgusted that this the world we live in. I see you're trying to defend your fire against forces greater than yourself, and I am proud of you for living another day. Some days are more overpowering than others, but I want you to understand that is no reflection of inherent unworthiness or lack on your part. You are doing what you can with the tools (if any exist) you understand how to use, so please do not beat yourself up more than you are already breaking. Thank you for the chance you read this and we met. I wish to you all for external and internal resources come your way, freedom from suffering, empowerment, autonomy, courage, healing, resilience, personal fulfillment, growth, mercy and comfort for yourself, total fulfillment of your basic and inherent needs, and an abundance moments of expansive and loving joy. ♡\n\nI even wish this for the people that have hurt me or willingly harmed others, because if we all possessed these things—especially the latter (as suffering is inevitable to some degree)—there would be no need or desire to cause harm. They could connect with others and themselves in the most positive and fulfilling of ways. At least.. that's how I feel.\n\nI wish I could have made a great and bright impact on the world. The reason I am probably so hesitant is that my life has barely begun. I'm twenty years old. If I gave myself twenty to thirty years, I could probably gauge my impact, figure out what is wrong and strive for something better for everyone. I wish everyone felt that way to some degree. Though, some people are afraid of opening Pandora's box and don't realize they're actually in it.\n\nIf you read all this, thank you for reading. I hope I could make your day a little bit better. Thank you.\n\n  \n**Update (10/04/24)** :\n\nI missed my ticket.  A few days ago, I tried to die and woke up the next morning with the most excruciating migraine and bodily weakness of my life. I still feel a bit weak. I see where I messed up a step and why I lived.  As of now, I'm on the margins of figuring out what to do next. Even though mind is in a weird place, I do know that I'd like to thank and hug everyone who felt moved by my note. \n\nIt is fact there is endless and boundless suffering in life. I am so sorry you cannot escape your undeserved agony, and I have my deepest compassion for your trying. You do not deserve this in the first place. For those whose suffering is more than they are capable of enduring, and whose challenges are practically insurmountable, I send you the highest and brightest peace, self-love and courage and my respect for your autonomy to make the best possible choice for yourself. To those who choose to pursue living, I eagerly support you to continue! I know it is hard. This cycle of inner struggle—spiraling, self-doubt, bitterness, frustration, delusion—is baked into our humanity, and we may never fully step out of that cycle until our last breath. But you know what? While we are alive, I rejoice in the days, moments, minutes, and seconds to spare you aren't caught in that cycle and feel connected with and free.\n\nI purposely didn't elaborate what pushed me to suicide in my note, because this note isn't about me; it is about you. Whether you sobbed, felt your stomach drop in fear, or clenched your fists in self-frustration, I dream you confront what your subconscious yearns for and achieve it. \n\nIf I may include, this world *is* unbelievably fucking awful and cruel and full of suffering. I cannot dress up that undeniable truth in pretty words and still keep my integrity.\n\n Knowing this—nearly dying—I realize there are things I wanted to do. I wanted to make the world a better place. I wanted to make people smile, to make people laugh. I wanted to lower people's guards and help them feel joy again. I wanted to ease people's stress and invite laughter. I wanted to help people open their Pandora's box and show them there is still merit in staying in this world despite the horrors. I wanted every interaction I have to be raw, energetic, vulnerable, and alive, so that no one ever felt warranted to question my intentions; instead, they remember the humanity flowing in their veins. I wanted to wake up every morning and feel self-confident from sunrise to sunset, knowing that this is the gift I would deliver to you personally, and I would do it again and again and again. \n\n...Now, despite that..\n\n ..I am just as much as hesitant to live as I was to die. Even though I feel in tune with my life's purpose, the lack of noise in death fulfills a large part of me that life cannot. If I had given myself another twenty-five to thirty years, I could have departed on my deathbed with my head held high and spine erect. But that isn't now. Frankly, a part of me wishes it were. I type this in hopes that maybe it will resonate with someone out there, and know that you aren't alone in feeling this way. \n\nThank you for reading this. Have a good day, everyone. ♡",
  "created_utc": 1727561977.0,
  "score": 521,
  "num_comments": 88,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1frpof6/suicide_is_scarier_the_closer_it_is_ending_it/",
  "comments": [
    {
      "id": "lpeoir7",
      "body": "A lot of what you said resonates with me. Im not sure when i’ll go, maybe next month but sometimes it seems that hope is the cruelest of all evils because it continues suffering.",
      "created_utc": 1727562663.0,
      "score": 93
    },
    {
      "id": "lpeqfar",
      "body": "You're so well spoken.  I'm sorry that we feel this way, and are trapped in boxes that are designed to sabotage our well being.",
      "created_utc": 1727563399.0,
      "score": 48
    },
    {
      "id": "lpeojdb",
      "body": "You should absolutely be hesitant, as you rightly recognize your life has yet to begin. You’re still growing in more ways than one, and you will encounter challenges now that you will think nothing of in the future.\n\nMy main concern with your age—like so many on here—is that they’re likely surrounded by loving support. It’s the all-consuming nature of depression that blinds us to the love that surrounds us.\n\nTime moves slowly for young folks, as they’ve barely experienced it. I fully support suicide as a solution to some folks, but nine times out of ten young people are just too damn hasty. Take time with yourself, seek counseling or whatever works. Bottom line, 20 is too young, and that’s not to speak of how it will crush those that love you.",
      "created_utc": 1727562670.0,
      "score": 29
    },
    {
      "id": "lpeur4w",
      "body": "You wrote so beautifully friend. I wish you'd write a compilation book of your writings and advice/encouragements for people who hurt like us. \n\nYour words, mind and heart are like chrystaline waters that can soothe and bring comfort to others. \n\nI wish that you could feel as supported as you have helped us feel through reading your words. \n\nIf you want to make even a small book, you can self publish on various sites that will help you format and print copies and everything.  \n\nYou could collab with an artist to make some illustrations even etc. \n\n\nYou're a treasure OP",
      "created_utc": 1727565066.0,
      "score": 12
    },
    {
      "id": "lpetng1",
      "body": "The world needs more people with your heart.",
      "created_utc": 1727564636.0,
      "score": 8
    },
    {
      "id": "lpf5fks",
      "body": "Thank you so much for your post, it touched a sensitive part of my soul. I am at the beginning of my life too, sometimes i feel like there is no hope for me and sometimes really ambitious. It's such a great idea to give yourself some time to flourish in your life and have an impact. I may decide to do this as well and see how it goes. We should give ourselves a chance. I hope you have a good day!",
      "created_utc": 1727569313.0,
      "score": 5
    },
    {
      "id": "lpfb1h9",
      "body": "this is incredibly well written, i can feel the passion and care you have for others through your post. to me, the dedication you show is worth staying for, but i of course don’t know your circumstances. \n\ni’m 21 and we seem to think and express ourselves in similar manners — it deeply hurts my heart to see someone i empathize so closely with feel that they have to go. \ni feel wholly blessed to have met you and will carry your words with me for quite a while. if nothing else, you’ve accomplished your goal of making someone, myself, feel freer from their burdens and i’m proud of you for that.",
      "created_utc": 1727571533.0,
      "score": 4
    },
    {
      "id": "lpfl48y",
      "body": "From past experience, I say \" sleep\" wake up next day. Give it time. Insteadbrash decisions. \n\nLast year around this time of year. I had spinal fusion. Back was a wreck. I remember saying I want to go home right after surgery. I was in agony. \" whay pushed things over edge was alota tike had gone by until it finally got figured out. \" and ins games\" Then surgery finally. \n\nBy then I was to wits end. Then pain after surgery made it worse. \n\n\" any how I kept wanting to go home\" was suppose to be at the hospital few days\" then suppose to go home. Complications made stay longer. Soon as I woke up from surgery the pain intense then Complications put me over the edge. \n\nFlip side Complications os what caused me to have to stay at the hospital. \n\n\" if I had of gone home\" I would have 100 percent ended life\" no questions about it. I didn't say anything didn't want to was dead set on it that's why I wanted to go home. \n\n\nBecuase Complications I had to stay. The pain subsided and Complications got resolved mostly. \" fortunately there was no litterl way to end life there\" the bed was alarmed even. Protocol cause fall risk after surgery. \n\nThat's stay even though it sucked saved my life. \" was a blessing\" \n\nThings improved over time. With spine after to.\n\n2 days ago a employee asked me about pain after surgery and back pain. I said to him. You know only reason I'm not dead is the stay. Otherwise I cphofa cared less about bussiness anything else. \" the pain had everything else tuned out\" yes I have alot to live for but I'll tell you what pain can cause person to get to that level and quick.\n\n\" hence the reason I now say\" give it time no rash decisions.\n\n\" prior to that\" I didn't care. I was rash. Now I never got bit by that way thinking either. I mean. I got mad at my boss in 2016 left a six fig job. Woth union bennies. Said see yeh. Even in bussiness I been that way.\n\nThat surgery Sept 22 2023 changed my ways and I'm more patient now to. \n\nIf your feeling down remember \" no rash decisions\" give it time \" time needed to sort things out is normal\"",
      "created_utc": 1727575697.0,
      "score": 3
    },
    {
      "id": "lpgw05q",
      "body": "Hey thank you for sharing this I resonate everything you said deep within my heart.\n\nAll around me are people who like me are broken and lost in more ways than one.\n\nIt really hurts that despite life being beautiful and full of wonder pain and suffering can make even the most beautiful things not so special anymore and the thought of that can really shatter your heart where things you once held dear and thought were whole were actually fragments that were eventually going to break & on a existential level that is truly disheartening.\n\n  \nI have been bullied and severely abused that I feel and *know* deep within that I have missed out on life. I never even had a chance to truly live and almost every moment of my life was spent in pain. Although I wish I wasn't afraid to talk about the things people have done to prevent my light from shining I wish they would pay in one way or another.\n\n  \nTears fill my eyes whenever I find myself thinking about how others have treated me & they never got the chance to get to know the soul who dwells within.\n\n  \nSometimes I wish I never came to this world, everyone is so cruel to one another that even treating people right is looked down upon. I feel I'm stuck in some insane asylum and I don't want to be here anymore. Saying I'm tired doesn't fully describe how I actually feel I miss wherever I come from but since I've been in the dark for so long *sometimes I wonder if \"home\" is really safe from any pain and suffering as well.*\n\n  \nI don't want to be here anymore but if life does truly *\"get better\"* I hope I get to finally remember what it was like before the people who hurt me broke me. I miss when sunshine felt like a warm hug & welcomed me each and every rising that the light shown & when rain felt like kisses from the sky. I miss when I would sit in the darkness in a room feeling lost and the moon would always find me and give me a gentle hug.\n\n  \nI just want to scatter off into the void into nothingness but I know deep down that that's not what will happen. \n\nWherever I go I hope I am loved and that I can heal from everything that is hurting me & that I'll finally have a home.\n\n*I miss myself and everything that felt beautiful to me.*🦋",
      "created_utc": 1727602322.0,
      "score": 5
    },
    {
      "id": "lpfs79s",
      "body": "So much of what you said resonated with me. But you are only 20. I also tried when I was 20 and failed. Your hesitation means something. I understand the exhaustion, I'm 62 and going to be homeless so I'm facing those circumstances myself and yet I have no family or friends that care about me and you have those things.20 is too young, my love.",
      "created_utc": 1727578738.0,
      "score": 3
    },
    {
      "id": "lpf1o6a",
      "body": "Hey, I see you like shoujo manga. What are some of your favorites? My favorite shoujo manga is probably Kamisama Kiss. I also loved Vampire Knight, Wolf Girl and Black Prince, Happy Marriage, Midnight Secretary.  (Well the last two are josei). Do you read webtoons as well? I read a lot of romance webtoons, which I am trying to catch up on. Please don’t die I need someone to be shoujo besties with. I’m 19 so just a year younger than you and we have so many common interests.",
      "created_utc": 1727567805.0,
      "score": 2
    },
    {
      "id": "lpfv5yg",
      "body": "It's the people like you that should be and deserve to be in this world 🫶🏼",
      "created_utc": 1727580027.0,
      "score": 2
    },
    {
      "id": "lpgo56n",
      "body": "I’ll also be gone, I have 7 years to go, wish me luck!",
      "created_utc": 1727596810.0,
      "score": 2
    },
    {
      "id": "lpgv9zu",
      "body": "You use the past tense of \"I \\*was\\* Somebody\", but you will always be somebody, even after you pass. Whether that's soon, or in another 50-70 years from now. I completely agree with you and I am so glad to see someone who thinks the same way as me, seeing how terrible the world is, but still giving the benefit of the doubt to people who we deep down know might not even deserve that gratification. Also, I am 100% certain that you have done something that had at least a little bit of an impact on the world in a good way. You may not remember, but there is most definitely something you have done in your life that must have made someone else's day. Even if it was something small, something maybe you wouldn't see as very impactful, if impactful at all, someone else very likely saw it as a positively heavily impactful thing. What seems like nothing to one person, may carry so much more meaning to another. And you are completely right, suicide is NOT the \"cowardly\" way out. But in a way it's like your saying that the alternative, pushing through and staying alive, is cowardly. I know that's not what you mean, but if you think about it, at least in my opinion, this may be something that you are deeply telling yourself without even realizing it, and that can be so detrimental to how you feel towards life itself.\n\n(please turn to the replies on this comment for the rest of what I have to say, if you are interested :\\]\n\nthere are 3 replies)",
      "created_utc": 1727601803.0,
      "score": 2
    },
    {
      "id": "lphcf96",
      "body": "What kinds of difficulties have you been facing life?",
      "created_utc": 1727612510.0,
      "score": 2
    },
    {
      "id": "lphema2",
      "body": "I don’t think you should do it.",
      "created_utc": 1727613590.0,
      "score": 2
    },
    {
      "id": "lpm1c2h",
      "body": "I hope you live longer \nI feel I'm coming closer to kms everyday I don't have a choice anyways and its scaring me all the time everyday ",
      "created_utc": 1727676089.0,
      "score": 2
    },
    {
      "id": "lq429xs",
      "body": "In another life, I wish I would have read something written by you that wasn't a suicide note. Hopefully I'll have the privilege to do it someday in this life instead.",
      "created_utc": 1727948816.0,
      "score": 2
    },
    {
      "id": "lq7oqi6",
      "body": "You are somebody and you made my day better just by reading this. Thank you. I hope you stay around and I hope your days are kinder.",
      "created_utc": 1727995454.0,
      "score": 2
    },
    {
      "id": "lrpbyf9",
      "body": "It always saddens me seeing such young kind people carry so much pain in their heart. \n\nPlease know that your life has only just begun and I believe you’ll face any challenge life throws at you in stride. If you feel like you haven’t done much yet, in comparison to your peers, it’s not because you’re a failure, but because you’re a late bloomer, and there’s nothing wrong with that.",
      "created_utc": 1728817859.0,
      "score": 2
    },
    {
      "id": "lpeycrc",
      "body": "There is a reason for your hesitation. Please give yourself some grace and more time.",
      "created_utc": 1727566475.0,
      "score": 3
    },
    {
      "id": "lper29o",
      "body": "Hi OP, I really hope you consider your words here. Yes this world is absolutely terrible to so many people and creatures. But there's no reason we can't try to work on our lives, ourselves- make things better just a little bit at a time. Just a little longer. You have so much time ahead of you. Please recognize I say this out of experience. Things can get better. It's overwhelming, but one piece at a time is all it takes. If it feels slow, time already spent will depreciate the lengthy feeling of time being spent.  \n\nI sincerely hope you don't leave this planet. You might not have everything you need right now, or maybe nothing close to it. But, as much as a stranger can platonically love another stranger, I believe I love you. \n\nYour words are beautiful, and sad. And I wish you understood that there's so much out there for you. I feel what you're saying, I've felt it myself before. I've written similar things many times.\n\nBut I'm changing my life. And you can too.",
      "created_utc": 1727563645.0,
      "score": 2
    },
    {
      "id": "lprpq4q",
      "body": "[removed]",
      "created_utc": 1727759704.0,
      "score": 1
    },
    {
      "id": "lpfix57",
      "body": "I've just been diagnosed with parkinsons I'm attractive 45vr old girl that has now lost everything , I'm looking up those sui*ide kits and hopefully go off into the sunset you have ur whole life ahead of u and ur healthy hang in there!",
      "created_utc": 1727574775.0,
      "score": 1
    },
    {
      "id": "lpg9ot7",
      "body": "I must admit, I'm a bit confused by your Original post, but if it is what I'm understanding, please, don't go through with it. You are far too young. Our minds can turn against us at any given time , due to outside factors and also due to spiritual warfare from the most terrible/sinister enemy in the history of humankind, Satan. Do NOT accept intrusive thoughts to take any root in your mind.",
      "created_utc": 1727587518.0,
      "score": 1
    },
    {
      "id": "lpf0raz",
      "body": "I'm glad it resonated in your heart. Since it moved you, I hope that's a sign you have a whole lot of connecting and love you have the potential to give. And we definitely need more of it. I do not encourage anyone to suicide. I said this in another comment, but I truly do believe a measure of suffering can improve quality of character such as  wisdom, compassion, or clarity. I want for you the strength and support that will aid you overcoming your challenges these upcoming months, years, and life. ♡",
      "created_utc": 1727567435.0,
      "score": 26
    },
    {
      "id": "lpgawe2",
      "body": "i love you, please don't leave us.",
      "created_utc": 1727588233.0,
      "score": 13
    },
    {
      "id": "lphcguc",
      "body": "What kinds of problems have you been facing recently?",
      "created_utc": 1727612533.0,
      "score": 3
    },
    {
      "id": "lpesh65",
      "body": "please give it more months",
      "created_utc": 1727564185.0,
      "score": 9
    },
    {
      "id": "lpet348",
      "body": "Thank you for encouraging me to think deeply. I agree twenty is horrifically young, and that young people in general are hasty. I'm aware that with sufficient time and growth, immense suffering can become a tool for becoming a better person in some way. Like an unexpected groundedness for the trials that life inevitably will bring, whether we deserve them or not, like you said. I know we (and most of all living things) are hardwired to need struggle to grow, thrive, and succeed. But in all honesty, these past two decades and childhood were a lot of suffering, pain, and trauma and I'm exhausted finding and flailing for more tools and systemic support to help me stay afloat. \n\nFor loving support, I am very, very lucky but father, sister, and friends can only do so much. The burden to save my life should be on my shoulders, not my friends and family. If I were dying against my will, I'd understand the moral imperative to save me but they cannot feasibly save my whole life.",
      "created_utc": 1727564418.0,
      "score": 15
    },
    {
      "id": "lpf1c0o",
      "body": "I don't normally write with this eloquent prose, haha. I think it's the sudden clarity and my will to write how my heart aches against all this pain and injustice nobody deserves. I hope that doesn't sound self-serving, my apologies if it does. Thank you for your suggestions. Treasures see treasures, then. ♡",
      "created_utc": 1727567667.0,
      "score": 12
    },
    {
      "id": "lpf0ti5",
      "body": "Thank you ♡",
      "created_utc": 1727567459.0,
      "score": 7
    },
    {
      "id": "lpfz4v6",
      "body": "Thank you sharing for your story. Another person reminded me not to be hasty, and seeing the same sentiment again moved me. If it is okay, I'd like to edit your story experience to make it more readable.  I truly appreciate your effort! \n\n\\_\\_\n\nFrom past experience, I say, \"Sleep on it, wake up the next day, and give it time,\" instead of making rash decisions.   \n  \nAround this time last year, I had spinal infusion surgery . My back was a wreck. I remember saying I wanted to go home right after surgery. I was in agony. What pushed things over the edge was that it took a long time to figure out what was wrong, along with the insurance games. (I don't know if I got this right?) Then, finally, the surgery.  \n  \nBy then, I was at my wit's end. The pain after surgery made it even worse.\n\nAnyhow, I kept wanting to go home. I was supposed to stay in the hospital for a few days, and then supposed to go home. Complications made my stay longer. As soon as I woke up from surgery, the pain was intense, and those complications pushed me over the edge.   \n  \nOn the flip side, those same complications kept me in the hospital.\n\nIf I had gone home, I’m 100 percent sure I would have ended my life. No question about it. I didn’t tell anyone because I was dead-set on it, which is why I wanted to leave so badly.   \n  \nBecause of the complications, I had to stay. The pain subsided, and most of the issues got resolved. Fortunately, there was no literal way to end my life there. My bed even had an alarm because of the fall risk after surgery.\n\nThat stay, though it sucked, saved my life. It was a blessing.\n\nThings improved with my spine over time too.\n\nTwo days ago, an employee asked me about the pain after surgery and back pain. I said to him him, “You know, the only reason I’m not dead is because I had to stay. Otherwise, I couldn’t have cared less about business or anything else.” The pain had tuned everything else out. Yes, I have a lot to live for, but pain can drive a person to that dark place and quick. \n\nHence the reason I now say, \"Give it time. Don’t make rash decisions.\"\n\nPrior to that surgery, I didn’t care. I was rash. Now, I had never really been bitten by that way of thinking either. I mean, I got mad at my boss in 2016, left a six-figure job with union benefits, and said, \"See ya.\" Even in business decisions, I’d been impulsive.   \n  \nThat surgery on September 22, 2023, changed my ways, and I'm more patient now too.\n\nIf you're feeling down, remember: \"No rash decisions.\" Give it time. It’s normal to need time to sort things out.   \n\\_\\_\\_  \n  \nThis reads like my dad. It made me smile :) I hope I did this justice. Again, thank you for sharing.",
      "created_utc": 1727581881.0,
      "score": 2
    },
    {
      "id": "lpfkz2k",
      "body": "Ah, this made me giggle. Kamisama Kiss is also my favorite shoujo manga! You have great taste! Nanami was the best and I aspired to be like her growing up. It's not quite shoujo, but I've been enjoying Skip and Loafer. There's romance, but the interpersonal friendships between girls make me just as happy. Your kindness is so, so sweet. ♡ You deserve the coolest shoujo bestie!",
      "created_utc": 1727575636.0,
      "score": 2
    },
    {
      "id": "lpgvaxj",
      "body": "[removed]",
      "created_utc": 1727601822.0,
      "score": 1
    },
    {
      "id": "lqb7w04",
      "body": "This is so kind! I wish I was as well-spoken as you say I am. I hope life treats you kindly and the smile this gave me comes your way somehow. Thank you.",
      "created_utc": 1728054618.0,
      "score": 2
    },
    {
      "id": "lqb72sg",
      "body": "I am so glad it made your day better ♡. I ended up surviving, so I'm staying around to sort my thoughts. Thank you, and I hope your days are kindest!",
      "created_utc": 1728054355.0,
      "score": 1
    },
    {
      "id": "lrr9w5j",
      "body": "Thank you for having faith in me! ♡ I wish nobody had to tolerate suffering to this extent. Thank you for not calling me a failure, and thank you for encouraging me.",
      "created_utc": 1728844075.0,
      "score": 1
    },
    {
      "id": "lprpyeg",
      "body": "I didnt go into detail but my dad did some pretty messed up stuff. He wasnt a bad person the drugs just made him lose himself so be kind please. I still regard him highly and miss him every second",
      "created_utc": 1727759834.0,
      "score": 1
    },
    {
      "id": "lpfmjjq",
      "body": "I am so, so sorry. I genuinely cannot fathom the fear that is being diagnosed with such a sinister neurological condition. I have faith in your autonomy and I hope this isn't too intrusive to say—please seek other resources that are mandated by a hospital or health organization. I'm not familiar with the country you are from or what is available to you, but I implore you to do that research first. At least in the U.S and Canada I'm aware there's resources that will help you if you are concerned about your dignity. Please, please do not trust what people sell online. People have been arrested for selling those kits. It is one thing to provide methods and resources on methods as a source of information but it is another to make a kit with instructions and materials and profit from it. For your safety, please do not continue down that rabbit hole. I beg.",
      "created_utc": 1727576292.0,
      "score": 6
    },
    {
      "id": "lpfrpih",
      "body": "I need to know about those kits. I'm at the point where I need to start looking them up as well and I wish I didn't.",
      "created_utc": 1727578518.0,
      "score": 1
    },
    {
      "id": "lpjexhe",
      "body": "Im just very apathetic after experiencing psychosis and life overall just feels like a mistake to me.",
      "created_utc": 1727638241.0,
      "score": 3
    },
    {
      "id": "lpevr24",
      "body": "I understand, but I disagree that surviving is wholly on your shoulders. If you were responsible for someone, would you not feel guilt if they killed themself? Communities strengthen each other, and I encourage you to seek strength from your family. You may not be a parent yet, but I usually think that’s when the effect of love becomes palpably clear: life is a challenge, and we must do our best to ensure those we care about recognize the support we can contribute.",
      "created_utc": 1727565454.0,
      "score": 5
    },
    {
      "id": "lpf5hq5",
      "body": "Not swlf-serving at all! No like it helped me so much! I started crying. You truly have a talent. \n\nMaybe you don't tap it often, maybe you should? \n\nAll love 💕",
      "created_utc": 1727569337.0,
      "score": 5
    },
    {
      "id": "lpgvbm3",
      "body": "You seem like you are stuck in seeing the ugly, and I have a problem with that too that I am trying to push through because I've been reminded of the beauty that life offers. The feelings (such as when you lie in a comfortable, warm bed under cozy blankets/comforters when it's chilly, or when you get to pet an animal like a dog/cat and get to feel the fluff brush against your skin, etc.), the panorama (just even seeing the sun and thinking how beautiful that day is, or feeling joy from seeing the rain as it gives the earth hydration and refreshes it, seeing the shapes of clouds transform between one thing to the other, the leaves in trees and bushes moving to the wind circling the air, etc.), and probably more than just these 3, but also the interactions you can have with the people in the world (connecting to people through the internet, making lifelong friends who are across the world, seeing someone express a great attitude and perseverance as they frolic down the street, speaking to a friend and enjoying some food/drinks and talking about just anything, you and your lover appreciating each other and expressing so much love to the other because they both make each other's days so much brighter just by \\*existing\\*, etc.\").",
      "created_utc": 1727601836.0,
      "score": 1
    },
    {
      "id": "lqddf0v",
      "body": "Look around, I'm not the only person saying it.\n\n\nI noticed that in a reply to another user, you mentioned that you don't normally write this eloquently. That it's a product of sudden clarity and sheer will. I'm sure you know yourself well enough and that's true. But it doesn't change the fact that this source you tapped into in order to write this is real.\n\n\nYou have something special in you. And other people resonate with it.\n\n\nThank you for your kind words.",
      "created_utc": 1728080117.0,
      "score": 2
    },
    {
      "id": "lqbwczx",
      "body": "Thank you also! I hope your days are kindest too.",
      "created_utc": 1728062441.0,
      "score": 2
    },
    {
      "id": "lrrtt8x",
      "body": "I hope that you get through whatever suffering you are going through right now. I hope that ten years from now this will all be a distant memory for you. And i hope you’re not just thanking me but agreeing with what I say as well.",
      "created_utc": 1728850485.0,
      "score": 2
    },
    {
      "id": "lpv6y3e",
      "body": "I see, this might be a silly question, but have you had therapy or something like that for your psychosis?",
      "created_utc": 1727813188.0,
      "score": 1
    },
    {
      "id": "lpez6ps",
      "body": "I relied on the support and strength from my family and friends many, many times. When I say survival is own my responsibility, I meant there are things that are literally out of my loved one's hands and which is my responsibility. \n\nIs my aging and retiring father (who doesn't own his own place) supposed to house me and provide me financial support to establish safe independence when he can barely afford to rent a one-bedroom? Is my sister supposed to heal my trauma and help me do my activities of daily living until I am lively enough to do it for myself and forgo her education? Are my friends supposed to come with me to my hypothetical workplace and intervene when I'm completely overwhelmed? \n\nLike how a therapist can talk and hear me out, though does nothing for the systematic/political/economical/situational issues I come back to outside their office that neither the therapist or I can control. I am not just taking responsibility for the product that is my mental illness, but addressing the above issues that leave me this choice in the first place despite how insanely difficult it is. It's hard, and I wouldn't wish that on anyone.",
      "created_utc": 1727566808.0,
      "score": 8
    },
    {
      "id": "lqds179",
      "body": "Thank you. I apologize, it wasn't my intention to undermine your words. I'll try to believe in the part of me that people see. Really, thank you! ♡",
      "created_utc": 1728085820.0,
      "score": 2
    },
    {
      "id": "lrxow99",
      "body": "Truthfully, I'm unsure if I'll even be here a week or a month from now. Faith and hope are precious treasures from anyone, and I’d hate to have been rude and insensitive in dismissing yours in my first reply. I don't know if I can be that strong, but still, I appreciate you. ♡",
      "created_utc": 1728938785.0,
      "score": 3
    },
    {
      "id": "lpxvw4s",
      "body": "Yes I have and it somewhat helped but the therapist I did have left. I miss them, it seemed like they did understood but I don’t think it’s enough. Ultimately it’s up to me in the end I think.",
      "created_utc": 1727852310.0,
      "score": 1
    },
    {
      "id": "lpf7n8p",
      "body": "OP, I want to say - I feel for you, I really do. I think I'm in the exact same position.\n\nIt feels as if there's so much light and beauty beyond me, and I can recognize it's there, but I am simply stuck in the abyss of the ocean. The light is so far beyond me that I'll never be able to see it.\n\nI'm facing the decision of whether or not to euthanize my horse. He was hospitalized earlier today, but the vet called me a bit ago. They sent me a video of him trying to get up, thrashing about a bit. He's so young - only 6-8 years old, and should have 20+ years ahead of me, and they seem to want me to put him down. I can't. If he goes, I go.\n\nYou sound so incredibly smart, and the world needs people like you. If nobody brings the light, everyone who's in the dark will stay there. I wish I had some better words to say, but it seems like those who bring light will have those who bring the dark take it away, just as they've always done.",
      "created_utc": 1727570188.0,
      "score": 7
    },
    {
      "id": "lpf311u",
      "body": "Therapists are there just to help you deal with your issues. If you can truly isolate your issues among the political, social, and economic, there may be resources to help you there.\n\nYou are not the first to experience this, nor the last. If you need assistance in the various realms above, let’s seek a solution. \n\nI know more than you may realize the pain you wouldn’t wish on anyone, so don’t limit yourself to psychological support if it’s not enough.",
      "created_utc": 1727568357.0,
      "score": 4
    },
    {
      "id": "lqev0m4",
      "body": "No pressure, take things at your own pace. I wish for you to find the strength that you need to get through the harder things. <3",
      "created_utc": 1728103326.0,
      "score": 2
    },
    {
      "id": "lx94rw5",
      "body": "Hey, I really do hope you’re still here with us. Sending my best wishes and lots of hugs.",
      "created_utc": 1731673710.0,
      "score": 2
    },
    {
      "id": "lryulfl",
      "body": "Please no, you haven’t been rude or insensitive at all. Don’t worry about that. I will be praying you realise your own strength, deciding to stay with us for far longer. I will check up on you a month from now and hope you’ll be in a better state of mind then.",
      "created_utc": 1728953688.0,
      "score": 1
    },
    {
      "id": "lq1d2tg",
      "body": "I’m sorry to hear that, I can imagine that must have been gutting. Have you tried to look for a new one since?",
      "created_utc": 1727902684.0,
      "score": 1
    },
    {
      "id": "lpf531g",
      "body": "I've looked for resources. I really, really tried. The fact that I am not the first to experience, nor the last, is heartbreaking but I empathize. I am so sorry you feel this pain. Thank you for being gracious and patient with me.",
      "created_utc": 1727569173.0,
      "score": 5
    },
    {
      "id": "lxj7wh5",
      "body": "I'm sorry, I was conflicted how I should answer, it made me happy! I'm not doing okay and I still have plans, but that is disappointing to come back to. I'm doing my best, but I'm not enough. No matter, thank you very much for caring. I hope you have a bright and wonderful day ♡",
      "created_utc": 1731810847.0,
      "score": 2
    },
    {
      "id": "lxj9uuo",
      "body": "Just knowing that you’re still here has made my day brighter. I applaud you for doing your best and I think that’s more than enough, you’re more than enough. Please continue being a strong upstanding person and I’m sure all these plans will become nothing but memories of a distant past very soon.",
      "created_utc": 1731811628.0,
      "score": 2
    },
    {
      "id": "lxjexdl",
      "body": "You're more than enough too. Thank you for your kindness. I'm trying really hard to do my best and not forsake it's worth. I hope all your goals come to fruition and your future self is beaming. Thank you!!",
      "created_utc": 1731813659.0,
      "score": 2
    },
    {
      "id": "lxjh1jb",
      "body": "Thank you so much. I kinda have a lot of things going on in my life simultaneously right now and your kind wishes really do mean a lot. I’ll be trying my very best as well!",
      "created_utc": 1731814527.0,
      "score": 2
    },
    {
      "id": "lxjkm6z",
      "body": "You can do it! I believe you can do all the things your happy, beaming self can accomplish! It's hard, but I believe in you. Happy luck!!",
      "created_utc": 1731816000.0,
      "score": 2
    }
  ]
}