{
  "id": "1gszg48",
  "title": "The world is fake, people are fake, life is fake.",
  "selftext": "\nThe whole world feels like one big fake, as if we’re stuck in a Black Mirror episode or a South Park episode. All the shows and movies are fake, the food tastes fake, the topics we talk about are fake and a bunch of crap, and everyone knows it, but everyone goes along with it because everyone else does. Everyone lies to each other, fakes friendships, kindness, interest, and emotions – nothing is real. Everyone is shallow, focusing on the most trivial stuff and even getting recognition for it, while people who try to understand and explore existence are mocked and excluded. I feel like a giant child thrown into an unknown environment, unable to understand anything, even though this world has been my home for decades. I would love to leave it forever.\n",
  "created_utc": 1731798090.0,
  "score": 501,
  "num_comments": 56,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1gszg48/the_world_is_fake_people_are_fake_life_is_fake/",
  "comments": [
    {
      "id": "lxiy8zp",
      "body": "[removed]",
      "created_utc": 1731807101.0,
      "score": 83
    },
    {
      "id": "lxjdsi0",
      "body": "I think this is a little bit like our connection to still being animals speaking right. I feel this so heavy you know. When we were animals we would run around and just eat and sleep. Focus on surviving yk. Now we think about rent? The correct amount to tip? What content to post not post? It’s alien to an animal and sometimes your body just goes what is happening right now like this isn’t right. Who knows the real reason you know something to think about. Hope everything is okay dude, gets tough sometimes bro.",
      "created_utc": 1731813207.0,
      "score": 35
    },
    {
      "id": "lxjodlq",
      "body": "I just thought about this tonight not gonna lie like If I was out in the wilderness none of this would matter just me and nature- not what I look like, how it doesn't look like the others and being inside for 12 hours a day in the kitchen I forget what the sun looks like and I'm just tired. Of it all. And I don't even bother with posting because it's never right or popular. Sorry, I don't get the game of fakery",
      "created_utc": 1731817679.0,
      "score": 19
    },
    {
      "id": "lxkft32",
      "body": "I can relate to this. That’s why I stopped going out & socializing with anyone. I am home 24/7 I feel like I don’t belong in this world; I am more drawn to the past than the present. I wish everyday I was born in a different time.",
      "created_utc": 1731832835.0,
      "score": 16
    },
    {
      "id": "lxjp6at",
      "body": "Yes it feels so alone living with fake people.",
      "created_utc": 1731818050.0,
      "score": 13
    },
    {
      "id": "lxjubhq",
      "body": "[removed]",
      "created_utc": 1731820478.0,
      "score": 7
    },
    {
      "id": "lxk8ggz",
      "body": "Everything you said supports your conclusion except the word “feel”.  Feeling negative and frustrated must mean you know the opposite positive emotions.  \n\nYour post made me feel sad and empathy.  But at the same time, it validates my feelings and my humanity. Thank you, friend.  \n\nI often find thinking about my inner child and how I can make them smile when I am down.  What makes your soul and inner child smile?",
      "created_utc": 1731828071.0,
      "score": 6
    },
    {
      "id": "lxik9cz",
      "body": "[deleted]",
      "created_utc": 1731801888.0,
      "score": 24
    },
    {
      "id": "lxk9807",
      "body": "I hope you find your people you can talk to about shit. It makes all the difference.",
      "created_utc": 1731828548.0,
      "score": 6
    },
    {
      "id": "lxjefmi",
      "body": "Wow everything you said resonates. Except some people seem to thrive and even enjoy this. Not me though.",
      "created_utc": 1731813460.0,
      "score": 3
    },
    {
      "id": "lxidcci",
      "body": "Youre right life might feel fake or without reason many days but i gotta remind ya its the only life you have got make the most of it, maybe find things you enjoy doing in life, join some club thst you enjoy doing help someone. Theres so much you can do as a person. I belive if i were to see you today you would be a lifesaver :)",
      "created_utc": 1731799302.0,
      "score": 4
    },
    {
      "id": "lxjqnqt",
      "body": "Someone who thinks the same way as me\n(Should I even be thinking this way at the age of 13?)",
      "created_utc": 1731818745.0,
      "score": 1
    },
    {
      "id": "lxjztuq",
      "body": "Yes. Yes it is.",
      "created_utc": 1731823207.0,
      "score": 1
    },
    {
      "id": "lxkog36",
      "body": "My deepest depressive episode was about solipsism. I thought I was the only one in the world and I was creating my reality, and that life didn't make sense because either it ended or it continued forever. \"Life doesn't make sense\" was a deeply upsetting thought for me. Now, the same sentence reassures me. I'm living life to live it, and nothing else matters.\nIt is a difficult point to get to, I know, I'm not here to teach everybody how to think, just to give my experience.",
      "created_utc": 1731838619.0,
      "score": 1
    },
    {
      "id": "lxlodx9",
      "body": "If everything is fake, then is this philosophy also fake? When you were born, was that fake?",
      "created_utc": 1731856521.0,
      "score": 1
    },
    {
      "id": "lxm1abi",
      "body": "It would have been much better to be born with a personal manual you can access telling you this before you have to go in blind. Basically, I like everything you said. It's like there are the people that enjoy the fake, and then the people that don't.  These two people mixing creates hell on earth for the one that can see the fake in the world.",
      "created_utc": 1731860935.0,
      "score": 1
    },
    {
      "id": "lxm3vrr",
      "body": "i relate to you lol",
      "created_utc": 1731861788.0,
      "score": 1
    },
    {
      "id": "lxm96iy",
      "body": "Yeah I mean I know for a fact now I’m dead, this post really solidified that for me",
      "created_utc": 1731863546.0,
      "score": 1
    },
    {
      "id": "lxnez41",
      "body": "i think you put it perfectly in words.",
      "created_utc": 1731877013.0,
      "score": 1
    },
    {
      "id": "lxsilv4",
      "body": "Well, we live in the age of technology. A lot of this is due to less social interaction and more reliance on media. All fake and inspired fake, mostly for money.",
      "created_utc": 1731953316.0,
      "score": 1
    },
    {
      "id": "lxj5mro",
      "body": " Narrow is the path to righteousness",
      "created_utc": 1731809947.0,
      "score": 1
    },
    {
      "id": "lxmbdvj",
      "body": "I wish I was born like 15000 years ago. Even if I get killed by a tiger or something at a young age I would live a better and more rewarding life than I could today.",
      "created_utc": 1731864282.0,
      "score": 21
    },
    {
      "id": "lxkhpzc",
      "body": "what time would you be born in if you could choose??",
      "created_utc": 1731834105.0,
      "score": 1
    },
    {
      "id": "lxkgt4v",
      "body": "I had these thoughts while seeing clips of the fight",
      "created_utc": 1731833499.0,
      "score": 3
    },
    {
      "id": "lxj5na9",
      "body": "Hahahaha",
      "created_utc": 1731809953.0,
      "score": 1
    },
    {
      "id": "lxkglgr",
      "body": "Yeah you'r right",
      "created_utc": 1731833355.0,
      "score": 1
    },
    {
      "id": "lxkizsd",
      "body": "I think the 80's were prime humanity",
      "created_utc": 1731834958.0,
      "score": 5
    },
    {
      "id": "lxpb3lt",
      "body": "Honestly any time between 1800 & 80’s",
      "created_utc": 1731901056.0,
      "score": 2
    },
    {
      "id": "lxkk7ka",
      "body": "yeah boomers have it good, i was late 90s.. i saw some of it, i was alright. Everyone going to arcades all the time was fun. why do you love 80s so much??",
      "created_utc": 1731835775.0,
      "score": 2
    },
    {
      "id": "lxklkaz",
      "body": "\nIn the West, there was enough technology to avoid dying from smallpox at the age of two or having a leg amputated without anesthesia due to a minor foot infection. But not so much that the entire population was glued to screens, consuming brain-rotting content for most of their waking hours. Because of the reconstruction after the post-war period, the economy boomed, and you really got something for your money, like being able to afford a home. Life was simpler and freer, I think. People were more human and not brainwashed by decades of meaningless entertainment industry—at least not to the extent they are today. I wish I could have been an adult in that era.",
      "created_utc": 1731836684.0,
      "score": 3
    },
    {
      "id": "lxpbd8q",
      "body": "Same here! I got a glimpse of the 90’s life but as a little kid. I try to revive the little memories I still remember from that time everyday so I can never forget it",
      "created_utc": 1731901166.0,
      "score": 2
    },
    {
      "id": "lxkm0ao",
      "body": "ah calm before the storm.. everything was in\nprototype mode and so early that there was a healthy balance. I completely agree but growing up in that era is why you see so many sci fi apocalyptic . films.. they knew it was gonna take over and eventually be used in dubious malicious ways. like anything tbh. We also had a much better healthcare system too that wasn’t completely focused on profit only- the way it is now. Yeah being a boomer would be the life fr, you avoid most of the messed up shit it seems. Who knows though what’s the best timeline",
      "created_utc": 1731836984.0,
      "score": 2
    },
    {
      "id": "lxpcor8",
      "body": "So true! Even dating was more meaningful before the swiping  BS dating apps; people would meet in person & ask you out on a date because that was the only way back then, there was no competition",
      "created_utc": 1731901702.0,
      "score": 2
    }
  ]
}