{
  "id": "1f6315w",
  "title": "My husband wants a girlfriend and I just want to die",
  "selftext": "My husband of 20 years wants a girlfriend and I told him he can and it’s alright. I’ve been in bed since and I really just want to die. I loved him with everything I had and now I feel like such an idiot. I shared my entire life with him. I’d feel like even more of an idiot if anyone found out I killed myself over a boy but I’m horribly lonely and feel completely abandoned. I wouldn’t be around to feel embarrassed \n\nEdit: to answer some questions, he has a girlfriend in mind. He met her on work trips. She lives across on opposite coast from us (USA) she asked him out according to him. I am completely financially dependent and have no savings, only debt, a car loan, student loans, credit card bills. I think my plan is to get a job and get to a place where I could leave. Reassess from there. I’d feel more confident if I didn’t need him so much. He can have his fucking side relationship but I’m my new hobby is going to be myself. I know it’s not as healthy as ending things immediately but I can’t afford it. Thank you everyone, your kind words mean so much to me ",
  "created_utc": 1725154528.0,
  "score": 476,
  "num_comments": 160,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1f6315w/my_husband_wants_a_girlfriend_and_i_just_want_to/",
  "comments": [
    {
      "id": "lkxbpz4",
      "body": "what made you say yes to him having a gf?",
      "created_utc": 1725155337.0,
      "score": 281
    },
    {
      "id": "lkxgajr",
      "body": "That’s not how that works. Honestly, you should just divorce him. Or go get a boyfriend. He pressured you into an “open marriage” and traumatized you because of it. I’m trying to recover from an open marriage, and because I couldn’t handle it. We’re now possibly getting divorced (a bunch of crap happened, it’s my fault I recognize)\n\nEdit a word",
      "created_utc": 1725157224.0,
      "score": 153
    },
    {
      "id": "lkxiub9",
      "body": "[removed]",
      "created_utc": 1725158263.0,
      "score": 78
    },
    {
      "id": "lkxzgum",
      "body": "Honestly as someone dealing with this and who has let her husband have a girlfriend. Leave him before the pain gets worse. \n\nYou are going to feel pain either way, sitting back and being a second option or a back up, hurts worse than letting go. Or even trying it and then letting go. \n\nThe amount of pain I have put myself through has been ridiculous. Please do better than me and learn from my mistakes.",
      "created_utc": 1725165938.0,
      "score": 52
    },
    {
      "id": "lkxm8nr",
      "body": "First, I'm very sorry you have experienced this shock to the system and your life. I know it's devastating. I know you'll wonder how you'll go on. It is a big uphill climb out of this despair, I'm not gonna sugarcoat it. \n\nSecond, make NO rash decisions. Be smart and be calm. Calmness will be your guiding hand through this. Anger, arguments, shouting, etc will be your demons.  Do NOT fall victim to the moment. It'll be very easy to lose your cool when there's confrontation but you MUST be the level-headed one. \n\nThird, do not beg or plead with him. That will NOT work. It'll only render you powerless. A calm, cool, confident demeanor will give you the upper hand. It might in fact drive him to anger and rash decisions on HIS part knowing you're stronger than he ever thought. \n\nFourth, go ahead and protect ALL your assets. Move all your money and investments into your own name, with secure passwords. If there are any joint credit cards, cancel them immediately or if possible, remove him from the account. Do this! Do it regardless of the long-term outcome. Anything else that is joint accounts, do whatever you can to get them in your name. \n\nFifth, under no circumstance do you move out. I repeat, do NOT move out. He is the one that needs to do that. if he's reasonable (which clearly he's not), then he'll be the one who needs to leave. \n\nSixth, if there are children, do NOT get them in the middle of this. No matter who's at fault, your children deserve to love their mom and dad regardless of the situation between you and your wayward husband. In time, they can discern the truth for themselves. Kids are wise. \n\nSeventh, do not rush to date. Don't do anything out of retribution. You'll only end up disrespecting yourself for it. You'll know in due time, which may be a long time from now, when you're ready to step back out there. Now is not the time. \n\nNow, about your husband: He's in a middle-aged fog. He's likely already caught the eye of someone, I assure you. Be it at work, the gym, online, or somewhere, he's already got his eyes set on someone or they may be chasing him. I wouldn't be surprised if he has a dating profile. This \"need\" of his didn't just come out of the blue. \n\nI'm of the belief that the more you fight and chase and plead and cry, it'll only push him away further. I'm more of the mindset to just 100% take care of yourself and if you have kids, take care of them. Act as if it's already a done deal. Move forward. Be active with your life. Securing all your possessions and finances should keep you busy enough for awhile, but do other things to keep you running. Gym, walks, church, work, art, weekend trips or day trips, etc. \n\nFinally, I'll say this: I know it sounds like I'm suggesting you're already on the path to divorce. I'm not though. What I'm more stressing right now is that you CANNOT be caught blindsided (again) by further actions from your husband. If he does get involved with someone else, there is no telling what his brainwashed mind could get up to. He could try to cut you out of any number of things in your life - finances, house, cars, possessions, kids, etc. So best to just set everything in motion as if it is headed for the worst outcome. \n\nYou have been dealt an awful blow. It very much is like a death. You are allowed to grieve. Even if he comes to his senses, a part of the innocence of your life has died. It's a sad realization. I'm so sorry for that. But you can and will be resilient. You can persevere. Just hang in there and please reach out, like you've done, if you feel you're desperate. \n\nWishing you strength!",
      "created_utc": 1725159679.0,
      "score": 44
    },
    {
      "id": "lkxvljk",
      "body": "TIME FOR A DIVORCE! ",
      "created_utc": 1725163966.0,
      "score": 25
    },
    {
      "id": "lkz2j7d",
      "body": "I thought I was going to shrivel up and die when I left my (now ex) husband. \n\nInstead, it was a renaissance for me. I finished college, went to law school, and now I’m a practicing attorney and part time judge. I say all that not to toot my own horn but to tell you that while it seems like you’ll literally die from this, it can actually cause you to “kill” your old self (figuratively) and become a woman he wouldn’t be able to have in his wildest fucking dreams.",
      "created_utc": 1725190528.0,
      "score": 10
    },
    {
      "id": "lkxewoa",
      "body": "He must have been unhappy for awhile or something to just straight up tell you he needs a girlfriend or it’s over between you two. That’s horribly selfish and inconsiderate of him. You deserve better",
      "created_utc": 1725156654.0,
      "score": 39
    },
    {
      "id": "lkxl5l8",
      "body": "Let him go , he isn't worth it . You deserve someone who will love you , screw him",
      "created_utc": 1725159217.0,
      "score": 20
    },
    {
      "id": "lkxefmh",
      "body": "God I hate guys sometimes. What a scumbag. I’m sorry… you should take this as an opportunity to find a boyfriend of your own.",
      "created_utc": 1725156455.0,
      "score": 74
    },
    {
      "id": "lky36yh",
      "body": "It feels terrible now and that is because you are tying your destiny to a dead end and an empty promise. \n\nYour relationship is already over. And YOU WILL BE OK. \n\nIt will hurt, but it’s time to empower yourself and get the strength to break up with him. It will hurt for a bit. Maybe even a few months. You have tried so many chords around this relationship as it’s a 20 year relationship. I get it. \n\nBut move on.  Then focus on yourself and building yourself up. \n\nDo you want to go to college? Restart? Move? Go to another place?",
      "created_utc": 1725167966.0,
      "score": 7
    },
    {
      "id": "lkxv05y",
      "body": "Tell him you are trading him in for a new model, too!",
      "created_utc": 1725163676.0,
      "score": 12
    },
    {
      "id": "lky2jgf",
      "body": "Hey OP!\n\nI want you to know that you aren't alone. My best friend just came out to her husband that she would rather be with a woman. He agreed to let her date while they stayed in the marriage. While they seem happy with the decision, I can tell you that deep down, it had nothing to do with him.\n\nShe confided in me weeks ago that she'd like to divorce him but has to wait until her kids are grown (stupid, yes, but I can't fix stupid.) She even went so far as to say that she loves him and doesn't want to leave, but I think it's just because she'd be broke and alone without him.\n\nSo, more than likely, this has nothing to do with you and more to do with him. In all honesty, he probably is too scared to leave and it's why he's forcing you into this situation. It's only because it's still comfortable for him. But the real question is, is it comfortable for you? It sounds like it's not. And at that point, for your own mental well being, it's best to move on.\n\nYou should look into sunken cost fallacy, and maybe look up a therapist to talk about these things.\n\nReddit isn't the best place for advice 🤷🏻‍♂️ but it might help point you in the right direction. \n\nI hope things get better, OP.",
      "created_utc": 1725167601.0,
      "score": 4
    },
    {
      "id": "ll0axdb",
      "body": "Ahhhh that was his most polite way of saying I’m done with you but will keep you around if I can still use you too sometimes. He’d probably toss you out if you said no with zero hesitation bc in his head he /gave you a choice/ and you chose. Sounds manipulative.",
      "created_utc": 1725207324.0,
      "score": 5
    },
    {
      "id": "lkzgmip",
      "body": "Don’t ever Say yes to something just because you think they’ll realize how insane it is, or they won’t do it out of respect.. Trust me… Never works.",
      "created_utc": 1725196937.0,
      "score": 4
    },
    {
      "id": "lkxm82c",
      "body": "I'm sorry.\n\nNot everyone is into polyamory/non-monogamy.\n\nHe should have revealed this side of him to you BEFORE you got married and spent 20 years together. \n\nIt sucks ass, I know, but you deserve someone who DOESN'T want other partners and just wants YOU.\n\nYou may need to rethink the marriage and decide if you want to divorce or not.\n\nYes, 20 years is a lot, but so is wanting a gf when you're married.",
      "created_utc": 1725159672.0,
      "score": 8
    },
    {
      "id": "lkxj9g8",
      "body": "I don't know what I'd do in that situation but I know if I stayed I'd never have sex with my husband again. But I know I'd also feel horrible so I'd probably feel the same. I wouldn't be able to leave my husband since I'm unable to work and have no income.\n\nHoping you can find a way to leave him 🫂",
      "created_utc": 1725158432.0,
      "score": 5
    },
    {
      "id": "lkz7zb1",
      "body": "Do you have children with him?",
      "created_utc": 1725193302.0,
      "score": 3
    },
    {
      "id": "lkzdu7c",
      "body": "I'm so sorry everyone is giving you a hard time about THE WRONG THINGS.  I know why you said yes.  People have no idea how devastating a position you are in.  You *invested your life* with this person.  Him demanding a girlfriend is equally as bad as him leaving.  People don't understand how truly devastating ending such a long relationship is.  To do so will involves years of pain and suffering on its own.  It's terrifying and NOT RIGHT.\n\nCan you find your anger?  Is it in there?  It may be the only thing that can save you right now....  This vile man has made you feel unwanted, not enough.  You don't deserve that.  This man has shat on your sacred vows.  You.  Don't.  Deserve.  That.  Twenty years.  Twenty years of loyalty and love... down the drain??  YOU DON'T DESERVE THAT.\n\nLovely lady... this man is threatening your very livelihood.  Not only should you divorce this chump - you should take him for everything he's got.  He DOES NOT DESERVE YOU and when you leave his ass, you deserve to take everything with you and never have to struggle.\n\nBut first, some therapy love.  Do it in secret if you can and must.  Look after #1 beautiful and that's you.",
      "created_utc": 1725195836.0,
      "score": 3
    },
    {
      "id": "ll1ah4x",
      "body": "leave that dude. not worth your heart.",
      "created_utc": 1725219172.0,
      "score": 3
    },
    {
      "id": "ll1m98v",
      "body": "This is why I don't believe in marriage. I'm so sorry you're going through this 😞",
      "created_utc": 1725223149.0,
      "score": 3
    },
    {
      "id": "lkxk37p",
      "body": "Go back and say NO! \n\nAnd then have a think why you said yes x\n\nBut please don't die for his betrayal of trust and bond. Plus marriage is a contract! \n\nSending you huge loving hug x",
      "created_utc": 1725158774.0,
      "score": 7
    },
    {
      "id": "lkxmat0",
      "body": "It’s very unfair of him to bring up this ultimatum. Has he asked about this in the past ?",
      "created_utc": 1725159704.0,
      "score": 5
    },
    {
      "id": "lkxuvaz",
      "body": "you need to leave him. i know you love him and you see him through rose tinted glasses but to the public eye, he is a LOSER. a HORRIBE husband and he sounds pathetic. he does NOT deserve you. many men would kill to have a dedicated woman like you. your should be ex husband is not enough for you, NOT the other way around.",
      "created_utc": 1725163609.0,
      "score": 5
    },
    {
      "id": "lky4ga9",
      "body": "Alright, and go get yourself a boyfriend! \nWatch him crumble 🙃🙃🙃🙃",
      "created_utc": 1725168686.0,
      "score": 6
    },
    {
      "id": "lky73gv",
      "body": "You not deserve this go. It’s hard and it’s painful but you can start a new life and you can find a new person in life therapy and talking about can help.",
      "created_utc": 1725170259.0,
      "score": 2
    },
    {
      "id": "lkyjgh7",
      "body": "Tell him he can have a girlfriend any time he wants but he will instantly lose his F’ing wife. \n\nI wouldn’t even say that to my wife as a joke",
      "created_utc": 1725178196.0,
      "score": 2
    },
    {
      "id": "lkynhci",
      "body": "Your husband is an adulterer, he has no right to another girlfriend. I feel very sorry for you.",
      "created_utc": 1725180909.0,
      "score": 2
    },
    {
      "id": "lkyvdkz",
      "body": "Sweetheart, if u leave now, it'll hurt without a doubt, but it will also get better in 1-3 years. But if u stay in this mess, it will destroy you in the long run. Please don't torture yourself. I know you love him, and you might question if he loves you at all. Love or not, you would not do this to someone you care about. This is bound to end anyway. U better leave with minimal damage.",
      "created_utc": 1725186183.0,
      "score": 2
    },
    {
      "id": "lkz2s17",
      "body": "Let him have a gf then dispute for a divorse and take all his money coz he will be a betrayer in court of law",
      "created_utc": 1725190663.0,
      "score": 2
    },
    {
      "id": "ll0yd0s",
      "body": "you’ll always want to die over feel a feeling you can only feel while living",
      "created_utc": 1725215050.0,
      "score": 2
    },
    {
      "id": "ll1bn0a",
      "body": "You have an income and assets because you can file for divorce, lock him out, and sue for half his assets, as well as spousal support. Take his money on vacation and go meet yourself a real boy. Don’t let Pinocchio over here manipulate you. I’m not one to tell someone to leave. I’d tell almost anyone to work it out. But not you. You deserve better. Kick him to the curb like trash. ",
      "created_utc": 1725219567.0,
      "score": 2
    },
    {
      "id": "ll2lhs9",
      "body": "I am so sorry for you and fully empathize and I'm fairly certain you actually own half of everything he has, especially 20 years, and he has half your debt, so apart from the heart break which will heal faster than you think, especially if you let yourself truly live and put yourself in the public arena. Not all men are like this, same as not all women are the negative features found in many of them. You will brick by brick take a break and find you built alot while in autopilot just going through the motions but do not settle for that extortion, take half his stuff, give him half your debt, realize you came out crisp and DO NOT TAKE IT BACK WHEN IT REALIZED ITS LITTLE FANTASY OF SELFISH DISREGARD DIDNT PAN OUT! For all he knows it's just a homewrecker who tests men into ruining their foundations for sport beaten having no more challenge to compete for, or she asked it out (if she even actually did and not just mixed signals or half ego fantasy) not knowing he was 2 decades married etc. No matter what, especially cross continent immoral relationships will not actually last, he probably thinks he's some catch because a female he is attracted to actually showed him the least bit of attention lol. I van guarantee you thst you will have no problem finding another partner, or many, maybe don't invest atleast too soon and go around sharing the love and that 50% marital property will be a nice little leg up to start your next phase of life which will absolutely be so exciting and stellar, and don't look back at all!!!! If you simply put yourself in the public arena, I promise you will quickly fins social networks that can't wait to have you join them and even support networks for people in similar despair. You'll get an easy peezy little job to start with and even consider brainstorming business ideas you would actually be happy to go to and grow day by day, find like minded others maybe interested and I can promise you that the best and most creative and innovative ideas are captured and comprehended when the mind in a chaos state like yours is now. Don't show that coward a single tear, agree to divorce and stsrt just going out as much as you can and not everything requires money, my happiest and wildest eras of my life were when I was dead broke and had to actually get creative to occupy my time and id meet people and I do art also so my most creative phases were when I had no money for resources and had to be conservative and crafty. You can start reselling on marketplace and other sites just to get that palm itchy and hunger and drive, and like I said brick by brick is how everything is built, starting at 1st step requires a trustworthy autopilot so just repeat the motions in a step by step plan and I promise you your life is about to get truly exciting and you've actually been hoarded away from the world by a selfish child that doesn't appreciate its life, and I don't know your physical factors but no matter what they are, start a healthy exercise and diet regimen, drink lots of water and pick your best face to go out everyday and be kind and polite, compliment strangers with genuine compliments, smile at people and laugh often. Your hopefully ex husband will be in for a very regrettable time I can promise and that's all there is to it. It might stsrt saying stuff like \"why didn't you dress, exercise/diet and present yourself for me until you weren't mine anymore?\" That's all just tactics to make you feel as though it was your fault and don't fall for them. I hope you the very best and I'm so serious, like whatever time it is there now, whatever the very next morning is, I beg you to tune in and get focused and ready because everything WILL BE INCREDIBLE IF YOU LET IT BE!!!! Even if making it jealous is your initial fuel, that's OK just sooner than later let yourself and your life be your motivation and purpose. I wish I could know you and see how much everything I am promising you will actually happen but women ALWAYS HAVE THE UPPERHAND AND OPPORTUNITY WHEN IT COMES TO FINDING PARTNERS! ALWAYS! That's why I appreciate them and am never cruel or betray them even if it doesn't pan out or we don't get too serious I always appreciate the love they were generous with and they can really shatter self esteem so there's that factor too lol. I've been in a relationship as long as 12 years and been in very short ones or only 5 years on and off, and everything in between was being a bit of a slooot admittedly but never mean or deceived them, when that happened I always made it clear I am not capable of being in a committed relationship without dropping the ball bad so while I'll happily only be with you while we are, I can't rightfully commit to that because I am a mess and a loser trying to get to a better status and a relationship would inhibit that, but I still need love lol. I hope you play the field and share your love responsibly until love finds you, and don't punish other people for what it did to you, they aren't it and don't deserve that while still protecting yourself. I bet you are a super catch and will find unlimited opportunities!",
      "created_utc": 1725236105.0,
      "score": 2
    },
    {
      "id": "ll2yksj",
      "body": "You can go to a shelter and they'll help you start over. File for divorce immediately to get spousal support, you can get that before the divorce is finalized sometimes. I had to leave mine with my kids and no plan. I was very dependent thanks to abuse and giving up my career but we took it one day at a time. You can do it.",
      "created_utc": 1725241312.0,
      "score": 2
    },
    {
      "id": "ll34ea7",
      "body": "So he wants the perks of having both a wife and girlfriend. Totally not fair to you. I get how hard it is to let things go. My fiancé of 7 years left for someone 22 years older then her. It took me almost a year to make some hard realizations and among other things, trust isn’t there. If he does decide to leave permanently I’d certainly make sure he continues to support you financially based on principle. I’m sorry you’re going through this and it feels like nothing helps either.",
      "created_utc": 1725243669.0,
      "score": 2
    },
    {
      "id": "ll5crm4",
      "body": "Translation of his sayings = I want to open our marriage despite me knowing how you feel about it given I, husband should know u better than anyone else and because your feelings are not a priority to me, matter of fact that's why I got a backup plan so I can replace you as soon as I want, but at the same time I'm not risking getting my ass dumped by my backup plan so I'll maintain my safe spot in case things go wrong with the backup plan, and given I already intended to cheating on you either way at least I can do that without remorse and it won't feel like cheating if you accept it whatsoever.\n\nSolutions? Dump his egoistic ass asap because I promise you, it'll only get worse further down the line, if you're being candid with yourself from what you aforesaid, you're basically acknowledging that you can \"tolerate\" it but it's not your ideal of what your relationship should be like, but here's the kicker, a relationship is a two-way street. If you're the only one willing to put in any sort of effort then it's indubitably doomed to fail, trust me that's gonna be a good riddance",
      "created_utc": 1725286236.0,
      "score": 2
    },
    {
      "id": "lkyeb04",
      "body": "I honestly would've left his ass the moment he offered it! what a complete lack of respect! his basically letting you know that his bored in the relationship and you're no longer enough to fulfill his needs!! \n\neven if it hurts I'd rather be alone than being with someone who would casually put me through this headache of a situation! After all the times and years you've invested in this relationship...this is clearly something you do not deserve! \n\nYou could either try talking to him about the distress it makes you feel and see where that leads you two. \nalthough in my opinion...with just him offering it. he already killed the Relationship.",
      "created_utc": 1725174790.0,
      "score": 1
    },
    {
      "id": "lkyfryc",
      "body": "Either he wants an open marriage or he already cheated by getting a girlfriend behind your back before asking for an open marriage and now wants your permission for an open marriage so that he doesn't feel bad for cheating. What are his terms for the \"open marriage\"? Is he the only one who's allowed to have a side partner or are you also allowed to have one? Do you each pick out your own? Or are you picking someone to share? Is he sharing his girlfriend with you? Are you allowed to date her too? Or is he only allowed to have her? How would he feel if you told him you wanted a boyfriend? Would he be jealous or would he be okay with it?",
      "created_utc": 1725175749.0,
      "score": 1
    },
    {
      "id": "lkym9qi",
      "body": "I’m so sorry to hear this. You devoted your whole life to a person whom you thought was your everything only to come around to be betrayed by the person itself who didn’t feel the same way towards you after all the years\n\nI feel the same to a certain degree with someone in my life, but for better or for worse, the person for me, we never even ended up in a proper relationship nor a marriage. Nevertheless, the time we had spent for that person, only for it to come to nothing now, it is a very painful feeling of meaningless-ness especially when the connection was like the entire world to us\n\nPerhaps, I understand how it feels a bit. Just like you, along with the realisation & acceptance that there doesn’t seem much else to look forward to in life, I have slowly, very slowly, feel like life is indeed such a dread & being unable to get out of bed, having only the feeling of wanting to die, I feel you :]\n\nI’m responding to your post, because I empathise with you & I understand you, & I don’t know, I hope that provides a bit of comfort to you, because from your post for me to feel empathetic, provides a little to me too. I don’t really have a lofty plan or advice for you on how to get out of the rut. I don’t know much else about you nor what’s at stake or what’s in your life to be better informed & support you properly. I only wish you the very best. I’d be happy for you if you can find strength in anything to keep striving. I’ll be here if you continue to need to express yourself",
      "created_utc": 1725180095.0,
      "score": 1
    },
    {
      "id": "lkz5uok",
      "body": "either get a bf or divorce his ass when you truly love someone you dont ask for \"open relationships\"",
      "created_utc": 1725192264.0,
      "score": 1
    },
    {
      "id": "lkz8feb",
      "body": "Imagine all the energy you’ve given over years and years… and you are a vacuum.  Now use your vacuum to pull all that energy from all that time back into your heart, body, and mind.  You are complete.  He is sick, and you must get away because you are not sick.  You have an even greater life than what you’ve been living, waiting for you to let this phase go.  Your angels won’t let anything leave you unless they’ve got a greater stage to move you into.  Congratulations on graduating from this little man.",
      "created_utc": 1725193511.0,
      "score": 1
    },
    {
      "id": "lkzyy1k",
      "body": "Leave him and he will realize that he lost everything. You deserve to live happy. Take your stuff and savings and go on a long retreat in a new place. You will heal. And he will feel like an idiot for losing everything over some infatuation.",
      "created_utc": 1725203406.0,
      "score": 1
    },
    {
      "id": "ll05xpp",
      "body": "Calling your husband a \"boy\" gives me fake post vibes",
      "created_utc": 1725205701.0,
      "score": 1
    },
    {
      "id": "ll1a1lt",
      "body": "Get a good man. Divorce and get a good husband. Do not live like this, but do not die either.",
      "created_utc": 1725219024.0,
      "score": 1
    },
    {
      "id": "ll1o0hb",
      "body": "Or you can leave??",
      "created_utc": 1725223736.0,
      "score": 1
    },
    {
      "id": "ll1rz82",
      "body": "Do you have a friend or family you can go to? Fuck that guy, it’s not worth staying in a relationship like that, no matter how many loads and dept you have",
      "created_utc": 1725225070.0,
      "score": 1
    },
    {
      "id": "ll23skw",
      "body": "Two can play that game. Get yourself a boyfriend and see how he likes that.",
      "created_utc": 1725229317.0,
      "score": 1
    },
    {
      "id": "ll2ad8c",
      "body": "If he wants a girlfriend, I say it’s time you get a boyfriend 😉",
      "created_utc": 1725231776.0,
      "score": 1
    },
    {
      "id": "ll3mi7h",
      "body": "I couldn’t ever do that if I got asked to have a side relationship and got suicidal thoughts it would’ve taken me over I would’ve been dead",
      "created_utc": 1725252023.0,
      "score": 1
    },
    {
      "id": "ll3syjh",
      "body": "The fact that you're financially dependant on him makes it really hard to give any advice. Whether you leave him or not now will not lead to a good outcome. However, I think he will just get rid of you one day when his gf gets more itimate with him, and the longer you stay the more depressed you'll become. So if you can, stay with him for a little while, while trying to get a job, find a new place to live, new people to be around and then leave him. Really sorry for your situation and wish you luck on your journey. (Sorry for my English somewhere)",
      "created_utc": 1725255553.0,
      "score": 1
    },
    {
      "id": "ll3wykp",
      "body": "As I read your post, I was reminded of the movie, Dolores Claiborne. I hope that you’re able to pick yourself up and see your worth independent of that man who has emotionally manipulated you.",
      "created_utc": 1725257920.0,
      "score": 1
    },
    {
      "id": "ll41sed",
      "body": "It's alright it will be alright someday somehow don't think this is you're fault sometimes people get bored\n.they don't know what they loose until they loose it",
      "created_utc": 1725260905.0,
      "score": 1
    },
    {
      "id": "ll4vfgq",
      "body": "Darling, divorce him. It's incredibly hard to see right now, but choosing to walk away would hurt less than watching the man you can't help but love be with someone else. \n\nHe's the one who will see in the long run that the grass is not always greener.",
      "created_utc": 1725279335.0,
      "score": 1
    },
    {
      "id": "ll5279x",
      "body": "Damn, this made my stomach churn",
      "created_utc": 1725282247.0,
      "score": 1
    },
    {
      "id": "lmiu5fi",
      "body": "I’m confused. Why can’t you say you changed you mind and it’s not ok. Let him try to divorce you and take half if not more",
      "created_utc": 1726012228.0,
      "score": 1
    },
    {
      "id": "lkz0j8q",
      "body": "Chad privilege is real lol",
      "created_utc": 1725189405.0,
      "score": 1
    },
    {
      "id": "ll1xn10",
      "body": "This is usually the first step in him planning to leave.  Unfortunately it is extremely common within polyamory.  He's testing his new relationship out to make sure it will work before committing to leaving you, and will inevitably find some minor thing you did and blame that as the catalyst for why he ended up leaving.  That way he can still feel like the good guy who did nothing wrong.  After all, this type of relationship is something you both agreed upon.   I'm not blaming you, I'm just saying this is a story that has been retold thousands of times, as people engage more and more in \"ethical non-monogammy.\"\n\n  One route you could go, you need to tell him you love him.  You've devoted 20 years of your life to this man, and it is wrong for him to use and discard the years you've given him.  You want to make the marriage work, and you're willing to do what you have to do in order to save it.  Get a job.  Go out and get hobbies.  Be someone he wants to chase again.  Lots of wives revert to sweat pants and messy buns.  Don't be like that.  Buy a dress that makes you feel beautiful and wear it.  He has caught you and knows that you're so reliant upon him, you'll always be available for him.\n  \n  I advise asking him what kind of woman flirts with, and indulges in a relationship with a married man?  Why wouldn't she do the exact same thing with someone else?   \n Another route to consider: You're not dealing with your husband.  You're dealing with your husband's penis.  You could also ask if he will sign a postnup that entitles you to the house and a percentage of his income for a number of years, and you'll leave without a fuss.  If he refuses, you could notify his HR dept that he is in a relationship with another coworker.  \n\n  I am so sorry you're going through this.  It is utterly cruel and wrong.  I have been through what you have, and their relationship didn't even last 4 months.  Once I was out of the way, there was no woman to compete with and she lost interest.   My ex is now married to a land whale who is virtually immobile, and he must spend his non-working hours getting bitched at by her, because no one else wants him.",
      "created_utc": 1725227048.0,
      "score": 0
    },
    {
      "id": "ll2oyy9",
      "body": "The trad wife dilemma after she hits 40.",
      "created_utc": 1725237474.0,
      "score": -1
    },
    {
      "id": "lkxljh6",
      "body": "[removed]",
      "created_utc": 1725159383.0,
      "score": -11
    },
    {
      "id": "lkxc0ho",
      "body": "He said we’re over if he can’t have another relationship. I’d rather attempt to live with it in theory. It’s not life I’d feel any happier if he left me completely",
      "created_utc": 1725155458.0,
      "score": 230
    },
    {
      "id": "ll06ryi",
      "body": "Yeah if he's allowed to have a girlfriend she should show up the next night with a new boyfriend and see if he's ok with it",
      "created_utc": 1725205968.0,
      "score": 19
    },
    {
      "id": "ll1n0ls",
      "body": "get a boyfriend then divorce him! find someone that brings you more happiness then he did",
      "created_utc": 1725223404.0,
      "score": 2
    },
    {
      "id": "ll4rd6v",
      "body": "I don't think she wants a boyfriend if she loves her husband...",
      "created_utc": 1725277374.0,
      "score": 1
    },
    {
      "id": "lkz3cua",
      "body": "Sorry to ask and you can skip the answer if you want, but why did you let your husband have a girlfriend in the first place?",
      "created_utc": 1725190976.0,
      "score": 7
    },
    {
      "id": "lmiuk01",
      "body": "Sorry to hear that. \n\nDid you think you would be ok with it or did you feel like you had no choice. \n\nI’m so confused about this concept of a GF or boyfriend when already married. I understand a casual fling in an open relationship but I don’t really understand how a husband can be dating someone.\n\nEdit: ignore the first question. I see you answered it already :)",
      "created_utc": 1726012377.0,
      "score": 1
    },
    {
      "id": "lkz0osv",
      "body": "This is the BEST advice.  I wish I had someone to tell me this before I went through all I went through.",
      "created_utc": 1725189494.0,
      "score": 15
    },
    {
      "id": "ll4tqgk",
      "body": "She doesn't want to though. It sounds shit but I think she has to win him over",
      "created_utc": 1725278536.0,
      "score": 1
    },
    {
      "id": "lkxoyak",
      "body": "He probably already has a girlfriend or one in mind",
      "created_utc": 1725160854.0,
      "score": 43
    },
    {
      "id": "lkxhyr8",
      "body": "What does he have going for him? Guys want to have a side chick and don't realise how shit it is out there for attached guys on the dating apps. Ladies tend to have greater choices and have higher probability of picking up if they explore the meat market. Just saying.",
      "created_utc": 1725157905.0,
      "score": 21
    },
    {
      "id": "lkxez0w",
      "body": "Thanks. He says I should date other people too but it looks miserable out there and I hate people",
      "created_utc": 1725156681.0,
      "score": 37
    },
    {
      "id": "lkxvkjy",
      "body": "To be fair lots of guys won’t do this. Only a deeply insecure person would coerce their spouse into an open marriage. ",
      "created_utc": 1725163953.0,
      "score": 7
    },
    {
      "id": "lkxv6rn",
      "body": "Better yet, just start going out as if you have someone waiting for you!!! Don't say who, what, anything. Just go...",
      "created_utc": 1725163767.0,
      "score": 7
    },
    {
      "id": "ll1uxlp",
      "body": "He would have absolutely left me if I didn’t agree to let him date other people. I couldn’t have said no and kept the relationship",
      "created_utc": 1725226087.0,
      "score": 3
    },
    {
      "id": "ll1upit",
      "body": "I fully expect him to follow through and I don’t think he’ll ever realize how bad it is for me unless I kill myself over it. I’m going to work on myself and work on my finances. If he’s still doing this when I’m ready to take care of myself I’ll leave him. It looks really attractive rn to leave him a note and end myself in our bed where he would have to find me, but I know it would be stupid",
      "created_utc": 1725226008.0,
      "score": 3
    },
    {
      "id": "ll4iuoa",
      "body": "Poly folks don't generally use it as an ultimatum... he's not poly. He's selfish and manipulative.\n\nSource: am poly.",
      "created_utc": 1725272429.0,
      "score": 2
    },
    {
      "id": "ll1tqzc",
      "body": "Luckily no",
      "created_utc": 1725225676.0,
      "score": 2
    },
    {
      "id": "ll1e65k",
      "body": "sorry, i didn't notice what subreddit i was on. i would have gone about it a bit differently.",
      "created_utc": 1725220416.0,
      "score": 1
    },
    {
      "id": "lkxkimw",
      "body": "She said she said yes cause he told her it's over if she don't",
      "created_utc": 1725158952.0,
      "score": 8
    },
    {
      "id": "lkyiurd",
      "body": "Now isn't the time for that. You only hurt yourself more by rushing into sleeping with someone to hurt the other person back. And you'll feel like a hypocrite for doing what you are damning them for",
      "created_utc": 1725177793.0,
      "score": 4
    },
    {
      "id": "ll1onwv",
      "body": "Yup! He gets a girlfriend and I live with it or I have to leave",
      "created_utc": 1725223955.0,
      "score": 1
    },
    {
      "id": "ll1skru",
      "body": "My family isn’t close and they live on the other side of the country. I have a good friend here but I would hate to ask to impose and live with her for long. If I keep my head down at home and build myself up I think I’d have more luck than storming out with nothing and end up being a burden on the only friend I have",
      "created_utc": 1725225274.0,
      "score": 1
    },
    {
      "id": "ll23z39",
      "body": "He says he would be happy for me to date other people, but I would rather die. Dating sucks",
      "created_utc": 1725229382.0,
      "score": 2
    },
    {
      "id": "lkxd4u7",
      "body": "it’ll be hard to think about but truly sit and think can you live with your sigificant other having a girlfriend? if the answer is no, then i think it’s better to be alone. being alone is scary but it’ll set you free once you realize this situation is holding you back. i think every person deserves to be in a relationship with someone who is loyal to them. just because this person is the best you’ve ever had doesn’t mean they’re the best that’s out there.",
      "created_utc": 1725155920.0,
      "score": 212
    },
    {
      "id": "lkyc9dn",
      "body": "That's manipulative AF and you're better off without him. And I say thag as someone who's had several open/polyamorous relationships. \nEnding things with him will hurt for a while, but not forever.",
      "created_utc": 1725173493.0,
      "score": 36
    },
    {
      "id": "lkyr68i",
      "body": "if your husband said that, then he doesn’t love you. talk to a therapist and MOVE ON. love yourself please. your husband is trash",
      "created_utc": 1725183375.0,
      "score": 19
    },
    {
      "id": "lkz9tj6",
      "body": "What a manipulative asshole. He knows you'd rather make a compromise than leave him. He wants to have fun while still having the \"benefit\" if being married. He wants the excitement of having a wife AND a GF. YOU leave him. Tell him you're done. Meet him with divorce papers. And yes, I know Reddit is fast with \"DIVORCE\", but it's a case where it is sadly a logical option.\n\nBut let's focus on your mental health first, that is what matters the most. It's for your own good. Accepting his ultimatum is betraying your own values, and accepting his betrayal (because he clearly doesn't respect your values either) won't do you any good. I won't pretend like he was always a manipulative jerk, I don't know, maybe he was an angel, but people change... You need to take care of yourself. I hope you're not really planning about dying. I understand the sentiment, but he's not worth it, you'll be fine. Your life is taking a sharp turn in an unexpected direction, but you can manage. What frightens you? Was he a sole provider and you were depending on him financially?\n\nShort term, you'll feel worse being alone, medium to long term, you'll feel better than if you accept that he has a gf. Did he even have a proper discussion with you about *why* he wants that?\n\nI want to stress that there is nothing wrong with polyamory. It has nothing to do with you not being enough. No matter why, his values changed. It might be a very small consolation to think that he's not cheating and had the \"decency\" of asking you, but in reality he wasn't really asking, he was imposing it. So it's time to turn the page. You can still cherish the years you've had together, but I think it's over.\n\nAnd obviously coming to terms with that is a challenge of its own, but I honestly think that it's better for your own mental wellbeing than stay there and accept that he has a gf. Especially because the way you frame it, it wasn't a respectful discussion. That's really the main issue, not that he wants a gf.",
      "created_utc": 1725194145.0,
      "score": 8
    },
    {
      "id": "ll364tw",
      "body": "Abuse",
      "created_utc": 1725244394.0,
      "score": 2
    },
    {
      "id": "ll39d9u",
      "body": "People telling you to just dump his ass like this is their favorite drama series are irresponsible and self centered.  \n\nYou're doing the right thing by taking it slow and working on gaining independence.  I'm proud of you for acting on your self worth.",
      "created_utc": 1725245783.0,
      "score": 2
    },
    {
      "id": "lkz3w9a",
      "body": "Honestly if I would've asked myself if I would've let that happen I would have said no. But similar to what OP said, I would rather have someone I love and want to spend my life with have a girlfriend than lose them forever. Especially after such a significant period of time being together. (Mine was a 12 year relationship) At least, that was my thought process then. \n\nHowever, the moment he asked me, I didnt realize at the time, was the moment I had already lost him. If not prior to that.",
      "created_utc": 1725191262.0,
      "score": 6
    },
    {
      "id": "ll7au82",
      "body": "But if she does think that, it would only be because she has low self esteem and needs to work on herself not because her husband deserves it.  He literally manipulated/coerced her. If she stays, he’s just exploiting her vulnerabilities. \n\n Either way, no judgement. It’s her decision and I hope she does whatever she thinks is best for her. ",
      "created_utc": 1725309659.0,
      "score": 1
    },
    {
      "id": "lky2g74",
      "body": "I was gonna say this.",
      "created_utc": 1725167551.0,
      "score": 11
    },
    {
      "id": "lkxk6ib",
      "body": "And quite frankly you prob felt marriage to be safety",
      "created_utc": 1725158813.0,
      "score": 10
    },
    {
      "id": "lkxfk5w",
      "body": "But do what you please. I think once you stand up for yourself, and he gets a taste of life without u, he’ll snap back into shape",
      "created_utc": 1725156925.0,
      "score": 17
    },
    {
      "id": "lkxfgtj",
      "body": "Ah, I’m sorry. I personally think you shouldn’t let it fly. You should say and let him leave if he wants. It will hurt, but I think it’s the best thing to do.",
      "created_utc": 1725156887.0,
      "score": 7
    },
    {
      "id": "lky1rdf",
      "body": "I have often heard of cases where the guy wants an open relationship, then the Mrs ends up meeting plenty of new men and having fun. The guy doesn't have as much success. You reap what you sow.",
      "created_utc": 1725167172.0,
      "score": 9
    },
    {
      "id": "ll1vi0s",
      "body": "Run fast, run far, run now.  Your suicidal thoughts will relax once you have escaped that environment. Go to someone you know who loves you. Start putting your life back together.  You are worth it.",
      "created_utc": 1725226288.0,
      "score": 2
    },
    {
      "id": "lkxkmrz",
      "body": "Fuck...what a horrid thing to do :(",
      "created_utc": 1725159000.0,
      "score": 6
    },
    {
      "id": "llf5l63",
      "body": "I was saying it to cause spite. obviously just to show that you can get a bf too, not to sleep with someone to heal. that’s never gonna work and i agree.",
      "created_utc": 1725425039.0,
      "score": 1
    },
    {
      "id": "ll1uncp",
      "body": "You deserve so much better. Why settle for someone who has no concern for you? This is not love.",
      "created_utc": 1725225986.0,
      "score": 1
    },
    {
      "id": "ll1vmzs",
      "body": "Trust me, I was in a similar situation, it’s worth giving up comfort over letting someone stomp all over you and losing your dignity. You deserve better, and you can give yourself a better life, even if it takes time. It’s really not worth putting up with someone who is gonna treat you the way your husband treats you. The pain and disrespect is not worth it, girl",
      "created_utc": 1725226336.0,
      "score": 1
    },
    {
      "id": "ll2tsq2",
      "body": "I’m so sorry you’re going through this. Stay strong and find a way out.",
      "created_utc": 1725239389.0,
      "score": 1
    },
    {
      "id": "lkxejgi",
      "body": "I’m just so upset I’m not enough after everything I did for him. Like he had most of my life to test drive me and NOW he wants something extra. Thanks",
      "created_utc": 1725156500.0,
      "score": 142
    },
    {
      "id": "lkzcljv",
      "body": "Obviously she can't!!  Stop hounding her on this attempt to reconcile and irreconcilable choice!  SHE IS POSTING IN A SUICIDE CHANNEL BECAUSE OF IT.  This is not the way to help.",
      "created_utc": 1725195331.0,
      "score": 11
    },
    {
      "id": "ll7hh1b",
      "body": "It's really just a truly shitty heartbreaking situation. Honestly wish her the best and I'm sure whatever happens she will end up better off than she currently is. What a poor woman",
      "created_utc": 1725311908.0,
      "score": 1
    },
    {
      "id": "lkxvf4v",
      "body": "This is not the answer. \n\nYou need to leave unless you’re actually open to polyamory which clearly you’re not. \n\nNo time for games girl. ",
      "created_utc": 1725163881.0,
      "score": 30
    },
    {
      "id": "lkxoqea",
      "body": "Yeah first time she starts to appear happy he will change his mind.",
      "created_utc": 1725160757.0,
      "score": 16
    },
    {
      "id": "lkxm5nv",
      "body": "You Are enough! This is his problem. There is nothing wrong with you. Mid life crisis on his end, just wait till he figures out he isn't in high school anymore. The best revenge is living well.",
      "created_utc": 1725159644.0,
      "score": 112
    },
    {
      "id": "lkxffkw",
      "body": "i’ve been in a similar situation so i can tell you it has nothing to do with you being enough or not enough. think of it this way. do you do everything your partner asks or needs? like support them, help them, clean the house, compliment them, love them? (just examples) if so then the problem is not you. the problem is them. i did everything for my ex but they still decided to cheat on me. the problem was not because i wasn’t enough the problem was because they couldn’t control themselves. \neveryone is worth being treated with compassion and consideration from their partner.",
      "created_utc": 1725156872.0,
      "score": 37
    },
    {
      "id": "lkyik2y",
      "body": "It’s not that you’re not enough for him, it’s that he’s selfish and heartless. Please don’t let this man make you feel like you’re not enough, because it’s simply not true. Give your love and attention to someone who gives it back and you’ll see in time that it was him that was bringing you down all along and you never deserved it.",
      "created_utc": 1725177601.0,
      "score": 15
    },
    {
      "id": "lkyujet",
      "body": "Omg they’re all like this. Seriously. So selfish to just want and want. The more you give, the more they take and don’t appreciate. Like big babies with pubes. I PROMISE you the best thing to do is pack up your shit and leave. I wish I did that right away when my (now ex) husband was acting like that!  But I stayed and begged and cried. I read everything I could under the sun. Everyone said to leave. I thought they just didn’t know how OUR relationship was different. He does NOT respect you! It’s gonna be hard at first, but it’ll be 100 times worse if you lose your self respect in the process.  Good luck",
      "created_utc": 1725185626.0,
      "score": 12
    },
    {
      "id": "ll1ouse",
      "body": "He’s just a dick. Sorry and I get that you are still fond of him. No decent guy would make an ultimatum like that - especially if you’re financially dependent. He knew what he was signing up for when he got married. We all get tempted and the grass is always greener, but part of being an adult is learning about self-control and responsibility.",
      "created_utc": 1725224021.0,
      "score": 3
    },
    {
      "id": "ll7ts8h",
      "body": "Yeah they both need help tbh. She’s been victimized and he needs to stop exploiting people’s vulnerabilities. ",
      "created_utc": 1725316301.0,
      "score": 1
    },
    {
      "id": "lkze6hs",
      "body": "Oh please. Women treat men like dogshit - “dick is cheap” as they say. But sure men are out here making things so damn difficult. 🙄",
      "created_utc": 1725195973.0,
      "score": -7
    },
    {
      "id": "ll3i63b",
      "body": "Well, in OP’s case the man is garbage. Some men are dipshits, just like some women are. It’s not specifically a gender related thing. My point is, that can we please stick to the topic?",
      "created_utc": 1725249811.0,
      "score": 2
    }
  ]
}