{
  "id": "1kdbn23",
  "title": "I’m so sorry to the little girl I used to be",
  "selftext": "You had so many aspirations and noble dreams. You loved everyone dearly, unconditionally and was so pure of heart. You had dreams of changing the world or at least of leaving it in a better state than the one you found it in. I look at pictures of you with such a bright smile and with your whole life ahead of you, and I cry. I don’t know what happened. I’m so sorry that you had your heart broken and shattered so many times. I’m sorry that you were made to feel ugly or that you weren’t worth anyone’s time. I’m sorry that people’s misdeeds, hurtful words, and careless actions shaped you. I’m so sorry that the harsh reality of life withered you down to the evil monster that came to take your place. You had everything. A loving family, a future, and so many dreams. I’m the one who took everything from you. I’m the one who fucked it all up. I’m the one who is considering ending it all so that the pain can finally stop. So that I can selfishly stop suffering. I’m so sorry that I can’t be you anymore. I’d do anything to just bring you back. I’d give everything and anything to have been your guardian angel and protected you so that you would have never had to suffer. If I knew for certain that taking my life could take me back to your innocence, I’d do it in a heartbeat but I don’t know anything anymore. I’m just tired now. ",
  "created_utc": 1746219411.0,
  "score": 593,
  "num_comments": 44,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1kdbn23/im_so_sorry_to_the_little_girl_i_used_to_be/",
  "comments": [
    {
      "id": "mq9nlw7",
      "body": "I only see a few of your recent comments and what you've posted here, but it looks like you try to help people. It looks like you recognize love, the love of your family, and the love of others. In other words, you are the same person you were as a little girl. A layer of pain may obscure your view of her, but she's still there.\n\nI don't know how to dissipate that layer, but I'm willing to bet you still have a whole life ahead of you, and there is still hope. I like to think that if you can recognize that the goodness you saw in your youth is still out there, you can recognize the potential in your own life that still remains.\n\nI'm saddened that life's cruelties have affected you so negatively, but I hope you take your inner voice's recommendation to live and forgive yourself and others. Please take care, as we need more aspirations, noble dreams, and bright smiles in this world.",
      "created_utc": 1746220772.0,
      "score": 70
    },
    {
      "id": "mqama4v",
      "body": "I feel like I could have written this.",
      "created_utc": 1746232671.0,
      "score": 37
    },
    {
      "id": "mqaum5w",
      "body": "Wow it seems like I wrote this I am going through of what you are . I am sorry to the little girl I used to be too. ",
      "created_utc": 1746235730.0,
      "score": 24
    },
    {
      "id": "mqay0j6",
      "body": "Hey, I just want to say first: I hear you. And I feel you. You’re not alone.\n\nThat little girl you’re grieving? She’s still in you. She’s bruised, tired, maybe hidden deep inside—but she’s not gone. That bright smile, those dreams, that huge heart—they didn’t vanish. Life just weighed you down with pain that was never yours to carry.\n\nYou’re not a monster. You’re someone who’s been hurt and who’s doing the best they can to survive. That pain you feel doesn’t mean you’ve failed. It means you’ve been fighting harder than most people can even imagine.\n\nYou didn’t ruin her life. You protected her the best you could with what you had. Maybe you didn’t always get it right—but you’re still here. That means something. You’re still here with her, even when it feels like you’ve lost her.\n\nPlease be gentle with yourself. The fact that you can write something so raw and honest means your heart is still alive, still loving, still real. And the fact that you’re feeling this much? That’s not weakness. That’s proof you still care—and that’s power.\n\nYou deserve to heal. You deserve another chance. That little girl wouldn’t want you to give up—she’d want you to fight for her. And that doesn’t mean fixing everything all at once. It means breathing through the next moment. Getting through the next day. Finding tiny pieces of light, even in the dark.\n\nYou’re still becoming. And you’re not alone",
      "created_utc": 1746236995.0,
      "score": 24
    },
    {
      "id": "mqahy42",
      "body": "i relate so hard to this",
      "created_utc": 1746231087.0,
      "score": 12
    },
    {
      "id": "mqawwzm",
      "body": "I feel like I wrote this myself? I relate to every single aspect of this. I’ve self-sabotaged my entire life and now it’s crashing down. I really hope it gets better for us l, I’m so sorry you’re going through this. Just know you are not alone",
      "created_utc": 1746236593.0,
      "score": 8
    },
    {
      "id": "mqaih61",
      "body": "I relate so much to you, but I don't have a family anymore",
      "created_utc": 1746231281.0,
      "score": 7
    },
    {
      "id": "mqayc0k",
      "body": "I understand where you’re coming from—it’s completely understandable after going through so much pain. It’s really hard to stay optimistic and positive. When I was younger, I was very passionate and determined. I had so many dreams. But then the world kept rejecting me in every way, shape, and form. Eventually, I just gave up on it all. And now, I feel like I’m just existing in time, while nothing is really happening",
      "created_utc": 1746237115.0,
      "score": 6
    },
    {
      "id": "mqbbhwt",
      "body": "this pretty much summarizes what goes through my mind everyday",
      "created_utc": 1746242362.0,
      "score": 7
    },
    {
      "id": "mqblat1",
      "body": "i feel you bro. sometimes you forget what you were even like as a child as you grow up because you notice the people you interact with are more often than not jackasses, and people will always use their hatred and narrow-mindedness to fuck others up...",
      "created_utc": 1746246796.0,
      "score": 6
    },
    {
      "id": "mqbrxb6",
      "body": "Those with means to do good, are sniffed out by our dumbest humans, and repeatedly discouraged. \n\nOur modern world has to be 80% shitheads at this point. It's not your fault, I'm sorry your hope has been destroyed. Ours has too.",
      "created_utc": 1746250258.0,
      "score": 7
    },
    {
      "id": "mqa9q9f",
      "body": "yep I can relate, it's clear that socia. emotional learning curuclim that they implemented in school means fuck all when you nearly get shoved down the stairs by a little bastard (happend to me).",
      "created_utc": 1746228190.0,
      "score": 3
    },
    {
      "id": "mqbgh3m",
      "body": "Your a great person. I feel you",
      "created_utc": 1746244516.0,
      "score": 3
    },
    {
      "id": "mqbursh",
      "body": "I think others have said what needed to be said. I don’t know the circumstances that happened but I want to send you a warm hug. 🤗 you are going through a tough time. Take some time to rest and blank out. When you are ready you will have some clarity on how you want to proceed. I myself finally got on a new antidepressant and it took a couple weeks but I feel a million times better and can now work towards my dreams because I left the dark hopeless place I was in. Take Care. 😘",
      "created_utc": 1746251851.0,
      "score": 3
    },
    {
      "id": "mqceofk",
      "body": "The fact your aware of this proves your not a monster, I wish I could talk in life and make a more meaningful connection,that little girl is still there",
      "created_utc": 1746264102.0,
      "score": 3
    },
    {
      "id": "mqea3ow",
      "body": "Damn. Truer words have never been spoken.",
      "created_utc": 1746290869.0,
      "score": 3
    },
    {
      "id": "mqkpfry",
      "body": "I feel this a lot. A lot. I can't look at my childhood pics because I'm reminded of how much I failed that kid. She was so intelligent and always the class topper and now I can't even study for 30 minutes straight. she was so righteous, such a family loving girl. So pure , no dark thoughts at all. And now she is a disappointment in everyone's eyes because of my actions.",
      "created_utc": 1746382387.0,
      "score": 3
    },
    {
      "id": "mqu43bz",
      "body": "I felt this 100%",
      "created_utc": 1746507621.0,
      "score": 3
    },
    {
      "id": "mr03crw",
      "body": "Not only do I deeply identify with the state this person is in. But I think what resonates the deepest is the end. I don’t know anything anymore. I’m just tired",
      "created_utc": 1746586285.0,
      "score": 3
    },
    {
      "id": "mr1ep0h",
      "body": "hey sis, want to talk? exchange memes maybe",
      "created_utc": 1746611448.0,
      "score": 3
    },
    {
      "id": "mr1mw31",
      "body": "I feel the exact same. I had a brain injury 3 y ears  ago from the wrong person and lost my life, the little girls we were deserved better, it's not your fault you are hurt, if you're a monster now, it's not your fault. I'm sorry you don't believe there's hope. I don't believe I have hope either.",
      "created_utc": 1746615827.0,
      "score": 3
    },
    {
      "id": "mqgsqhk",
      "body": "Hey, OP. I know its been hard. That girl that you are talking about, still lives inside you. She fought so hard against everything life threw at her for you to have a chance.\nThat girl might get scared somedays, and doesn't understand everything that is happening, but she is not alone, and she would be so happy to see you gave her a chance, even with something as small as breathing or talking today.\nShe doesn't need you to be perfect, she doesn't need you to keep believing in yourself as she did back then. She just needs you to give yourself one more chance to heal. To grow. Because both of you deserve it.\nSo please keep going, even if its one breath at a time. ❤️‍🩹❤️‍🩹",
      "created_utc": 1746321858.0,
      "score": 2
    },
    {
      "id": "mr41wyg",
      "body": "This made me cry",
      "created_utc": 1746643480.0,
      "score": 2
    },
    {
      "id": "mrbdj1d",
      "body": "Would say the exact same thing to little me. Thanks. Everyone in my life except my dad did this to me.",
      "created_utc": 1746739304.0,
      "score": 2
    },
    {
      "id": "mulscfu",
      "body": "I'll help you bring her back if you want. You can do it.",
      "created_utc": 1748387841.0,
      "score": 1
    },
    {
      "id": "mqrlcfs",
      "body": "holy shit i connect to this on a spiritual fucking level. its fucked up but i kind of feel more at ease seeing so many people feel this way, i mean obviously i dont want anyone to feel sad but this makes me feel less... alone? if anyone else is reading this ily all we got this ish",
      "created_utc": 1746475780.0,
      "score": 1
    },
    {
      "id": "mqva12x",
      "body": "man, this really makes you cry a bit. and i relate to this too much. hope you get through this bud and you will, i pray.",
      "created_utc": 1746531824.0,
      "score": 1
    },
    {
      "id": "mqwffqc",
      "body": "I want you to know that, that little girl would probably be prouder than you could ever imagine for keeping on fighting 🫂🫶that little girl is still and will always be a part of you",
      "created_utc": 1746545624.0,
      "score": 1
    },
    {
      "id": "mq9pgyu",
      "body": "This! This is beautiful! I are worth it op, u are so worth it friend!",
      "created_utc": 1746221359.0,
      "score": 21
    },
    {
      "id": "muf0vu1",
      "body": "This made me tear up",
      "created_utc": 1748297676.0,
      "score": 2
    },
    {
      "id": "mqssqcd",
      "body": "I was thinking the same thing. Amazing how we all have our unique experiences, yet can relate this much. Reminds me that I’m not alone. Has me crying over here.",
      "created_utc": 1746489587.0,
      "score": 5
    },
    {
      "id": "mqaynkl",
      "body": "All I can do is weep knowing I could never go back. I wish I would have listened when people said to enjoy your youth while you have it.",
      "created_utc": 1746237235.0,
      "score": 10
    },
    {
      "id": "mqb5ic2",
      "body": "I’m so sorry that you can relate to this. The world is not kind and especially not to little girls with big dreams. It is so difficult to feel like you’re drowning in pain and that the only way out is by becoming numb to it all. I hope everything works out for you and that you can create new dreams with the new version of yourself that as you so beautifully put, still reflects the innocent children we used to be. I’m so sorry but we will get through this, we have to get through this.",
      "created_utc": 1746239903.0,
      "score": 6
    },
    {
      "id": "mq9t8cs",
      "body": "thank you both so much. I’ll keep these words close whenever it starts to get dark again. I hope everything works out for both of you and life blesses you endlessly.",
      "created_utc": 1746222570.0,
      "score": 31
    },
    {
      "id": "mqcg8i8",
      "body": "We all make that mistake,hence the saying ' youth is wasted on the young' , the amount of times I was told these are the best yrs of your life is insane, I'm past my 20s , made a lot of mistakes but god or whatever you believe graced me with time to change and redeem myself,now I think the best thing I can do with whatever time left is be useful to people and my community,and especially people in pain, emotional pain, mental turmoil, call it whatever, I need to be good to myself to help others, broken tools fix nothing, anyway, you'll be ok, reach out, you'll meet someone that'll change your live, what kills me is everyday I walk down the street I pass people whom are as lonely or worse than me, and all it woul take is politely stopping someone and asking them to join you for a coffee or whatever but we are just scared of rejection, it's a shame",
      "created_utc": 1746265114.0,
      "score": 3
    },
    {
      "id": "mqdi6d3",
      "body": "Thank you. I was raised Catholic but I never truly believed in the faith and was especially turned off by the real world politics and historical baggage by the time I became an adult. Now I’m trying to see faith in a new light, especially through the confession of sins and repentance. I’m asking God for the strength to move past this, not for my salvation but to at least live for my parents while I still have them. I have not hurt or killed anyone but ik if I take my own life that is exactly what I would be doing. I think what you said about connecting with your community is the most important thing we can do right now. Try to break out of our dark clouds and listen to other people and their struggles for a change. Going on this Reddit page and talking to people is good step in the right direction I think.",
      "created_utc": 1746282039.0,
      "score": 3
    },
    {
      "id": "mqu4eb9",
      "body": "UK clears USA",
      "created_utc": 1746507772.0,
      "score": 0
    }
  ]
}