{
  "id": "1i909hb",
  "title": "Had to go to school with rope burn on my throat",
  "selftext": "I tried to hand myself last night, i tied a rope to a lamp, i was hanging for about 40 seconds then the lamp broke, nobody noticed so i just went to bed, Well this morning i woke up with the worst rope burn of my life, i put my sisters makeup on it but we had pe today and i think my teacher noticed because she stared me down the whole time, what the fuck do i do now",
  "created_utc": 1737738318.0,
  "score": 602,
  "num_comments": 46,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1i909hb/had_to_go_to_school_with_rope_burn_on_my_throat/",
  "comments": [
    {
      "id": "m8zegmn",
      "body": "The PE teacher is almost certainly gonna have to call CPS.",
      "created_utc": 1737754040.0,
      "score": 167
    },
    {
      "id": "m8ykn5y",
      "body": "i would recommend reaching out to someone. if not your parents a counselor. not sure of your age or location so sometimes they have to report things. Do you trust the PE teacher as someone you could confide in?",
      "created_utc": 1737745570.0,
      "score": 197
    },
    {
      "id": "m8xvocm",
      "body": "Im sorry you had to go trough that. I dont think theres much you can do just take care of yourself.",
      "created_utc": 1737738657.0,
      "score": 146
    },
    {
      "id": "m8ye4ey",
      "body": "Are you worried your teacher will say something? To you or your principal or you parents? If so, would that be a bad thing, having a conversation about where you’re at emotionally and psychologically? If so, why?",
      "created_utc": 1737743761.0,
      "score": 60
    },
    {
      "id": "m90s95b",
      "body": "Heya... I just wanted to pop in and add that I was around your age when I was involuntarily committed to a youth psych ward. \nIF that happens, please don't be scared of it. I'm going to be honest I was at first but honestly, it was like a summer camp but with more rules. Girls and boys are in separated dorms, daily group activities, music, recreation. In my state the longest they can keep you is 2 weeks. Which sounds long but once you get adjusted after a couple of days it goes by pretty quickly! \nFor some people they actually do get the help that they need. A small step into making things just a little more bearable... If you were to go now at your age, it will be a lot better than going as an adult.",
      "created_utc": 1737769751.0,
      "score": 33
    },
    {
      "id": "m8yzien",
      "body": "I am so sorry you have to experience this, if you can, reach out to friends you trust or a counselor of sorts. Wishing you the best.",
      "created_utc": 1737749788.0,
      "score": 23
    },
    {
      "id": "m90pz01",
      "body": "Please reach out. Reach out to a friend, a parent/guardian you trust the most, or even a counselor. I know it's not fun and hard to reach out, but honestlyc it's one of the best things I ever did. I'm better since I reached out to someone. If you need help, you can talk to me about it.",
      "created_utc": 1737768968.0,
      "score": 11
    },
    {
      "id": "m8zhj9o",
      "body": "Just don’t end up in a psych ward those are the worst places",
      "created_utc": 1737754909.0,
      "score": 38
    },
    {
      "id": "m904df7",
      "body": "Im so sorry",
      "created_utc": 1737761811.0,
      "score": 10
    },
    {
      "id": "m93kd97",
      "body": "Heads up, I wouldn’t put makeup on it if it seems that bad. A rope burn is still a burn and therefore could get infected. :(",
      "created_utc": 1737817486.0,
      "score": 5
    },
    {
      "id": "m9nsv81",
      "body": "Hey kid, hope you're doing alright, just came here to send some love and let you know you aren't alone 🫂",
      "created_utc": 1738082440.0,
      "score": 4
    },
    {
      "id": "m9wtc3w",
      "body": "That's why Im not going to hang myself I'm going to jump or shoot myself instead ",
      "created_utc": 1738191560.0,
      "score": 3
    },
    {
      "id": "m9y4ob2",
      "body": "Tied rope to a lamp??",
      "created_utc": 1738206686.0,
      "score": 2
    },
    {
      "id": "m8y1wep",
      "body": "[deleted]",
      "created_utc": 1737740378.0,
      "score": -31
    },
    {
      "id": "m8zfbg7",
      "body": "Im fucked",
      "created_utc": 1737754282.0,
      "score": 77
    },
    {
      "id": "m91tegg",
      "body": "in almost every case for people who struggle, \"help\" is the worst option.\n\nI remember when I attempted I was so angry at the paramedics and doctors I feel terrible they were just doing their job but it's the fact that I had to be there and I didn't want to be\n\nI think that's why tbh",
      "created_utc": 1737784696.0,
      "score": 41
    },
    {
      "id": "m940o6u",
      "body": "Thank you for sharing this. My kid was involuntarily committed yesterday and it's so hard not knowing what they're doing with her while she's there.",
      "created_utc": 1737822424.0,
      "score": 7
    },
    {
      "id": "m9toz4b",
      "body": "[removed]",
      "created_utc": 1738160124.0,
      "score": 2
    },
    {
      "id": "m8zswzi",
      "body": "Thats why im scared somebody Will find out",
      "created_utc": 1737758236.0,
      "score": 25
    },
    {
      "id": "m91picx",
      "body": "Varies from place to place. Some are fine, others may suck.",
      "created_utc": 1737782768.0,
      "score": 14
    },
    {
      "id": "m967qxf",
      "body": "I put some aloe thing on it today",
      "created_utc": 1737845996.0,
      "score": 4
    },
    {
      "id": "m9wuv2a",
      "body": "Yeah i would shoot but im too Young",
      "created_utc": 1738192019.0,
      "score": 3
    },
    {
      "id": "ma79ta9",
      "body": "Like a big ceiling fan thing",
      "created_utc": 1738334718.0,
      "score": 1
    },
    {
      "id": "m8y7zyw",
      "body": "Aww who's a little edgelord 🥺🥺 it's you oh yes it's you",
      "created_utc": 1737742060.0,
      "score": 46
    },
    {
      "id": "m8y7tvl",
      "body": "Why the fuck would you respond something like this. Get a life",
      "created_utc": 1737742012.0,
      "score": 41
    },
    {
      "id": "m8zixi3",
      "body": "Yeah sorry man",
      "created_utc": 1737755301.0,
      "score": 63
    },
    {
      "id": "ma1qqw9",
      "body": "Christ .. I'm sorry you had to experience that. Under no circumstance should anyone be subjected to that sort of treatment. Was it ever reported? Were there others as well?",
      "created_utc": 1738260030.0,
      "score": 1
    },
    {
      "id": "ma4nbwf",
      "body": "Maybe try bandages with antiseptic, ointment or whatnot and then you can cover over the bandages with a scarf or a turtleneck shirt so people dont see it??",
      "created_utc": 1738290991.0,
      "score": 1
    },
    {
      "id": "m8yc530",
      "body": "lol dude deleted his comment out of shame go figure",
      "created_utc": 1737743212.0,
      "score": 30
    },
    {
      "id": "m8zcnkx",
      "body": "What did they say",
      "created_utc": 1737753532.0,
      "score": 11
    },
    {
      "id": "m90mpng",
      "body": "What a world we live in that the institutions to report child suffering only serve to put them in more misery. And how stupid are we for accepting this again and again?",
      "created_utc": 1737767849.0,
      "score": 88
    },
    {
      "id": "m8zkc9d",
      "body": "Im sorry my brain is fucked but i remember they said \"thats sounds like a YOU problem\" and something else but i dont remember i think it was something like get your shit together.",
      "created_utc": 1737755698.0,
      "score": 17
    },
    {
      "id": "m90r4cn",
      "body": "Most CPS agencies nowadays are for the most part for-profit agencies.",
      "created_utc": 1737769362.0,
      "score": 44
    },
    {
      "id": "m8zsth4",
      "body": "Damn",
      "created_utc": 1737758206.0,
      "score": 9
    },
    {
      "id": "m8ztgu3",
      "body": "Im sorry, you didnt deserve that. Know theres people.who care.",
      "created_utc": 1737758403.0,
      "score": 15
    }
  ]
}