{
  "id": "1di3f7s",
  "title": "My daughter is 13 years old and just attempted suicide ",
  "selftext": "My beautiful 13 year old daughter attempted suicide 2 days ago. She is just so young, I can’t believe it and never saw it coming. She swallowed 12 tablets (I won’t name what) and started having delusions and hallucinations and then went into what I would call a psychosis. Scariest moment of my life. We are still in hospital where they are treating her for the medical side of things. She is mad at me for taking her to hospital and saving her and said she wants to die. There is no trauma, no history of abuse, she comes from a loving family and has lots of friends. I am so scared and I don’t know what to do. I’m scared she will feel this way forever and this will be her life now, in and out of hospitals. Or that she will succeed in taking her life. \nI don’t even know what I’m writing here for.. just needed to get this out I guess. ",
  "created_utc": 1718644458.0,
  "score": 1443,
  "num_comments": 297,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1di3f7s/my_daughter_is_13_years_old_and_just_attempted/",
  "comments": [
    {
      "id": "l912eiq",
      "body": "Get her mental help. As a thirteen (turning 14) year old, I come from a relatively decent family. No trauma, an okay amount of friends, etc. but I still suffer with these scary thoughts. And the fact that I can’t get help makes it worse for me. Be there for her, show her you love her and try to figure out why. Just because she hasn’t gone through anything (which you don’t know, she could be bullied or something) doesn’t mean she can’t be suicidal. I’m so sorry about what happened but the steps you take forward now are very crucial.",
      "created_utc": 1718645438.0,
      "score": 870
    },
    {
      "id": "l928a8u",
      "body": "when i was 13 i got SAed and attempted suicide, my mon didn’t know a thing she was confused, scared but i just wanted help. You don’t really know 100% what goes on in her life (my mom didn’t know) so for the best i think you might wanna get her into therapy and if she doesn’t want to go now maybe you should try and go. Talk to the therapist, the psychologist about what happened and how to make her open up to you and feel safe and then maybe she will want to go. I HOPE AND WISH nothing bad happened to her (“bad” as in what criminals go to prison to). From my PERSONAL experience don’t show her how much it hurt you cause she might not wanna talk to you about things cause she may think she’s a burden to you.",
      "created_utc": 1718659504.0,
      "score": 161
    },
    {
      "id": "l91yizm",
      "body": "No history that you know of. My mom didn’t know what was going on when I first tried and thought the same thing. I hope she gets a psych hold and can open up to someone.",
      "created_utc": 1718656192.0,
      "score": 199
    },
    {
      "id": "l912j9l",
      "body": "I‘m so sorry to hear that. Is there really no reason you could think of? Is she getting bullied at school? Feeling like she’s not loved? Anything? I‘m not sure how close you two are but don’t be mad at her. Talk to her, tell her you are worried and you love her and try to figure out what is going on in her life. Maybe she need therapy. I hope you two will be okay.",
      "created_utc": 1718645482.0,
      "score": 186
    },
    {
      "id": "l91igqq",
      "body": "As a kid who’s been in this situation before, it’s nothing that you did wrong. It’s something you didn’t see coming because your daughter probably didn’t want to know about it either. Please get your daughter the help that she needs. Her life does not have to be in and out of hospitals, and as scary as it is for you, it’s also scary for her to be in this position. There isn’t always a straight forward answer to why someone may be struggling with their mental health. There isn’t always a reason at all. It just is. And it’s so important that while there may not be a reason for her to be depressed, it doesn’t take away from the fact that she is, in fact, depressed. Don’t compare with how lucky she is to how she should be feeling, and please look into some more help for her",
      "created_utc": 1718650787.0,
      "score": 76
    },
    {
      "id": "l922lkv",
      "body": "ITS NOT ABOUT YOU\n\nI was around a similar age when I went through this and at this delicate moment in time DO NOT rely on your suicidal daughter for emotional reassurance. She needs a steady rock. This HAS NOTHING to do with you. If you go to her in such a state asking about your own feelings she will SHUT DOWN. \n\nSHE can’t emotionally regulate or think intelligently, don’t rely on her to pick up the slack.\n\nYOU CAN BE SCARED, it doesn’t have anything to do with her. Your feelings are not her fault, she is not in a state to juggle both at the same time. DO NOT REQUIRE ANSWERS, SHE CANNOT GIVE THEM. \n\nThat’s the main advice I have. Not knowing how your parents will react to what you have to say inhibits a lot of therapy. Let her scream let her cry let her burn things to the ground, but don’t give her a reason to shut down.",
      "created_utc": 1718657544.0,
      "score": 124
    },
    {
      "id": "l91oy13",
      "body": "Is she under an acne treatment with isotretinoin? If so, cancel the treatment immediately because suicidal ideation and suicide are secondary effects of that treatment. Take a look at all the medicines she’s taking, this state of mind may be related to that.",
      "created_utc": 1718652993.0,
      "score": 57
    },
    {
      "id": "l91kjo4",
      "body": "Please take her to a mental health professional, make sure she's eating alright, be understanding and kind, etc. Much love, sorry this happened <3",
      "created_utc": 1718651498.0,
      "score": 29
    },
    {
      "id": "l920mua",
      "body": "Find her a telehealth therapist she likes. Find her a telehealth pysch she likes. Don't push her to what YOU'D want from a doctor. Express your concerns explain to her the value of life as you have lived it yourself.\nLet her choose her path, but encourage her to pursue medical support for mental health 100%\n\nComing down with 100% control on a 13 year old will only worsen her perspective. Even if you know your keeping her safe.\nTreating her like she's still in a pysch ward would be the worst choice possible.",
      "created_utc": 1718656897.0,
      "score": 13
    },
    {
      "id": "l926cx4",
      "body": "sometimes depression is innate and not circumstantial. i was 10 the first time i thought of self harm, and 14 at my first aborted attempt at suicide. after that moment, my parents were unsure how to respond, so they addressed it with anger. they thought i had no reason to be depressed so i was clearly overreacting or actually being bothered by something that i didnt want to say. similar thing here: no trauma, no history of abuse, decent grades, (otherwise) loving family and plenty of friends.\n\nmy therapist phrased it this way: some people with depression are that way due to chemical imbalances in the brain. telling a chemically depressed person to just take a walk or look on the bright side or to just be happier is like telling a diabetic to just try harder to make insulin. it doesnt work that way.\n\nmy entire life has been a dance with depression. there are good times and bad times. \nheres what helped me: \n\n1.) therapy. i started weekly and reduced sessions as my mental state improved, and increased whenever i had a bad spell. \n\n2.) SSRIs. antidepressant/antianxiety meds. at my worst i needed the largest dose possible for my prescription. now im in the middle range- less than before, but more than others on the medication’s subreddit seem to need on average. \n\n3.) a schedule with plenty of sunshine. i realized one of my triggers for a worsening depression was constantly in the dark/having a nocturnal schedule. \n\n4.) learning my triggers in general. keeping a log of my habits: what i ate that day, how much i slept/quality of sleep, what i did that day, the weather. helps see if there are patterns you didnt notice before.\n\n5.) being understanding with myself. being gentle with myself instead if beating myself up for things. depression makes it hard to bathe, eat, sleep, do schoolwork, do chores, get out of bed, etc. the inability to do normal things that everyone else does increases feelings of guilt and unworthiness. addressing myself with kindness and giving myself grace for things, acknowledging that its a part of depression, helped lift me out of depressive episodes sooner.\n\n6.) understanding that another depressive episode is inevitable. sounds counterproductive, but if you believe that you’re completely cured when your mental health improves after an episode, its all the more devastating when another one comes. you feel so gut-wrenchingly sad, knowing that you felt so much better and that positive energy has completely disappeared. youd give anything to get it back, and you feel as if you failed in some way or did something wrong in order to have another episode. they can come out of nowhere, during completely happy times. recognizing the signs that a depressive episode is coming, and doing what you can to be gentle with yourself when it does come, will help the depressive episode pass quicker. the knowledge that it WILL pass, and that this is a temporary state that you need to cope with in the meantime will help.\n\n7.) addressing other mental health concerns. i felt so other and alien for my entire life. i felt as if i was incompatible with living. i knew something was off but i didnt know what. i was evaluated and diagnosed with level 2 autism and adhd at 24. i was also diagnosed with major depressive disorder (moderate, recurring episodes), generalized anxiety disorder (with panic attacks), and social anxiety disorder. looking back, there were signs od neurodivergence that my parents didnt care to look into or address. living without coping mechanisms and resources put a lot of strain on my mental health growing up. every professional ive seen has agreed that if i had access to those resources as a kid/teen, i likely would have been in a much better headspace. start with therapy.\n\nbe a shoulder to lean on. dont force her into doing something, do it with her. find shortcuts. she has no appetite? make a quick snack to eat with her. she cant get out of bed? beds are for sleeping and not sadness, but she can make a little nest to lay in on the living room couch and rest there instead. she cant bathe? have a quick foot bath with her, have her lean over the bathtub and shampoo her hair for her real quick, or wipe her face with a wet washcloth. she wants to spend time in her room but cant bring herself to clean it? pick one area each day to tidy up with her. small things that make her feel better will develop into big steps. \n\ngood luck.",
      "created_utc": 1718658826.0,
      "score": 12
    },
    {
      "id": "l93tg4d",
      "body": "I'm so sorry you and your daughter are going through this. Just to clarify though, there is no way to know wether or not your child (or anyone) has trauma unless you *are them*. Suicide and depression are not always related to external factors though",
      "created_utc": 1718682284.0,
      "score": 11
    },
    {
      "id": "l91niti",
      "body": "I am very sorry for reading such a situation.\n\nI don't doubt anyone's word, but are you sure she hasn't suffered any trauma or abuse? I don't want to be an idiot who asks things because I want. I ask this because I have been sexually abused from the age of 7 (more or less, I have a hard time remembering certain parts of my childhood) until I was 13 years old. I'm 15 and I've never told my family. It's hard to tell people close to you, even if you know that they will support you and help you.\n\nI hope everything goes better from now on. 🫂",
      "created_utc": 1718652513.0,
      "score": 28
    },
    {
      "id": "l92fwlz",
      "body": "I was 13 when I first attempted. I had a good childhood and no trauma. \n\nYour daughter might be mad now, but she won't be forever. She doesn't know how to process how she feels right now and anger is easiest for her. \n\nJust keeping loving her and get her the help she needs.",
      "created_utc": 1718662288.0,
      "score": 9
    },
    {
      "id": "l92h9hm",
      "body": "I don't know you, and I don't know her. Sometimes there is a reason, and sometimes there isnt. What you can do is provide a safe space for her constantly, CONSTANTLY. \n\nThat means NO LECTURING, NO CRITICIZING. Those two may make her shutdown, and not want to open her. A safe space is vital for a child to open up. Be uplifting, and honestly compliment her. Help her see the good in herself. At that age, she probably knows a lot. \n\nFor all you know, she could be being bullied, been abused, or other things.\n\nLove her.",
      "created_utc": 1718662804.0,
      "score": 7
    },
    {
      "id": "l913d2b",
      "body": "I'm sorry. Suicide and attempts at it are always so painful and frightening. But it is possible that your daughter won't feel this way forever. You can look at therapy and possibly medication, if there is an underlying psychiatric source for her feelings, your daughter can move past this. Depression or other disorders don't need trauma or abuse to impact people, so it isn't your fault or anyone's fault.",
      "created_utc": 1718645760.0,
      "score": 9
    },
    {
      "id": "l92atyb",
      "body": "Just curious but how often do you talk with her? I mean have real conversations? Has she ever hinted that she’s felt this way? If so did she say why?",
      "created_utc": 1718660411.0,
      "score": 8
    },
    {
      "id": "l9112xb",
      "body": "I'm so sorry",
      "created_utc": 1718644998.0,
      "score": 23
    },
    {
      "id": "l91eq76",
      "body": "I'm so sorry this has happened.\n\nIt's really traumatic for family members to witness and have to deal with this. Please make sure you look after yourself and seek support.\n\nIn terms of your daughter, whatever you're feeling right now, don't let her see it. I was 14 the first time I attempted and I can tell you it is incredibly hard to deal with your own emotions when you are getting over an attempt, and completely overwhelming to try and deal with someone else's emotions, which can make it all feel so much worse.\n\nKids and teens can go through things they don't tell their parents about. Whether something has happened to cause her to feel this way or not, nobody needs to justify their mental health problems or their feelings. Mental health conditions don't discriminate, anyone can suffer.\n\nStay strong, let her know she is loved, listen to her and make her feel heard, and be there for her when she needs you. I hope she gets the help she needs and that she is shown the compassion and respect she deserves whilst in hospital. \n\nI hope everything turns out well for you. Sending good vibes your way.",
      "created_utc": 1718649530.0,
      "score": 23
    },
    {
      "id": "l92vceq",
      "body": "I tried to kill myself at 13 and not for any reason anyone would guess. \n\nHere were the factors genetic: family history of suicide, bipolar mother\n\nHere was my reason: from 6th to 8th grade my hormones were getting the best of me. I had gone to school with the same friends since I was 3, I never moved homes or schools. The idea of being separated from my friends and teachers after 10 years (our school was small and it was k-8), triggered in me a deep sense of grief and abandonment. At at 13, I did not think I would be able to cope with leaving my family (school, teachers and friends alike), I started cutting myself with a pencil just so that I could feel physical pain rather than mental pain. I was crying myself to sleep every night. On top of that, a boy I liked since kindergarten asked another girl to the 8th grade prom. This, combined with hormones and family history resulted in me trying to take my life at merely 13. \n\nHow would anyone in the world know this? It can be a culmination of things. And now, as an adult, I realize I've always had abandonment issues, probably stemming from the unpredictably of my mom's bipolar disorder.",
      "created_utc": 1718668303.0,
      "score": 8
    },
    {
      "id": "l93fv0g",
      "body": "When I was 12, my parents also would have said I had no trauma. But I did. I also attempted at that age. \nIdk what you've said to her, but for me it always made it worse when my parents told me that I had a good life and no reason to be depressed/suicidal. There's so much that parents don't know about their kids. Be sure to validate her pain and not dismiss it.",
      "created_utc": 1718676518.0,
      "score": 7
    },
    {
      "id": "l93jj37",
      "body": "I tried to kill myself when I was 10. I didn’t get any help but managed to limp through. It wasn’t until my early 40s that I finally sought help for my depression and anxiety.\n\nIn retrospect I wish I had been given treatment much earlier. Please do so for your daughter",
      "created_utc": 1718678007.0,
      "score": 8
    },
    {
      "id": "l92h6hn",
      "body": "If you haven't already, start therapy for yourself. When she opens up or shares vulnerable feelings, listen without trying to reason or solve anything. Then, take what you heard to a therapist who will help process what you feel. Sometimes, our kids need to talk about how they feel, and it may hurt to hear it.\n\n\nFor treatment options outside of the troubled teen industry, check the TTI survivors sub. Lots of work has gone into creating lists for parents seeking help.",
      "created_utc": 1718662772.0,
      "score": 6
    },
    {
      "id": "l92vd49",
      "body": "As someone who also attempted suicide, be sure not to be mad but support her in becoming mentally healthy. BUT one of the biggest things is don’t start to be overbearing/overprotective… of course keep an eye on her, the reason I say don’t be overprotective or overbearing is because normally that will lead to more issues down the road. Mood stabilizers will probably help. She might need someone who she can talk with about why she feels this way, without being or FEELING judged. From what you say, seems like she has a good life BUT with teens, not everything is as it seems obvi and there could be bullying happening that she doesn’t want to tell you about, there could be something that happened to her that she doesn’t feel comfortable telling you. If she goes to a mental health facility, when she gets out, make sure she stays on her meds, and continues to get out patient therapy with a psychiatrist as they can manage meds and provide some counseling.",
      "created_utc": 1718668310.0,
      "score": 4
    },
    {
      "id": "l92l19i",
      "body": "Just because she seems to have a perfect life doesn’t mean she isn’t getting bullied on the side or having mental health issues. You should pay more attention to the child and see if she isn’t getting bullied online somewhere. Social media is making teens more insecure than ever before because of what it’s portraying the good life to look like (having a boyfriend, popularity, lots of possessions, etc).",
      "created_utc": 1718664256.0,
      "score": 4
    },
    {
      "id": "l93luo7",
      "body": "Hi I had a similar story.. when I was thirteen I had my first attempt. Then a second attempt at 14 and was hospitalized. My mom got me help with a lcsw (therapist) and a psychiatrist. I was on meds and struggled through hs. I barely graduated from hs. Then I ended up going to college and getting a degreee in psych. I now am recovered and work in the mental health field at 23. I write this to give to give you hope and to not give up on your daughter. I wish the best for the two of you and hope that she will succeed once she gets to a better place.",
      "created_utc": 1718678960.0,
      "score": 5
    },
    {
      "id": "l93sybx",
      "body": "Always consider the chance of a teruma that you don't know about. Try to make sure of that.\nBut I believe in that age she's probably Influenced by her friends or mostly internet.",
      "created_utc": 1718682047.0,
      "score": 3
    },
    {
      "id": "l93wfl5",
      "body": "Is there a chance she could be bullied in school? At 13 i was severely bullied and never told my mom",
      "created_utc": 1718683773.0,
      "score": 4
    },
    {
      "id": "l91lueb",
      "body": "School, hormones and some home things that may not be acknowledged. \n\nHugs and I love you, \nIf you can get her maybe in boxing something self defense it may go a long way. And attend those activities \n\nYour doing the right thing",
      "created_utc": 1718651942.0,
      "score": 3
    },
    {
      "id": "l91zvrm",
      "body": "As someone who was in your daughter’s position when I was her age, definitely look into therapy and get a referral (if that’s what you need where you are) to see a mental health professional asap. I’d also encourage you to be a safe space and someone she can talk to about how she’s feeling or things that she’s struggling with no judgement. It might be hard, but be patient and don’t push her to share how she’s feeling (especially since at her age, a lot of kids don’t know how to describe their emotions)",
      "created_utc": 1718656647.0,
      "score": 3
    },
    {
      "id": "l92di5v",
      "body": "I'm so sorry for what you're going through. I did the same thing when I was 13. But I grew up in an abusive home. I would say just let her know that you're there for her no matter what. Don't judge her. Tell her she's beautiful. Let her know she's smart & has a good future. Let her know this is just temporary & will pass. If necessary put her on antidepressants. Get a good therapist/psychiatrist/psychologist, because I had awful ones who would say awful things to me. I'm not saying to be her friend & not her parent. Be her parent, but at the same time really listen to her. Be there for her.",
      "created_utc": 1718661388.0,
      "score": 3
    },
    {
      "id": "l93lsmx",
      "body": "I’m sorry this happened. I’m thankful she made it out alive. I couldn’t imagine if it was my child. I would want them to talk to me. My kids are young but I told them if they ever have thoughts of hurting themselves come tell me.",
      "created_utc": 1718678935.0,
      "score": 3
    },
    {
      "id": "l93nrxs",
      "body": "I’ve been depressed since I was 7 and have had a pretty good life until I was like 12-15 even without trauma life can feel hard to a kid. Certain things you would think don’t mean anything might mean alot when you are 13. I remember people’s remarks about me and how I viewed myself made me really suicidal at that time sometimes it’s not the people around us but just ourselves and she might be mad at you for saving her now but when she gets better I promise you she’ll be glad she didn’t kill herself at 13.",
      "created_utc": 1718679753.0,
      "score": 3
    },
    {
      "id": "l93oaa2",
      "body": "prayers to you and your daughter. i was her age when i attempted the same way. shes just a baby im heartbroken",
      "created_utc": 1718679962.0,
      "score": 3
    },
    {
      "id": "l93ozmk",
      "body": "Oh darling, I'm so sorry. I know this feeling as a mother & how helpless you feel. I understand everyone has different experiences & lives but personally what helped my son was this.. \n\nCreating a safe place for him to be the person he is in his head. No judgment, understanding, relating, reminding him often he isn't alone in having depression or thoughts like this & listening. Me opening up to him about my own personal mental health issues created a safe place but the biggest thing was zero judgment & listening. \n\nWishing you & your daughter all the best, she will get better ❤️ allow her to speak freely & follow any professionals advice. Hang in there.",
      "created_utc": 1718680260.0,
      "score": 3
    },
    {
      "id": "l93pvpl",
      "body": "I am so sorry. That is so horrible. I already lost my four year old son and my 8 year old daughter remains in this world and went through so much shit and so you are living my last remaining nightmare now that I might lose her. \n\nI wish I had words to help. All I can say is you did something good by reaching out on here. You are not alone and the amazing world of the internet might let you cross paths with something that may help.",
      "created_utc": 1718680644.0,
      "score": 3
    },
    {
      "id": "l93z9ei",
      "body": "Check out who she's coming in contact with, how she's managing daily life. Could be overwhelmed & doesn't think it's worth it.",
      "created_utc": 1718685283.0,
      "score": 3
    },
    {
      "id": "l94etr3",
      "body": "I have had suicidal ideation all my life. All of it. Since I’m a little boy. And I come from a loving family with very few problems. It’s a mental health issue, so there doesn’t need to be a cause, except her own brain chemistry. She needs an evaluation.",
      "created_utc": 1718694981.0,
      "score": 3
    },
    {
      "id": "l94qydj",
      "body": "Sometimes mental illness has no reason but I suggest you check in on her and get her the help she needs (like therapy and maybe meds?)",
      "created_utc": 1718703984.0,
      "score": 3
    },
    {
      "id": "l95vm4d",
      "body": "First of all, you’re doing so well. It’s a scary thing to go through seeing such a young child have such thoughts. My only suggestion would be to get her mental health checked ASAP. The sooner the better.\n\nI wish I had parents like you. My first attempt was at 13 too. I’ve somehow made it in life and am 27 now, but I know for sure things would have been so different if my parents didn’t laugh off my first attempt and took prompt action. More power to you and especially your daughter, OP.",
      "created_utc": 1718722760.0,
      "score": 3
    },
    {
      "id": "l9660fr",
      "body": "[removed]",
      "created_utc": 1718726264.0,
      "score": 3
    },
    {
      "id": "l967v31",
      "body": "Hey OP, the best thing you can do for her is get her in with a therapist and child psychiatrist. Sometimes mental illness is just shitty luck in the brain chemical department, and medications really can be a life saver. I remember when I first got on the right medication for me I had this epiphany of \"oh my god, this is what it feels like to be happy\", and it was life changing, but I didn’t get that until I was in my twenties because my mother didn’t want me on medication. I’m not saying it will be a magical fix, but consider getting in with some professionals.",
      "created_utc": 1718726892.0,
      "score": 3
    },
    {
      "id": "l92sjy4",
      "body": "I will say mood stabilizers helped me with that feeling almost within a week or 2x. Antidepressants alone likely wont be very effective if it’s a very deeply rooted desire. She does not have to feel this way forever. There’s always hope. Happy she’s still here with us.",
      "created_utc": 1718667185.0,
      "score": 4
    },
    {
      "id": "l928r2p",
      "body": "i mean this generation is the worst one for young people id say the majority of gen z is depressed. im an older gen z but i tried taking my life when i was 12 i do have a history of trauma tho best thing to do is spend more time with your daughter",
      "created_utc": 1718659668.0,
      "score": 5
    },
    {
      "id": "l923e73",
      "body": "I was exactly where your daughter is now.  I attempted suicide and woke up in the hospital.   I was screaming at my mother to let me die. \n\nIt's taken me a  long time to realize that my mother saved my life.  I put her through hell,  but I wouldn't be here without her intervention. \n\nYou are doing the right thing in getting your daughter the help that she needs.  She's going to be angry at you for awhile,  but it will pass.",
      "created_utc": 1718657812.0,
      "score": 2
    },
    {
      "id": "l92j79t",
      "body": "I'm sorry you had to go through this.  Please keep us posted about how she reacts to continuing to know you care and checking out local options to help her overcome this time.",
      "created_utc": 1718663547.0,
      "score": 2
    },
    {
      "id": "l93kjni",
      "body": "I attempted at 13 too. Please take her to regular psychiatry, seek a diagnosis for Depression and get her prescribed antidepressants. I know saying this means nothing and will mean even less to her but I turned 17 this year and I am living proof that there is a way out of what she’s feeling. \n\nWe’re currently going through something similar with my brother, trying to keep a Sunny disposition but of course it’s difficult. I think the most difficult part is getting the person themselves to understand that there’s only so much you can do, and the last step is up to them, but they don’t want to take it. It’s so tough to inspire them to stay alive. Just know that I’m so happy I didn’t die back then.",
      "created_utc": 1718678421.0,
      "score": 2
    },
    {
      "id": "l93wvtj",
      "body": "You have my deepest condolences",
      "created_utc": 1718684004.0,
      "score": 2
    },
    {
      "id": "l94646i",
      "body": "I wish my mom cared like you. I hope your daughter can feel better soon, with your help. (And professional help, too).",
      "created_utc": 1718689125.0,
      "score": 2
    },
    {
      "id": "l94b9az",
      "body": "I think you should get mental help, and be there for her, it sounds very dangerous to turn away and look the other way.",
      "created_utc": 1718692493.0,
      "score": 2
    },
    {
      "id": "l94c6u4",
      "body": "im 20 now about to turn 21. my first suicide attempt was at 13 as well. i started self harming at 12. PLEASE get this girl into therapy ASAP!!! i spent my entire teen years self harming and trying to kill myself every few years because i wasn’t in therapy and didn’t really have support since i was a “difficult teen” and my mom didn’t know what to do with me. PLEASE get her therapy and ASAP",
      "created_utc": 1718693133.0,
      "score": 2
    },
    {
      "id": "l96etjf",
      "body": "i'm so sorry this happened to you but the actions you take from this day forth are important. i turned 17 a couple days back, and i almost attempted when i was at the ripe age of 13 too, my friend saved my life. no one had seen it coming, and now that i feel those thoughts coming back, i take utmost care not to let anyone know about it either. it's unhealthy but...that's just how it goes. don't beat yourself up about not having seen any signs, depressed/suicidal people rarely ever let anyone know how they're actually, truly, doing. \n\ndo what's best for your kid, which includes putting her in therapy and giving her all the support and love she needs and deserves. i hope everything will be alright xo",
      "created_utc": 1718729195.0,
      "score": 2
    },
    {
      "id": "l97xzmr",
      "body": "You probably see stuff as very different from your daughter. You see no trauma or abuse, only love. She might see the exact opposite. Also, she could be getting bullied or another countless list of stuff teens go through. Get her some counseling. Don't talk to her. Listen to what she has to say.",
      "created_utc": 1718747564.0,
      "score": 2
    },
    {
      "id": "l987f9s",
      "body": "I am sorry you and your family is going through this. I just want to say that, your daughter is so very lucky to have a parent like you. Not everyone is so lucky- it will go a long way for her recovery having you by her side. You may be her parent, but you are not all knowing and perfect, this is new for you- try not to take her attempt to heart, since as you stated, there is no history of abuse or anything of the sort. It’s not your fault and you are doing your best",
      "created_utc": 1718751174.0,
      "score": 2
    },
    {
      "id": "lcau5p4",
      "body": "Be there for her hug her a lot and listen to her.  Our loved ones are priceless",
      "created_utc": 1720496769.0,
      "score": 2
    },
    {
      "id": "l94jmgg",
      "body": "Technology.\n\nHow addicted is she (if at all) to any tech devices which harbour the causes of so many mental illnesses? At 13, your daughter is old enough to use and know all the major social media platforms, and fall prey to the unattainable expectations that these platforms espouse. This, as we all know, has led to so many teens becoming disillusioned with their lives, or worse.\n\nIn any case, starting her with a psychiatrist will be the smartest move for now.\n\nAll the best in trying to figure all this out.",
      "created_utc": 1718698553.0,
      "score": 3
    },
    {
      "id": "l925s87",
      "body": "She's still young enough to recover. I had been bullied from 7th grade on. My parents didnt know what was wrong for years until I started missing too much school. There may be things you don't see at school or social media. Get her someone to tall to. Sit down tell her why you saved her and that you are there to listen. That open and honest communications are importart to healing. My mom still doesn't know how close I came.",
      "created_utc": 1718658626.0,
      "score": 2
    },
    {
      "id": "l945ts8",
      "body": "Did she have exposure to those neurotoxic psych drugs?",
      "created_utc": 1718688943.0,
      "score": 2
    },
    {
      "id": "l92kfdj",
      "body": "How do you know there's no trauma, how do you know there hasn't been abuse? Those are some pretty big assumptions. Have you talked to her and asked her? If you're making those assumptions without even asking then maybe they felt like they couldn't tell you.",
      "created_utc": 1718664021.0,
      "score": 2
    },
    {
      "id": "l922287",
      "body": "take her to a mental health professional as soon as you can, and see if you can't figure out why she'd try to take her own life, but be mellow about it as she also needs space to calm down",
      "created_utc": 1718657366.0,
      "score": 1
    },
    {
      "id": "l929hki",
      "body": "Sorry to hear this. I'm 16 and a  good friend of mine took her life almost 2 years from today. Looking back, it was never clear that she was even remotely suicidal. She left a diary which her family and those mentioned got to read. Her reason for killing herself was that she was fed up of life, and didn't see anything worth living for. She didn't know what she wanted in life, and told us how her happiness was all superficial, and she had finally understood that she wasn't happy. for her whole life, she never felt safe to consider anyone a listening ear, I think that was her main reason. My advice to you is you let your daughter know you're there for her no matter what, it's okay to go through what she is going through. let her know that it does get better and that she's not alone in this battle.",
      "created_utc": 1718659930.0,
      "score": 1
    },
    {
      "id": "l92h1om",
      "body": "I’m so sorry you have to go through this. It’s a really trying time for both you and your daughter, so please don’t give up. You could probably look for a therapist/psychologist for her to work through her feelings if you can afford it. If not, there are many great resources online that you can use to talk to her and support her. I hope you also have someone close to you to talk to this about and that you two will be okay. ",
      "created_utc": 1718662721.0,
      "score": 1
    },
    {
      "id": "l92ha0l",
      "body": "You in the UK?",
      "created_utc": 1718662810.0,
      "score": 1
    },
    {
      "id": "l92ifdi",
      "body": "Man this so sad it really broker me, see this side of things it's just so much, she still young and has a chance to turn things around hope she makes it, and never give up on her pls save her",
      "created_utc": 1718663248.0,
      "score": 1
    },
    {
      "id": "l92mqxn",
      "body": "I was quite young and did similar, ate a costco size bottle of ibuprofen. Regretting being alive I had no knowledge as to why I wanted to die. I had it set in my heart that's what I wanted I had no answers. 10-13 years later they resurfaced in PTSD like memories as to the severe abuse I blocked out and never got the help for because I suppressed it. Turns out I was raised in a home a ped0philes and siblings mother, everyone knew and did nothing. It's taken a lot of work and healing to get where I am today. Can't say I'm completely certain I'm fixed but I just wanted to share my experiences. Thank you for sharing your story and I really hope your daughter finds something to bring her out of this soon.",
      "created_utc": 1718664912.0,
      "score": 1
    },
    {
      "id": "l92paat",
      "body": "Some kids come to realize the world isn't as good of a place as others make it out to be. Learning to cope with that is a process, by figuring out what makes life worth living. Anyone can do it, but it takes time and thoughtfulness to get there. Wish you and her the best.",
      "created_utc": 1718665906.0,
      "score": 1
    },
    {
      "id": "l93582j",
      "body": "Sending good vibes your way, I hope all gets better. I was once a suicidal teenager, and at times as an adult and I know how scary it can be. \nI also have a 13 year old daughter and I am terrified her depression will some day get the better of her…I got her enrolled in therapy and had an evaluation done. But about a year ago her dad found a note in her bedroom that was a suicide note, thank god she didn’t act on it. \nI feel for you, and just know that you did the right thing taking her to the hospital for help. Love and support and mental health help is the best thing right now.",
      "created_utc": 1718672297.0,
      "score": 1
    },
    {
      "id": "l935wrr",
      "body": "Stress-diathesis model explains that mental illness states don’t always need significant stressors to emerge",
      "created_utc": 1718672570.0,
      "score": 1
    },
    {
      "id": "l937y7l",
      "body": "So sorry, and stay on her like a guard right now. Get to the bottom of it, something definitely did happen whether it is reasonable to be upset or not, she's in very metamorphosis like hormonal stage, her core experiences mixed with the wild chemistry that is emotions can be very unexpected and scary for all. She feels embarrassed right now also, she maybe doesn't want to express, can't find the words or is embarrassed by what she feels triggered the impulse and also is scared she embarrassed, or burdened you. Show nothing but love and patience and remind her how important she is to ypu guys and how much it would destroy you if she did, then commit to her that you will help her achieve some kind of goals and do it with her to show her that things can be achieved and what pains you now can be overcome but her leaving you guys can never be overcome and that you all might as well go together because that's what would happen if she chose to leave you all. Have her keep a journal whether she shares it or not, when you see her in any noticeable mood good or bad suggest she write a quick entry, lay out a goal list, places she'd like to go, things she'd like to do, help her set out to do a step by step guide to achieving them and see if she is adhd or other type of behavior or learning disability. A little known factor of adhd is that in untreated and severe cases the afflicted feel so useless and undriven since they struggle to stay interested in anything or achieve anything, and it can culminate into great despair and self hatred. There is something up but while the road ahead is trying, it can be better with committed effort.",
      "created_utc": 1718673379.0,
      "score": 1
    },
    {
      "id": "l93ccnk",
      "body": "Depression has many causes, from pressure by peers and teachers, to hidden abuse, to hormones and genetics. I'd have everything looked at, especially since she's so young and hormones are starting. Don't always assume that she has to live with this for life. She might, but I would venture a guess that there is so much you don't know. Advocate for a psych hold and get her to see a child specialist in psychiatry. I will highly advise against starting her on meds right off the bat except maybe a light mood stabilizer(the thing that stopped intense swings for me during puberty). Avoid heavier drugs at all costs. Ensure if meds are prescribed that they're locked up out of reach(gunsafe, parent closet, etc). Obviously keep in touch with her while she's on her psych hold. Tell her you love her and you're going to help her feel better. If she doesn't want to talk that's okay. She'll come around, especially if you're open and caring. It's not your fault if everything is okay with you. \n\nI am so so sorry for what you're going through. I can't imagine where you're at. But I know where she's at. I've been there on and off since before age 10. She is likely scared the feelings and little things will only get worse. Side note, even if nobody in the family is neurodivergent(autistic/adhd), seek out a psych who can spot these. More often than not, these going undiagnosed can alone cause depression and the feelings of never being normal. It was a decent part of many spirals I had. And being talked to in a way you feel understood can make a world of difference. I wasn't diagnosed ADHD till I was about her age, and autism wasn't diagnosed until I was nearly 18. Girls hide it so much better. \n\nMany hugs from an internet stranger. I will send healing and love to all of you during this difficult time.",
      "created_utc": 1718675129.0,
      "score": 1
    },
    {
      "id": "l93d46p",
      "body": "So sorry to hear about that. She is clearly suffering from outside familiar events. I myself have always shown myself as a strong person to my parents and I was bullied every single day for years and years. There's a lot that parents don't know. And kids won't tell them as well.\n\nTo my friends and family I am one of the most happy people they know. I am currently scheduled for a shrink because of suicidal thoughts. This was requested by my therapist, to get medicine. I am 39 years old.\n\nYou never get to know people. Once again, so sorry for your daughter. I hope she turns out well. I really believe you are a loving parent.",
      "created_utc": 1718675426.0,
      "score": 1
    },
    {
      "id": "l93dicx",
      "body": "I just saw in the news today that even just one childhood concussion can cause mental health problems including suicidal thoughts!",
      "created_utc": 1718675582.0,
      "score": 1
    },
    {
      "id": "l93m1vc",
      "body": "I understand that this is a lot for you and I'm sorry it happened. What you can do for your daughter is not just be there for her but listen and be attentive to her. Make sure she has friends who provide that kind of good attention and influence for her. It'll do wonders for her mind. \n\nAnd hey, not just her, for you as well. \n\nIf naturally you can't find friends or you can't be there for your daughter, you can pay a therapist to listen to you weekly/monthly. \n\nLet your daughter know she's needed and loved in this world in a way she understands. But don't forget yourself in the process as well. Take your time to heal with her. It goes both ways. I hope your family is able to grow from this experience ❤️ sending you well wishes",
      "created_utc": 1718679044.0,
      "score": 1
    },
    {
      "id": "l93siix",
      "body": "I started having these thoughts when I was thirteen. Just never acted on them. At 27 I still get them on the daily. I'm sorry for what you are going through. You never know what could be going on in her life that you are not aware of. She needs a trusted therapist who can talk to her.",
      "created_utc": 1718681841.0,
      "score": 1
    },
    {
      "id": "l93xolj",
      "body": "this breaks my heart knowing this is how my parents must have felt when I attempted, honestly gives me a reason to say",
      "created_utc": 1718684428.0,
      "score": 1
    },
    {
      "id": "l941xoa",
      "body": "Get a mental health professional.\n\nDespite it all, she might not have trauma yet might get traumatized easily. As a kid, I i grew up pretty nice. Loving family, good friends, and a lot of coddling, but that only made me soft, and now it's a burden. \nYears passed, and in 2017, grandfather died, i was crushed. That man took care of me since I didn't go to the kindergarten. \n\nA lot can happen. My mother didn't even know it either. She only noticed my grades falling, and I didn't want to talk like I used to. \n\nEverything will be alright, as long as the daughter recovers, talk to her, and question what might make her think like this.",
      "created_utc": 1718686781.0,
      "score": 1
    },
    {
      "id": "l942n6w",
      "body": "The truth is the reason she attempted is not going to be easy to understand in any case. I doubt that you have the full picture here. Please get her someone she can talk to.",
      "created_utc": 1718687195.0,
      "score": 1
    },
    {
      "id": "l9452m3",
      "body": "suicidal thoughts don't come out of nothing. Chances are there is many layers behind the scenes, Witch isn't much of a shocker. No, you arnt a bad mother, So please don't blame yourself. It's just the it can be very scary to open up to parents for most teens.  \n\nAlso,  try not to make your daughter feel bad for her attempt, don't interigate her, don't guilt trip her for attempting, don't do anything that would make her feel as bad as she feels now. \n\nGet her professional help, I know that like literally everybody else is saying that but it's very much true. Since people who aredly have attempted would most likely try again.",
      "created_utc": 1718688473.0,
      "score": 1
    },
    {
      "id": "l94qw6p",
      "body": "I'm so sorry you're all going through this. As a mum with a 19 year old who attempted three times last year and has struggled with her mental health since 13 I know how helpless and devastated it can make you feel. Where are you based? Wer in the uk and cahms were useless, we ended up getting help with a councillor through a charity near us and it helped her hugely. I think she's always going to struggle with her mental health but she now communicates to me when she's feeling bad and we work together to get her out it, the important thing is she now understands its temporary and she will feel better again.",
      "created_utc": 1718703942.0,
      "score": 1
    },
    {
      "id": "l94wwoi",
      "body": "[removed]",
      "created_utc": 1718707895.0,
      "score": 1
    },
    {
      "id": "l956win",
      "body": "Mental Illness is scary. While, yes certain things can trigger the development of them, sometimes it hits the people you would least expect it to happen to. \nPlease don’t blame your daughter and make her feel guilty for attempting. Instead, offer her an open ear and be there for her, tell her you will always be there for her and will listen. Get her professional help as well. There are things that you will not be able to help with so getting Therapy is crucial. \nShe needs you now. \nYou, as the parent might want to talk to someone about this as well. Seeing your child like this is traumatic. Talking to someone might also help you understand your child better.",
      "created_utc": 1718713125.0,
      "score": 1
    },
    {
      "id": "l958ya3",
      "body": "I was 7 when I first attempted to kill myself. I came from a relatively happy family who were supportive and loving. But they didn't know they were causing me to have a lot of self doubt and anger at myself due to the high expectations they had for me. So I thought it was best to kill myself.\n\nJust because everything seems good on the surface and to you, she may not see it that way. Talk to her, calmly, these feelings don't usually come from out of nowhere, maybe unintentionally at home, or at school, or among her friends, but for it to get to that point it must have taken a lot of time for those feelings to fester.\n\nWishing you and your family a lot of love and peace.",
      "created_utc": 1718714066.0,
      "score": 1
    },
    {
      "id": "l959t5e",
      "body": "Look into something called pmdd….around when you start your period you get these depressive thoughts that you can’t help. I have this … I had a relatively happy life aswell but that means nothing when you have this. Please look into it you may be able to get her the help you need. It is a mode disorder where your body doesn’t respond normally to the change in hormones usually starting around puberty or when you get your first period. I wish my mom would have got me help for it. But at the time it was something people really didn’t know about theirs a whole thread about it r/pmdd. Every two weeks before menstrual cycle I would have severe depressive episodes for no reason at all. Every time I went to a therapist around that age I would have absolutely nothing to say because it wasn’t really depression/suicidal it’s because I had this mood disorder.",
      "created_utc": 1718714449.0,
      "score": 1
    },
    {
      "id": "l95d4a1",
      "body": "you need to get her to a psychiatrist and a psychologist specialized in child psychology and behavioural therapy. my first attempt was when i was 14. my most recent attempt was a couple of weeks back. I'm 21 now. if my mother hadn't been in denial about my illness maybe things wouldn't have gotten as bad as they are now.",
      "created_utc": 1718715854.0,
      "score": 1
    },
    {
      "id": "l95gxma",
      "body": "Ive been in your daughters place, it all got really bad for me around the same age. Get her a psychiatrist, and a therapist asap. Im 24 now and am probably about to take my life, ive attempted numerous times, and most those attempts nobody knew of. early intervention is crucial.",
      "created_utc": 1718717392.0,
      "score": 1
    },
    {
      "id": "l97bt9v",
      "body": "Stop pushing her so hard. Middle school is a horrible place for the young and vulnerable. She's probably internalizing all the bullshit from school plus whatever the fuck you guys expect from her at home while being flawed humans yourself.",
      "created_utc": 1718740081.0,
      "score": 1
    },
    {
      "id": "l97h0db",
      "body": "This is horrible. I hope that she gets better soon, but this is relatable to me. I’m almost 13 and I’ve already been thinking about suicide. I’ve never attempted though, probably because I’m too scared to. I have no trauma and I have a wonderful family and many friends, but I’m just sick of being alive. I hope your daughter will get better and won’t attempt again.",
      "created_utc": 1718741795.0,
      "score": 1
    },
    {
      "id": "l97hnwu",
      "body": "Obviously therapy would be a good place to start. I wouldn’t rush into medication o it because for me and a few people I know- all of us tried depression medication and for all four of us it made us feel worse. No pill can solve the underlying problems: certain needs not being met, being bullied, trauma etc… therapy will be more helpful for that and actually group therapy might be better than one on one for some people. I also think if you could help her get a hobby she enjoys and giving back to the community can help her self esteem even subconsciously. Good luck",
      "created_utc": 1718742012.0,
      "score": 1
    },
    {
      "id": "l97m3c3",
      "body": "i was that kid, also. please treat her with kindness, and remind her that she isn’t a burden. please do what my parents couldn’t, she deserves so much good.\n\nhope she recovers alright, op 🫶",
      "created_utc": 1718743473.0,
      "score": 1
    },
    {
      "id": "l9w1sw2",
      "body": "I did what your daughter did when I was sixteen.  I'm now in my 70's and I wish I had succeeded.   The misery of life has not been eclipsed by the few moments of happiness.   People aren't worth it.  Maybe she is trying to save herself from a life of grief.  People always want to impose how they view life on someone else.",
      "created_utc": 1719142421.0,
      "score": 1
    },
    {
      "id": "la0hqv2",
      "body": "Thanks for being there for her. As a suicidal person whose family basically doesn't believe me/criticizes me for the selfish way I act (I can see where they're coming from but sometimes it feels like life or death to me), just taking her seriously and being loving and kind will probably mean more than you know. Others have given better practical advice but I just wanted to say this. Please don't say things like \"but you have it so good, how can you be depressed\". There's nothing more exhausting and lonely than having to justify something you can't control (depression). Others are correct that she will shut down.",
      "created_utc": 1719209516.0,
      "score": 1
    },
    {
      "id": "lq6pfq6",
      "body": "Hi,iust wanted to reach out and say how sorry I am to hear about what your daughter has been going through. I can only imagine how difficult this must be for It's such a pain,but If you ever need someone to talk to or if there’s any way I can help, please don’t hesitate to reach out. Take care of yourself.",
      "created_utc": 1727983747.0,
      "score": 1
    },
    {
      "id": "lty1b03",
      "body": "I am dealing with the same exact situation. The pills and very scary psychosis to  hospitalization. No family problems.  They are sending her home after only a week, so now I am now dealing with the constant fear  about the future, its horrible. I'm no help to you. I just cant believe how your story was exactly like ours. I wish you all the courage to get through it. ",
      "created_utc": 1729993434.0,
      "score": 1
    },
    {
      "id": "l9341b6",
      "body": "Hey bud, what if I told you that assuming “no trauma” for someone who JUST attempted is pretty bold.\n\nYou remind me of my parents. I’m in my 30s now, well on my way to being healed, but my parents didn’t sexually abuse me so they hold no accountability for how shitty they were as parents.\n\nGet her help and get yourself some too.\n\nSorry this is coming from a very emotional place but damn read the room (a hospital room)",
      "created_utc": 1718671823.0,
      "score": 1
    },
    {
      "id": "l92mot6",
      "body": "Hi, 14 almost 15 yo here who has be struggling with mental health for 9 years.\n\nI would like to say you have every right to be scared, mama. But please don't be mad or harsh with your 13 yo bc so. You may not fully know what she's going through. I have an ok family. My family was extremely emotionally and mentally abusive. They would hit me sometimes but it wasn't a constant and it was used as \"discipline\". My family is not the only reason I was suicidal tho. I had stuff happening at school, in the church, with friends, sleepovers, and all my whole life.  I understand this is scary but you need to let HER decide when to tell you what she's going through. Never try to force information out of her because it can be even more harmful to do that. Dont always bring you emotions about this to her. You can say \"I'm very sad I almost lost you\" and stuff but in a COMFORTING way towards her. Never tell her things like \"do you know how much you've hurt everyone around you?\" Or bringing your emotions in. She's still young and has enough to deal with. Another load of mamas emotions might make things harder.\nJust be there for her tho, take things slow, get her mental help. I hope you can take our advice and follow it so you don't hurt your relationship with your daughter.",
      "created_utc": 1718664889.0,
      "score": 1
    },
    {
      "id": "l92vqs6",
      "body": "As a kid who had suicidal desires, I can tell you, not everything has a traumatic cause. She could be a millionaire and still have depression. You need to get her into counseling, but she needs to have control where she can. If she doesn't like a specific counselor, try a different. There are ones that specialize in teenagers.",
      "created_utc": 1718668463.0,
      "score": 1
    },
    {
      "id": "l937a0h",
      "body": "There is trauma, she isn't saying so yet, sad to hear but the poor baby needs to see a really good therapist asap, good luck <3",
      "created_utc": 1718673112.0,
      "score": 1
    },
    {
      "id": "l95lv0e",
      "body": "Your first mistake is protecting your own emotions with the narrative “no trauma, loving family with lots of friends”….that may be what you want to believe, but no one tries to kill themselves if that’s their life, time to reevaluate.",
      "created_utc": 1718719283.0,
      "score": 1
    },
    {
      "id": "l93c92n",
      "body": "I ended up going for a remington 721 30-06 rifle with a vortex 3-9x scope. It's pretty accurate I just need to get better at shooting before deer season. Overall im quite pleased. Vortex scopes come with a lifetime warranty and 30-06 can be found in every canadian tires.",
      "created_utc": 1718675091.0,
      "score": 0
    },
    {
      "id": "l92pb8x",
      "body": "[removed]",
      "created_utc": 1718665916.0,
      "score": -1
    },
    {
      "id": "l9416pw",
      "body": "I am sorry. She probably meeds more attention.",
      "created_utc": 1718686348.0,
      "score": 0
    },
    {
      "id": "l94w90u",
      "body": "It might be something in school, or she likes some boy, just try carefully talk to her",
      "created_utc": 1718707500.0,
      "score": 0
    },
    {
      "id": "l93pfae",
      "body": "[deleted]",
      "created_utc": 1718680449.0,
      "score": -2
    },
    {
      "id": "l91n1rl",
      "body": "[removed]",
      "created_utc": 1718652352.0,
      "score": -18
    },
    {
      "id": "l931p7j",
      "body": "[deleted]",
      "created_utc": 1718670880.0,
      "score": -10
    },
    {
      "id": "l92unle",
      "body": "I’m older than you but I was/am in a similar situation. I have a good bit of trauma but I still struggle with my MH. No real reason. I’ve almost gotten over the guilt from the trauma but these thoughts are still here. I had therapy and it helped a bit. Ultimately what helped me more was changing my friends. My situation is definitely not everyone’s but if you feel insecure in your friendships, changing them is a first step.",
      "created_utc": 1718668028.0,
      "score": 89
    },
    {
      "id": "l92qjot",
      "body": "I'm sorry, love. Why can't you get help? Therapy worked so well for me.",
      "created_utc": 1718666396.0,
      "score": 28
    },
    {
      "id": "l94omov",
      "body": "This is such a mature take from a child. Hope you're well now!",
      "created_utc": 1718702279.0,
      "score": 9
    },
    {
      "id": "lce1xst",
      "body": "This is very well written for an almost 14yo. I have found that life does not have much meaning, except that which we assign it. Because we have to die, we get to live.",
      "created_utc": 1720549951.0,
      "score": 2
    },
    {
      "id": "l9a0h9b",
      "body": "Yeah my mom never knew I was SA multiple times as a child and bullied at school and had no real friends (except for a couple who then most brutally betrayed me and did awful things). I ve been through so much I don't know how I am still standing and every day is a struggle. But she thinks my life is great. ",
      "created_utc": 1718782737.0,
      "score": 1
    },
    {
      "id": "l9ovfj0",
      "body": "Being suicidal as you said isn't something you chose. It is something that happens. It is happening to me, as an 18 year old. But at the same time... It is something solvable. Don't be desperate. We all have good and bad times. The bar times are worth it. They are few and far between, especially being unlovable as I am (5'3),but they are there. And most they are worth it as fuck. Love yourself and youll have so many happy moments you ll think you love life. That for itself is worth it",
      "created_utc": 1719012735.0,
      "score": 1
    },
    {
      "id": "l94kcm0",
      "body": "I still struggle to tell my mom things because of how she would freak out over small things after I told her about my depression and suicidal tendencies.",
      "created_utc": 1718699096.0,
      "score": 31
    },
    {
      "id": "l9a0jvj",
      "body": "My mom still doesn't know and won't ever know. ",
      "created_utc": 1718782789.0,
      "score": 2
    },
    {
      "id": "l953yoe",
      "body": "Exactly, same story here, and also my mom doesn't know i was raped  when i was 8",
      "created_utc": 1718711713.0,
      "score": 17
    },
    {
      "id": "l9ylp3x",
      "body": "you hope she gets imprisoned for wanting to leave this shitty planet?",
      "created_utc": 1719178246.0,
      "score": 1
    },
    {
      "id": "l91m1q9",
      "body": "[deleted]",
      "created_utc": 1718652013.0,
      "score": 328
    },
    {
      "id": "l92qpil",
      "body": "This is why mental illness needs to be taught. If it were, more people would recognize the signs.",
      "created_utc": 1718666459.0,
      "score": 14
    },
    {
      "id": "l9258cn",
      "body": "I was in a similar situation but when i was 14, and in my case, it *was* about my mother. She would not be aware of it nor admit it though.",
      "created_utc": 1718658434.0,
      "score": 32
    },
    {
      "id": "l92wfks",
      "body": "hey, another teen who attempted at 13 here-\n\nITS NOT ABOUT YOU. even if you are hurting, even if you’re scared or angry or upset- IT IS NOT ABOUT YOU. \n\nu/cambriansplooge is 100% right- she needs someone on her side. my mom still to this day brings up my attempt and makes it about her. it makes it worse and makes me want to try again- because she only seems to care about herself and not her son’s wellbeing. \n\ni know this is hard. i know it’ll continue being hard for years. it’s not about you though. \n\ndon’t punish her. don’t blame her. be very gentle. this is a time she’s going to remember for the rest of her life- make sure she doesn’t look back in anger. \n\nmake sure she’s okay. it’s okay to feel selfishly but acting on it is the worst thing you can do for her right now.",
      "created_utc": 1718668742.0,
      "score": 27
    },
    {
      "id": "l935az9",
      "body": "> DO NOT REQUIRE ANSWERS, SHE CANNOT GIVE THEM. \n\nI want to emphasize how much I agree with this.  Saying things like \"just please I want to understand, tell me why\" is so hurtful.  She probably doesn't know why her brain is like this.  She'd probably give anything to be \"normal\" or whatever.",
      "created_utc": 1718672329.0,
      "score": 22
    },
    {
      "id": "l92tk7l",
      "body": "When my daughter did this, I would cry in the shower when I couldn’t hold back the tears anymore. She knows how sensitive I am, & I could absolutely NOT let her see me cry. It was the hardest thing I’ve ever been through, including surviving metastatic cancer…",
      "created_utc": 1718667588.0,
      "score": 16
    },
    {
      "id": "l96odhk",
      "body": "Thank you for the advice. I have not cried around her, I actually haven't cried at all. I'm focused on getting her into a psychologist which is proving impossible atm so l am pissed off and not going to stop until someone helps her.",
      "created_utc": 1718732338.0,
      "score": 4
    },
    {
      "id": "l92qrb3",
      "body": "100% this.",
      "created_utc": 1718666479.0,
      "score": 8
    },
    {
      "id": "l990qg7",
      "body": "I took that and had suicidal thoughts since. I was 14 and I’m almost 21.\n\nWish doctors would stop pushing it. Birth control did the trick when I actually got periods.",
      "created_utc": 1718763061.0,
      "score": 2
    },
    {
      "id": "ll9hf4t",
      "body": "Oh wow. My son age 16 is in the hospital on suicide watch right now after taking isotretinoin. He is mad at me because he ran off into the night saying delusional things and I knew he wasn’t ok. I called the sheriff for help And he told them he was planning on ways to die including throwing himself in traffic (he was 2 blocks from the highway). He has been in the hospital for 3 days now and is in terrible condition. But he is alive and physically intact. He still won’t talk to me, he’s so shut down. Can’t believe I found this thread, thank you. Do you have words of advice for me? This is the first time my son doesnt trust me. He doesn’t trust anyone except for his best friend, who thankfully i gave his number to and he called today.",
      "created_utc": 1725341320.0,
      "score": 2
    },
    {
      "id": "l93hpxr",
      "body": "Here to Echo this!! I'm much older now, but I started self harming at 13 and slit my wrists at 15. My mom forced me into therapy and tried to force meds on me and I just shut down and refused to speak to the therapist or take any meds. She also hid all the knives in the house and id have to ask her to cut my meals for me...it was humiliating and I felt isolated, and then didn't tell her anything ever. And i started hiding my own knives.\n\n Coming down hard on your kid likely will not help and will only distance you from her further and she'll continue to hide things. for me...it severely strained our relationship.  Talk to her and let her know you love her and you're there for her,  but ASK her how you can support her and let her tell you. Don't just assume and do things. And don't force her to talk to you.",
      "created_utc": 1718677268.0,
      "score": 3
    },
    {
      "id": "l96r7o3",
      "body": "Thank you for understanding my vent and not judging my poorly written words. I am devastated. I watched my tiny girl, my first born be held down half naked on a bed by 11 nurses, security guards and police while she was basically on another planet. She is the most polite, kind and shy girl. She would be absolutely horrified if she could remember what she went through that night. There was so much more that I witnessed that night that gives me nightmares. Unlike what some commenters believe, I have not let her see me cry, I have not been dismissive or angry towards her and what she did. I came here to vent just because I am getting NO help and turned away from every service I contact so just needed to vent to someone. \nI have screenshot your suggestions it’s extremely helpful.",
      "created_utc": 1718733265.0,
      "score": 5
    },
    {
      "id": "l92qzxl",
      "body": "Do you happen to have a family history of mental illness that you know of? Genetics are huge",
      "created_utc": 1718666571.0,
      "score": 3
    },
    {
      "id": "l93kerk",
      "body": "I had (and have) a very similar life experience, except I waited way too long to get help. I’m glad you are in a good place.",
      "created_utc": 1718678364.0,
      "score": 3
    },
    {
      "id": "l96pxvk",
      "body": "Thank you for your comment, I appreciate your insight.",
      "created_utc": 1718732851.0,
      "score": 2
    },
    {
      "id": "l92erqd",
      "body": "Tagging onto this- I’m 23 now, and my parents *still* don’t know about the sexual trauma I experienced in my early pubescent years online. It becomes a shame secret. Just because you haven’t seen it and she hasn’t told you doesn’t mean there hasn’t been something big and scary in her life.\n\nOn the swing side, it’s also not necessary for her to have trauma to feel this way. Mental illness is a disease and it spares no one with its cruelty. So sorry you’re going through this OP :(",
      "created_utc": 1718661859.0,
      "score": 18
    },
    {
      "id": "l91o9d0",
      "body": "And by the way, as a parent, don't give up. Provide your daughter with professional help. A psychologist or something like that, I don't know what's best. This attempt has to come from somewhere. Surely a professional will help your beloved daughter and leave everything in order in her mind. All the best.\n\n(I apologize if my English is not the best )",
      "created_utc": 1718652761.0,
      "score": 12
    },
    {
      "id": "l96jnub",
      "body": "Thank you. I hope you are doing well",
      "created_utc": 1718730787.0,
      "score": 1
    },
    {
      "id": "l96rkoz",
      "body": "Thank you for your kind words. The hospital and her made a safety plan and I am her safe person. So I believe/ hope that I am doing the best I can.",
      "created_utc": 1718733381.0,
      "score": 4
    },
    {
      "id": "l96sbgp",
      "body": "Thank you, I needed to read this. I just want her to be happy and have a happy life",
      "created_utc": 1718733621.0,
      "score": 3
    },
    {
      "id": "l96jijl",
      "body": "Thank you",
      "created_utc": 1718730739.0,
      "score": 1
    },
    {
      "id": "l96pqi2",
      "body": "Thank you for your kind and thoughtful comment. I will take on the advice you have offered. \nIt was extremely traumatic. At one point there was 11 staff holding her down on the hospital bed as she was trying to escape. She maxed out on the sedative they gave her, that’s how delusional she was. It was horrific to witness. \n\nI’m glad you are still here you have a lot to offer the world. Your comment comforted me. Thank you again.",
      "created_utc": 1718732784.0,
      "score": 3
    },
    {
      "id": "l96spcn",
      "body": "I have not said that to her as I know that wouldn’t help. I did ask her why she did it but someone commented I shouldn’t ask that. Definitely trying to validate her pain. Thank you for your words. I hope you are doing okay.",
      "created_utc": 1718733749.0,
      "score": 3
    },
    {
      "id": "l96st14",
      "body": "I am glad you are still here. \n\nI am trying so hard to get her help, it seems impossible atm but I won’t stop.",
      "created_utc": 1718733783.0,
      "score": 3
    },
    {
      "id": "l96u9i9",
      "body": "I understand what you’re saying and appreciate it but I don’t believe I need to pay more attention to her. She gets so much attention from me, we are best friends and do everything together. We lay in her bed every night and have deep conversations and she is extremely honest in what she tells me. I never meant to imply she has a perfect life I just meant that she is not being hit at school, or SA, all the stereotypical reasons for SH. Which is why I was so shocked.",
      "created_utc": 1718734264.0,
      "score": 3
    },
    {
      "id": "l9w2dzh",
      "body": "Are you sure.  I never was.  Therapists are there for the money.  They don't know you and don't care about you.  Just put into practice what they've read in books.  Yeah some people come out the other end and for some its perpetuating misery.",
      "created_utc": 1719142770.0,
      "score": 1
    },
    {
      "id": "l96ufv7",
      "body": "Thank you for your kind words I appreciate it.",
      "created_utc": 1718734322.0,
      "score": 1
    },
    {
      "id": "l96v0ba",
      "body": "Thank you for writing this and I hope some others who commented read it to. I am trying to get her a psychologist, it’s been difficult. I won’t give up though. I’m sorry your mind has been against you for so long",
      "created_utc": 1718734507.0,
      "score": 2
    },
    {
      "id": "l96v30u",
      "body": "I am trying to get her both of those. I just want her to be happy",
      "created_utc": 1718734531.0,
      "score": 2
    },
    {
      "id": "l96lqhc",
      "body": "I’m glad you are still here. Thank you for your kind words. I’m trying to get her help but it’s so much more difficult than I ever imagined! I won’t stop though.",
      "created_utc": 1718731473.0,
      "score": 1
    },
    {
      "id": "l96lkbi",
      "body": "Thank you for being kind. I’m doing everything I can do get her the help she needs",
      "created_utc": 1718731418.0,
      "score": 2
    },
    {
      "id": "l96t7it",
      "body": "Thank you. I’m trying to get her medication. Our family GP said she is too young. So currently looking for another doctor!",
      "created_utc": 1718733917.0,
      "score": 3
    },
    {
      "id": "l93y25x",
      "body": "I second this!!",
      "created_utc": 1718684629.0,
      "score": 1
    },
    {
      "id": "l92hmm6",
      "body": "I believe we’re now into gen alpha.\n\nThese are the worst of the worst for depression.\n\nHigh pressures from everywhere.\n\nFakeness online that’s so deep it’s hard to spot and they’ve never known different.\n\nJust be there.\nAlways.\nMake it clear.\n\nDon’t demand answers from her as she may not yet have words.\n\nDo this and take the second chance you got with your child.\n\nEven in the days when she’s in a mental mess and crying and has no words for it; tell your child you love them and they could never do or say anything that would change that.\n\nLIVE it don’t just say it.\n\nLiving this love will help them find stronger roots in themselves.",
      "created_utc": 1718662943.0,
      "score": 7
    },
    {
      "id": "l96v8hr",
      "body": "Thank you",
      "created_utc": 1718734580.0,
      "score": 2
    },
    {
      "id": "l96uqcp",
      "body": "I am not looking the other way at all.. I have rung over 20 psychologists to try and get her an appointment. I will do anything to make sure she has a happy life",
      "created_utc": 1718734416.0,
      "score": 1
    },
    {
      "id": "l96wexp",
      "body": "I am trying the psychologists I have rung won’t take her while she is in crisis. I’m so angry. I won’t stop trying though",
      "created_utc": 1718734971.0,
      "score": 4
    },
    {
      "id": "l96l8r0",
      "body": "Thank you for your kind words. I’m trying to get her help but it’s quite difficult I’m so frustrated at the whole system! I’m glad you are still here",
      "created_utc": 1718731311.0,
      "score": 2
    },
    {
      "id": "l96ukan",
      "body": "No she took travel sickness tablets.",
      "created_utc": 1718734362.0,
      "score": 1
    },
    {
      "id": "l96vpcq",
      "body": "Yes we talk every night before she goes to sleep. I lay in her bed and we talk about her day, I brush and plait her hair and she’ll show me funny videos etc. she’s never out of my sight but also I have asked her.",
      "created_utc": 1718734735.0,
      "score": 3
    },
    {
      "id": "l96vf8y",
      "body": "Thank you. I am trying, I just want her to be happy",
      "created_utc": 1718734641.0,
      "score": 2
    },
    {
      "id": "l96n5aq",
      "body": "Thank you. I’m so sorry those things happened to you. I hope you are doing okay. \nI am trying so hard to get her into a psychologist but none will take her as she is “in an acute crisis”. I’m disgusted in the system.",
      "created_utc": 1718731932.0,
      "score": 2
    },
    {
      "id": "l96mu25",
      "body": "Thank you. I hope you are doing well",
      "created_utc": 1718731829.0,
      "score": 1
    },
    {
      "id": "l96mq8c",
      "body": "I’m trying, they keep saying they won’t take her as she is in an “acute crisis”. I’ve rang 24 psychologists. Waiting on a call back from the public youth mental health team to see if they will let her see their psycs there. I’m trying but the system seems so terrible",
      "created_utc": 1718731794.0,
      "score": 2
    },
    {
      "id": "l96kyok",
      "body": "It’s not like I have said that to her face! I did write that I was venting. She’s just a little girl, still wants to have sleepovers in my bed with her little sister. She’s never out of my sight. Tells me everything that happens with her friends, I have full access to her phone if need be. I have been trying to get her help and no one will help while she is “in crisis as they cannot meet her high level needs” and I don’t feel like sending a just turned 13 year old to an inpatient facility will do her any good. I’m trying to help her but getting nowhere. Every psyc is full or won’t take her, they won’t give her any meds because she is “too young”. So I’m lost as to what I should do hence my vent here.",
      "created_utc": 1718731220.0,
      "score": 2
    },
    {
      "id": "l92ueg2",
      "body": "[deleted]",
      "created_utc": 1718667925.0,
      "score": 1
    },
    {
      "id": "l93xtx7",
      "body": "that is factually incorrect",
      "created_utc": 1718684508.0,
      "score": 3
    },
    {
      "id": "l93sis1",
      "body": "Why are you getting downvoted..? Is there something I'm missing...??",
      "created_utc": 1718681844.0,
      "score": 0
    },
    {
      "id": "l93sl7i",
      "body": "jesus fucking christ .",
      "created_utc": 1718681876.0,
      "score": 7
    },
    {
      "id": "l99kbjw",
      "body": "I'm insecure in my 9 year relationship, i would like to change that but I can't right now, my mental health is at an all time low, I want to die but I need to keep going",
      "created_utc": 1718772425.0,
      "score": 3
    },
    {
      "id": "l945d0s",
      "body": "How do you just casually decide ‘yeah no you’re not my friend’ and magically find someone else…?",
      "created_utc": 1718688654.0,
      "score": 6
    },
    {
      "id": "l93a7ho",
      "body": "Parents can definitely get in the way of seeking help. Of you want therapy or medication as a minor, a parents permission is always needed and some parents don't believe in that stuff. Its also why a lot of people are getting diagnosed with disorders later in life. Either they had the resources or not, if a parent doesn't want, then its not gonna happen. It sucks. :(",
      "created_utc": 1718674292.0,
      "score": 22
    },
    {
      "id": "l92rbr0",
      "body": "probably family or financial pressures is my guess :/ or even just opening up about it might be difficult",
      "created_utc": 1718666700.0,
      "score": 45
    },
    {
      "id": "l9458c9",
      "body": "My parents :(",
      "created_utc": 1718688571.0,
      "score": 8
    },
    {
      "id": "l9kyq1o",
      "body": "As a teenager (14 now) who has been suicidal since age 11 and never told anyone. It’s much more harder as a kid to come clean about this. You don’t want to cause a big scene and this would be a massive scene all eyes on you. It’s not a pretty picture. Sure therapy could help but it’s asking for help that’s the problem  ",
      "created_utc": 1718952800.0,
      "score": 4
    },
    {
      "id": "l94z3p3",
      "body": "Well is an overstatement— but I’m managing",
      "created_utc": 1718709165.0,
      "score": 6
    },
    {
      "id": "l94p7h1",
      "body": "I’m sorry you have to go through this and at the same time I’m sorry for your mother as well :( if you ever want to talk to a stranger that will give you a non biased opinion or just someone to vent to without being biased I’m here for you. I don’t know your situation but most times mothers just want to be there for their kids. Remember it’s her first time living life as well. You are strong and will get through this! <3",
      "created_utc": 1718702713.0,
      "score": 5
    },
    {
      "id": "l9w1vi7",
      "body": "Yep I've been there.",
      "created_utc": 1719142465.0,
      "score": 1
    },
    {
      "id": "l9ab3n7",
      "body": "I’m sorry to heart that…I hope you get the help you deserve at least:( <3",
      "created_utc": 1718790480.0,
      "score": 1
    },
    {
      "id": "l95ka6f",
      "body": "I'm sorry to hear that hope your getting the help you need",
      "created_utc": 1718718693.0,
      "score": 5
    },
    {
      "id": "l97blxh",
      "body": "I'm very sorry to hear that you were a child I can't believe there are people who think about children like that",
      "created_utc": 1718740013.0,
      "score": 2
    },
    {
      "id": "l9yne29",
      "body": "What the hell are you talking about. Getting a psych hold is not prison and obviously her mom didn’t know enough to get her any help before. It took me getting into psych hold after taking a bunch of pills and taping a bag over my head and then getting found and Held to get any better…in my 30s now and life isn’t perfect but atleast I’m still here and experiencing the good things of life. idk the fuck you’re talking about. Especially when it comes to suicide",
      "created_utc": 1719178883.0,
      "score": 1
    },
    {
      "id": "l9ynriq",
      "body": "And I’m obviously not alone in here when almost 200 ppl have agreed smfh",
      "created_utc": 1719179025.0,
      "score": 0
    },
    {
      "id": "l91tyug",
      "body": "while this is true oftentimes outside situations do trigger drastic actions like suicide. not always, but often. speaking from experience.",
      "created_utc": 1718654664.0,
      "score": 125
    },
    {
      "id": "l91u9wz",
      "body": "I know so she needs therapy, maybe that helps. But in general it’s better to do something or at least try and show her that she’s not alone instead of just keep going.",
      "created_utc": 1718654767.0,
      "score": 21
    },
    {
      "id": "l92d2el",
      "body": "[removed]",
      "created_utc": 1718661227.0,
      "score": 44
    },
    {
      "id": "l93q6he",
      "body": "So true. And, the sad and scary thing as a parent is that not wanting to be alive in this world anymore doesn't really even need much of a reason either. \n\nFrankly, don't have to be mentally ill to want to commit suicide and not be in this world.",
      "created_utc": 1718680774.0,
      "score": 9
    },
    {
      "id": "l9597n7",
      "body": "Yep, mental illness is a bitch.",
      "created_utc": 1718714183.0,
      "score": 3
    },
    {
      "id": "l93h3ip",
      "body": "I came here to say this",
      "created_utc": 1718677016.0,
      "score": 3
    },
    {
      "id": "l91v1fh",
      "body": "[deleted]",
      "created_utc": 1718655023.0,
      "score": -59
    },
    {
      "id": "l93sd7q",
      "body": "Genuinely though, sometimes there ARE NO SIGNS. It can be a little on the rarer side to not show any signs at all, but it definitely is possible.",
      "created_utc": 1718681772.0,
      "score": 8
    },
    {
      "id": "l96otyd",
      "body": "I will admit I did ask her something similar to this so thank you for the insight.",
      "created_utc": 1718732489.0,
      "score": 3
    },
    {
      "id": "l93p1h9",
      "body": "Thank you for putting in your experience. I'm saying this as a currently 23 year old and I've been struggling greatly and my parents are treating me like a teen again and I already had the overcontrolling teenage years with them. To feel like I'm back in that place almost 10 years later has been extremely detrimental to me.\n\nAnd can only imagine + ur comment that treating mentally ill individuals like toddlers creates worse outcomes for the suffering person like 98% of the time",
      "created_utc": 1718680283.0,
      "score": 1
    },
    {
      "id": "l9768ps",
      "body": "im glad i could help! i understand. the fact you made this post at all is a sign you really care for and want to help your daughter. you’re actively searching for ways to help her get better. thats the first step, and a lot more than some parents do.",
      "created_utc": 1718738231.0,
      "score": 3
    },
    {
      "id": "l9c0akw",
      "body": "Was once a shy person. I feel like people sometimes think they know a person just because she/he is quiet. You probably don't know a lot about her. Try to get her to be a lot more open around you. I don't know how but I'm sure you can do it. Good luck. ",
      "created_utc": 1718816347.0,
      "score": 0
    },
    {
      "id": "l952yqp",
      "body": "Genetics, medications, environmental factors, even hormones!.. There's so much to look into, and as a parent that can be incredibly difficult sometimes.",
      "created_utc": 1718711217.0,
      "score": 2
    },
    {
      "id": "l97vs91",
      "body": "Yeah of course. I really hope things turn out okay. This is an awful thing to go through.",
      "created_utc": 1718746774.0,
      "score": 1
    },
    {
      "id": "l96z3jd",
      "body": "Any time",
      "created_utc": 1718735864.0,
      "score": 1
    },
    {
      "id": "l96v81b",
      "body": "You seem like a good parent, she's lucky to have you.",
      "created_utc": 1718734576.0,
      "score": 2
    },
    {
      "id": "l934boc",
      "body": "[removed]",
      "created_utc": 1718671939.0,
      "score": 2
    },
    {
      "id": "l94wk3x",
      "body": "Wtf, rude",
      "created_utc": 1718707687.0,
      "score": 0
    },
    {
      "id": "l93zwx3",
      "body": "[deleted]",
      "created_utc": 1718685639.0,
      "score": -2
    },
    {
      "id": "l941ype",
      "body": "maybe because he and his son used alternative medicine/seeing a naturopath rather than going to a psychiatrist/being on medication? not everyone thinks \"alternative medicine\" works. it does for some, it doesn't for others.",
      "created_utc": 1718686798.0,
      "score": 5
    },
    {
      "id": "l945m4g",
      "body": "If they’re actually bad friends they’ll do or say something that you can use as justification. Don’t leave the good people. For me, it took her calling me some things and being overall a bad person. We’re friends now because she had like a year to change. Anyways you don’t just leave your friends. They do something to make you leave.\n\nEdit: Also you aren’t gonna magically find someone else. I found someone new at the start of the school year and we clicked. Don’t just go out and expect to make new friends. Rushing into things is how you make bad choices and end up with bad people.",
      "created_utc": 1718688810.0,
      "score": 19
    },
    {
      "id": "l95fwiq",
      "body": "People who were my supposed friends ghosted me every single one of them.  Ive never had a loyal friend.  They magically disappear",
      "created_utc": 1718716981.0,
      "score": 5
    },
    {
      "id": "l97fefs",
      "body": "Pretty much. I may explain myself or give them a heads up but usually I just cut them off and wipe my hands clean.",
      "created_utc": 1718741260.0,
      "score": 2
    },
    {
      "id": "l9v543m",
      "body": "I’m currently going through this issue with my dad, I live with mom full time after I left my dads house for abuse allegations (medical neglect, I’m T1D and he was hiding meds/equip.) he refuses to sign consent on anything therapy/MH related on the grounds of “it’s bullshit, and that’s not the problem” when I have had numerous school counselors/therapists and others tell me I NEED to see a therapist/MH expert",
      "created_utc": 1719119695.0,
      "score": 2
    },
    {
      "id": "l92u2kd",
      "body": "I figured but I wanted the OP to answer. But I'm with you. :-(",
      "created_utc": 1718667794.0,
      "score": 15
    },
    {
      "id": "l94jbhe",
      "body": "Is there any way you can talk to them? Do they not believe in therapy? Is it a cultural thing, a religious thing? Maybe you can ask you parents to speak to someone from your cultural or religious group that's a therapist. \n\nHave you tried just telling your parents that you feel extremely sad or whatever it is that you're feeling? That you think you need help from a professional. That this help could make you closer to them because it would improve how you handle stress?",
      "created_utc": 1718698325.0,
      "score": 6
    },
    {
      "id": "l9pc8tr",
      "body": "As a 30 year old who was once a 13 year old who cut herself and attempted suicide, I understand how damn hard it is, but I can say I'm so happy I got help and I'm so happy I didn't die. And guess what? All of the shit I went through, it made me become a therapist. \n\nYou are right, asking for help is tricky and I wish it wasn't like this. I really really wish kids and teens could get help without permission.",
      "created_utc": 1719019861.0,
      "score": 1
    },
    {
      "id": "l95k7rh",
      "body": "When I was reading what you said I was thinking it seems like emotional neglect from your family.",
      "created_utc": 1718718668.0,
      "score": 1
    },
    {
      "id": "l94u8mq",
      "body": "I have, for the most part, managed to work with and get past my mental issues. I don't have suicidal thoughts too often anymore. She still worries though so I don't tell her about the bad things I have seen and had to do. Like she will never know that the actual reason that the guy I thought was my best friend is dead is because he tried to kill me and I ended up kill him into the scuffle instead",
      "created_utc": 1718706227.0,
      "score": 3
    },
    {
      "id": "l9892pi",
      "body": "I dont give a f tbh, no trauma, tho im Lucky i got no stds",
      "created_utc": 1718751820.0,
      "score": 1
    },
    {
      "id": "l940n1i",
      "body": "And if you asked mine, they’d say yes to both. And I’ve talked to others who said no to both. Mental illnesses don’t give a fuck.",
      "created_utc": 1718686041.0,
      "score": 8
    },
    {
      "id": "l92or3y",
      "body": "yes you are.",
      "created_utc": 1718665696.0,
      "score": 9
    },
    {
      "id": "l94jjft",
      "body": "If you know the person or live with the person and have been attuned to their mannerisms, behavior, vibe, facial expressions, you will see signs. It just takes a good observer. Or an empathetic/sensitive person. \n\nAs a therapist, and as a empathic human, my gut and my observations usually are able to pick up signs.",
      "created_utc": 1718698489.0,
      "score": 3
    },
    {
      "id": "l9392g3",
      "body": "[deleted]",
      "created_utc": 1718673829.0,
      "score": 1
    },
    {
      "id": "l94jjjk",
      "body": "i won’t waste my time doing so, as they are not that hard to find. i do a lot of research on various countries, many of which are third world. depression (and in turn, suicide) are very real in those places as well, especially as so many of them have underfunded and outdated (if any) mental health support. all you have to do is look it up.",
      "created_utc": 1718698491.0,
      "score": 1
    },
    {
      "id": "l9425go",
      "body": "Ahhhh I see. Well Idk... I mean, we don't really have any details...maybe the son didn't want to be on meds? There is always a bigger picture. But I can understand that. I just don't think it's a reason to be mad...doesn't everyone have their own way of healing?? Not saying it's right or wrong. I'm just saying some of yall really have big balls to sit here and judge someone on how they heal on a SUICIDE post.",
      "created_utc": 1718686909.0,
      "score": 0
    },
    {
      "id": "l951a6e",
      "body": "Sorry if that comment sounded offensive, I didn’t mean to.",
      "created_utc": 1718710350.0,
      "score": 4
    },
    {
      "id": "l95k0qh",
      "body": "What your advice with socializing and making new friends?",
      "created_utc": 1718718592.0,
      "score": 1
    },
    {
      "id": "l95g1s9",
      "body": "Aw, I’m sorry about that. Wish people were nicer",
      "created_utc": 1718717038.0,
      "score": 2
    },
    {
      "id": "l9ow08g",
      "body": "I love you. People love you. Friends are so replaceable belive me. You know what's not? Life, personality, body, beliefs and values. Enjoy them and use them to your advantage to meet people. I'm an 5'2 18 yeatold male and the only reason I have friends is because I talk to everyone. Im not even funny or cool. I'm just extroverted. That you can try to fake",
      "created_utc": 1719012971.0,
      "score": 2
    },
    {
      "id": "l97k9aj",
      "body": "Cut them off and wipe my hands clean makes me think murder.",
      "created_utc": 1718742860.0,
      "score": 1
    },
    {
      "id": "l9v8o4z",
      "body": "I'm so sorry you're going thru that. I wish there was some way you could get therapy without your dad's consent. Also, whats T1D?",
      "created_utc": 1719121913.0,
      "score": 1
    },
    {
      "id": "l94ywws",
      "body": "I can’t do that, trust me. I won’t go into detail but according to my mother things like that don’t exist and therapists are evil.",
      "created_utc": 1718709061.0,
      "score": 6
    },
    {
      "id": "l95kan8",
      "body": "I guess yeah",
      "created_utc": 1718718699.0,
      "score": 3
    },
    {
      "id": "l94vad0",
      "body": "That got serious real fast",
      "created_utc": 1718706900.0,
      "score": 3
    },
    {
      "id": "l95q2bh",
      "body": "oh shit :( I can only imagine what you’re going through :( but I’m so proud of you for working with your mental issues. You are so so strong!!!",
      "created_utc": 1718720832.0,
      "score": 1
    },
    {
      "id": "l94zsee",
      "body": "Are you a therapist? :0",
      "created_utc": 1718709548.0,
      "score": 1
    },
    {
      "id": "l94wbnl",
      "body": "[removed]",
      "created_utc": 1718707545.0,
      "score": 1
    },
    {
      "id": "l94sy8l",
      "body": "[deleted]",
      "created_utc": 1718705372.0,
      "score": 0
    },
    {
      "id": "l9429ve",
      "body": "I mean genuinely, if it helps, it helps, no one should be judged for how they choose to heal....",
      "created_utc": 1718686981.0,
      "score": 1
    },
    {
      "id": "l969lvy",
      "body": "[removed]",
      "created_utc": 1718727472.0,
      "score": 0
    },
    {
      "id": "l96luho",
      "body": "No, you’re good. I didn’t take it that way.",
      "created_utc": 1718731509.0,
      "score": 2
    },
    {
      "id": "l96mh0s",
      "body": "Yikes. I honestly don’t have much. When I talk to people in person it’s normally them starting the conversation. One of my current friends talked to me and we clicked so we just kind of became friends. I will say something that helped me with talking, especially presenting, is don’t see it as embarrassing. If you say something weird or wrong it’s only embarrassing if you make it embarrassing. Once you accept that and just go with the flow talking isn’t hard at all. I open up in conversation and engage in it a lot more than I did before highschool.",
      "created_utc": 1718731710.0,
      "score": 2
    },
    {
      "id": "l9umfim",
      "body": "You're also 18. You are still so young and have vibrance and energy and youth.  I'm fucking almost 40. Just turned 39. So I've been through a lot .... and I mean a lot more when it comes to people. Trust me when I say everyone is fake.  You think you have a best friend? Guaranteed in ten years you guys will hardly talk if at all.  Lol.i used to have a huge group of friends. They all ended up being shifty. By the way you are short! No offense.  I'm 5'4.",
      "created_utc": 1719109933.0,
      "score": 1
    },
    {
      "id": "l97olcm",
      "body": "Well if they backstabbers… 😏",
      "created_utc": 1718744286.0,
      "score": 2
    },
    {
      "id": "l9v8shc",
      "body": "T1D is short for type 1 diabetes, also my moms lawyers are working on getting it so she had sole decision making so this is no longer an issue",
      "created_utc": 1719121989.0,
      "score": 1
    },
    {
      "id": "l96o0i2",
      "body": "I'm very sorry to hear this. I don't know why she feels like that, but as a reminder therapists are not psychiatrists. Therapists can't and don't prescribe medicine.",
      "created_utc": 1718732219.0,
      "score": 2
    },
    {
      "id": "l95ku2h",
      "body": "Hope you can get the help you need eventually.",
      "created_utc": 1718718900.0,
      "score": 1
    },
    {
      "id": "l94vkny",
      "body": "Hey I feel like if there is any good place to trauma dump on reddit it's here",
      "created_utc": 1718707080.0,
      "score": 4
    },
    {
      "id": "l96nf9o",
      "body": "Yes",
      "created_utc": 1718732025.0,
      "score": 1
    },
    {
      "id": "l94yu22",
      "body": "the covid vaccine is literally irrelevant here?? you’re fighting with no leg to stand on. \n\nand i majored in psychology, so that argument doesn’t work either. you can’t be bothered to do simple research that prove you wrong, so you’re fighting with feelings, not facts - and i’m the bag of emotions? lmao",
      "created_utc": 1718709016.0,
      "score": 2
    },
    {
      "id": "l96da26",
      "body": "My point is that maybe the child said NO. I'm not saying that it should be the first option. Infact I definitely wouldn't take my kid to one if had a kid. But unfortunately, there are people out there who either don't \"believe\" in going to psychiatry or being on medication. It's stupid yes; but that's just how it is. Like I said , if it helps it helps. No mind thinks alike . That's just the way it is.",
      "created_utc": 1718728683.0,
      "score": 2
    },
    {
      "id": "l96lx3d",
      "body": "Thank god😭",
      "created_utc": 1718731532.0,
      "score": 1
    },
    {
      "id": "l97orxd",
      "body": "😱",
      "created_utc": 1718744345.0,
      "score": 3
    },
    {
      "id": "l96o638",
      "body": "I’m not sure ☹️",
      "created_utc": 1718732270.0,
      "score": 2
    },
    {
      "id": "l95kvsh",
      "body": "Thanks 🫶🏼",
      "created_utc": 1718718918.0,
      "score": 2
    },
    {
      "id": "l94vuyn",
      "body": "Oh that's true, i mean, reddit itself is a nice place to trauma dump, I feel safe here like I never did on any social media before",
      "created_utc": 1718707258.0,
      "score": 5
    },
    {
      "id": "l96nigk",
      "body": "Just wondered but I realized you said it in your comment lol- are therapists scary?",
      "created_utc": 1718732054.0,
      "score": 1
    },
    {
      "id": "ladr43a",
      "body": "completely agree with you.",
      "created_utc": 1719418115.0,
      "score": 1
    },
    {
      "id": "l96r39r",
      "body": "Lol. No. It may be scary to open up to one for the first time, but we're here to support you and to work together to increase your sense of well-being. \n\nA lot of us therapists tend to have family or personal experiences with mental illness, which is why we go into the field to begin with. There's nothing and I mean nothing I haven't heard. Nothing is \"crazy\" , no thought is \"insane\" and actually I dislike those words. They are harmful. Trust me on this, I've heard it all. I doubt anything can shock me at this point.",
      "created_utc": 1718733224.0,
      "score": 1
    },
    {
      "id": "l96rayg",
      "body": "That’s comforting. Maybe future me will remember you and seek help to heal current me :)",
      "created_utc": 1718733294.0,
      "score": 1
    },
    {
      "id": "l96s2vr",
      "body": "I'm also here now. Just as an FYI. But if not now, that's understandable, I hope to talk to future you 😊",
      "created_utc": 1718733544.0,
      "score": 1
    }
  ]
}