{
  "id": "1i3wezz",
  "title": "i fucking failed.",
  "selftext": "i just tried to hang myself, the rope slipped off and i feel pretty hard onto my pregnant stomach. I've been crying from possibly hurting my baby, which is weird because I'm aborting it in 6 days. i love that baby and i don't want to kill it but i don't have a choice im 16 and all alone. i hate myself even more. ive been trying to comfort my baby but i hate myself i hate myself i hurt my child. I keep on fucking crying over my fucking rapists baby fuck fuck fuck i need to die fuck if im gonna abort my baby i need to die to fuck. if I kill myself it will kill both of us. if it doesn't get to live neither do i.                                                                       \n\nhey I'm back please stop sending me messages about god and the fact he's gonna hate me if i get an abortion please fucking stop i don't believe in god and your making it fucking worse please stop stop stop please.                ",
  "created_utc": 1737163874.0,
  "score": 753,
  "num_comments": 170,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1i3wezz/i_fucking_failed/",
  "comments": [
    {
      "id": "m7r498n",
      "body": "you might can reach out [RAINN](https://hotline.rainn.org/online) they specifically specialize in what you're going through.\n\nif not please know that what you're feeling in every form has a lot to do with hormones, trauma, and legitimate feelings. I'm sorry you're experiencing all of this.\n\nI had to make the same choice for the same reason at 14. I chose myself. That was my choice. None of this was your fault.",
      "created_utc": 1737174437.0,
      "score": 127
    },
    {
      "id": "m7qw23i",
      "body": "Please get help.\n\nYou have some numbers you can call in the comments of your other post.\n\nYou could go to hospital.\n\nYou could go to a police station.\n\nYou could talk to a teacher or councillor at school.\n\nYou could even talk to your parents.\n\nIf the first person you ask doesn't help you try another person. Someone will help you.\n\nTry to tell them everything that has happened and how you are feeling.",
      "created_utc": 1737171013.0,
      "score": 236
    },
    {
      "id": "m7rf2i5",
      "body": "some people on this subreddit are quick to pull the ''but god'' card\n\ni don't get why they expect suicidal people to give a shit\n\nsrry for the small rant",
      "created_utc": 1737179562.0,
      "score": 182
    },
    {
      "id": "m7qljag",
      "body": "Go to the hospital or community clinic and tell them how you're feeling and what's happened. Tell them you want to see a social worker. A social worker will be able to set you up with support, they are much better connected than doctors, psychiatrists or psychologists. There is support out there for young mums - lots of support if you know where to look. This failed attempt just might be telling you it is not your time to go. While today might feel like the worst day of your life it just might be the beginning of some really good changes for you. Please keep us updated on how you're going.",
      "created_utc": 1737166979.0,
      "score": 152
    },
    {
      "id": "m7qow6q",
      "body": "Please choose yourself",
      "created_utc": 1737168253.0,
      "score": 122
    },
    {
      "id": "m7qs2lf",
      "body": "[removed]",
      "created_utc": 1737169450.0,
      "score": 49
    },
    {
      "id": "m7rsnlr",
      "body": "Hey sweetie, I know you're scared right now and feel alone but I promise you whatever you choose will be right for you (aside from hurting yourself). You don't deserve to be punished for reacting to someone else actions. Many of us will never have to experience the hurt and guilt you're going through we won't judge you. You did nothing wrong the monster who did this to you deserves the worst for what he's put you through and in time he'll get it but right now you need to focus on your health. Please do not do anything permanent. You need a chance to understand what you're feeling and your options going forward. I really hope you have adults you can trust around you if anyone isn't being supportive they don't deserve your time. This isn't at all the way you pictured 16 but I promise you my love things can get better. Don't let this tragedy shape you're future when you have so much potential.\n\nYou can be whatever you want to be if you'd just give yourself the chance. I'd love it if you could respond to some messages every once in a while so we know you're okay. Though I understand why this may be too pushy. If you respond to this I'd be happy to talk. \n\nI'm going to sleep but I hope when I wake up you're still here❤️",
      "created_utc": 1737187475.0,
      "score": 21
    },
    {
      "id": "m7rdwi0",
      "body": "[removed]",
      "created_utc": 1737178969.0,
      "score": 68
    },
    {
      "id": "m7qy9u4",
      "body": "Sorry you’re having to go through this. Just know that abortion is not immoral and that you will be sparing yourself and your child a life of hardship should you go through with it. Don’t let anyone guilt you into making the wrong choice. Your life is not over - it’s only just beginning. You will get through this.",
      "created_utc": 1737171912.0,
      "score": 47
    },
    {
      "id": "m7rp8h3",
      "body": "You're not ready now, but someday you will be, and both you and your future child deserve to have a father who loves both of you. Get the abortion and have no regrets. Make yourself the person your future child deserves and know that you made the best decision you could now.",
      "created_utc": 1737185362.0,
      "score": 31
    },
    {
      "id": "m7smo78",
      "body": "There's nothing wrong with having an abortion, especially in your position. You also need to take care of yourself, this is not your fault and you deserve help to deal with the trauma and suicidal thoughts. This is not your fault and it is so heartbreaking and devastating that you got pregnant but SA, please please be kind to yourself.",
      "created_utc": 1737205014.0,
      "score": 12
    },
    {
      "id": "m7qktne",
      "body": "Pregnancy is very hard on your body, I think the abortion would be a much, much better option. I know you’re alone right now and things feel impossible, but please keep going just for a little bit longer.",
      "created_utc": 1737166710.0,
      "score": 67
    },
    {
      "id": "m7rbhbd",
      "body": "It would have been good if u had someone you can trust near you, parents or anyone who's worthy of your trust ,a responsible person.",
      "created_utc": 1737177764.0,
      "score": 10
    },
    {
      "id": "m7rc263",
      "body": "I’m so sorry, please get help. \ngo somewhere to talk to someone please. \nyou have a lot ahead of you.",
      "created_utc": 1737178050.0,
      "score": 11
    },
    {
      "id": "m7ssp8o",
      "body": "[removed]",
      "created_utc": 1737207511.0,
      "score": 28
    },
    {
      "id": "m7vu7gs",
      "body": "You're in a bad situation. God isn't going to hate you regardless of what assholes on reddit say or think.",
      "created_utc": 1737242143.0,
      "score": 9
    },
    {
      "id": "m7r1sbr",
      "body": "Please call 911",
      "created_utc": 1737173372.0,
      "score": 14
    },
    {
      "id": "m7sko4b",
      "body": "Nobody will hate you- people who shove down god will hate you down your troat. Dont listen to them.\nHave you contacted the police? And do you have anyone you can talk to?",
      "created_utc": 1737204107.0,
      "score": 6
    },
    {
      "id": "m7sr6iu",
      "body": "hey baby girl, ur oldernsister (21f) here. pls  go to the hospital.  ur so young ur future is so bright! i love u. all of us here loves u. where are u located? theres subreddits where u can get an older wonan to accompany u to the hospital",
      "created_utc": 1737206905.0,
      "score": 12
    },
    {
      "id": "m7u2q75",
      "body": "Those who send you messages about God and all that are morbid sick people, don't enter the DM because it will be worse (I don't know if there is an option to make it impossible to receive messages from anyone in Reddit ).",
      "created_utc": 1737222405.0,
      "score": 6
    },
    {
      "id": "m7qlkqq",
      "body": "A social worker can get you completely set up with TONS of resources for food, housing, baby supplies etc if you’re open to that. And if not, making the other choice is up to you too. But it sounds like you’re not okay with it. You didn’t fail. You’re struggling. Reach out and let others help you. :)",
      "created_utc": 1737166994.0,
      "score": 32
    },
    {
      "id": "m7qhrf6",
      "body": "Oh honey you won’t kill the baby if you can still abort it",
      "created_utc": 1737165569.0,
      "score": 46
    },
    {
      "id": "m7u6ugr",
      "body": "Oh sweetie I am so sorry you’re going through this. What happened to you is terrible and you did not deserve this. Please don’t hate yourself. It is not your fault. It is perfectly understandable that you feel confused, afraid and angry. \n\nYou need help and you need it now. Please don’t be ashamed to ask for help, it’s really okay and people will welcome you. Is there a trusted adult you can talk to? A parent, or relative? Or someone at school that you feel safe with, like a councillor maybe? The main thing is that you need help and looking after urgently. Please reach out to someone you feel safe with.",
      "created_utc": 1737223619.0,
      "score": 5
    },
    {
      "id": "m7v5ua1",
      "body": "I’m sorry you’re being harassed by the anti-choice folks ♥️",
      "created_utc": 1737234480.0,
      "score": 6
    },
    {
      "id": "m7qzf61",
      "body": "My mom had me at 16, I'm 39 now with 2 kids, I'm at a loss for words. Prayers,I just want you to know I'm praying and will be your friend here. Sorry if you're not spiritual, but I just had to let you know.",
      "created_utc": 1737172384.0,
      "score": 17
    },
    {
      "id": "m7r5lx2",
      "body": "Putting the baby up for adoption is also an option if you feel it would be too difficult on you to raise the baby or have an abortion. You have so much more life to live. And I think in your situation, it may give you a lot of peace to know that even tho you couldn’t take on being a mother to the child, that they are still out there having a life and breathing. \n\nPlease talk with someone. Maybe this was your sign that it’s not your time to go. You can still do so much good in this world. Maybe one day help other poor little girls in a similar situation.",
      "created_utc": 1737175036.0,
      "score": 16
    },
    {
      "id": "m7uul5g",
      "body": "honey, you're 16. you're a child!! a teen!!  \ni have a very, very good friend who was in your shoes: a scared teenager, assaulted, impregnated, and suicidal. they were there. the abortion was a medical one, not a surgical one. and it was a lot, but the peace of knowing they're free was what got them through. today, they have a beautiful girlfriend, two adorable pets, a job they enjoy, and a life worth fighting tooth and nail for.   \nit's perfectly normal to feel protective over the fetus. i promise--our brains are hard-wired to release hormones that make us feel exactly that. it doesn't mean you're making the wrong choice or that what you're doing is not in your best interest. get the abortion, and know you're a sentient child who will have a better life because of it. do what you need to do--there are plenty of resources out there that will help you, and you deserve it.  \nif there are any religious goons trying to proselytize, condemn, or harm this innocent girl and are reading this: i'll see you in hell.",
      "created_utc": 1737230879.0,
      "score": 3
    },
    {
      "id": "m7s0p2e",
      "body": "I’m so sorry. I feel your pain. I have not been in your same position. But I do know, all too well, the feeling of feeling hopeless and like life has no meaning and death is the only answer. I won’t tell you what to do and I definitely won’t talk about “God”, since that’s not my thing either. I’m just here to offer support like the others in this group. If anything, PLEASE, do one favor for me… PLEASE do not take your own life. I will feel absolutely gutted if you were to do that. Apologies if that sounds selfish. But it is the truth. And there are others on this thread who have showed amazing and wonderful support, while providing excellent feedback. Please try to consider some of those options they presented. And if you get the chance to post an update, please do so. \nTo all those offering advice to the OP… Thank you for being so supportive of her. You’re all amazing people. I wish I had this support system when I was experiencing suicidal ideation in my teens.",
      "created_utc": 1737192647.0,
      "score": 3
    },
    {
      "id": "m7wcfmv",
      "body": "Look up your states \"safe haven laws\" (dropping baby off at the fire station)\n\nI've also heard of people anonymously donating to an abortion fund for people in similar situations (think it was planned Parenthood but there could be others too)",
      "created_utc": 1737247925.0,
      "score": 3
    },
    {
      "id": "m7qjcwk",
      "body": "it sounds like you want your baby if you aren't able to take care of it maybe you could look into adoption",
      "created_utc": 1737166159.0,
      "score": 16
    },
    {
      "id": "m7qznqq",
      "body": "Sorry, I feel you, stay strong. I tried today and failed as well. It’s kind of cathartic when you keep failing, almost makes me believe there is a reason. I’m friends with death, or this is just a cruel joke.\nI just can’t get out of this hole. \nOne day I won’t fail, soon.\n\nStay alive for yourself and your baby.",
      "created_utc": 1737172484.0,
      "score": 6
    },
    {
      "id": "m7ucb37",
      "body": "[removed]",
      "created_utc": 1737225262.0,
      "score": 3
    },
    {
      "id": "m7qhg99",
      "body": "Dont do it there are always solutions.\nWhat u feel is temporary. It will get better I promise",
      "created_utc": 1737165455.0,
      "score": 7
    },
    {
      "id": "m7uv1gz",
      "body": "I tried with pills, but I'm still here. \n\nI existed for 15 years after, but found reasons recently to love for me.",
      "created_utc": 1737231025.0,
      "score": 2
    },
    {
      "id": "m7wt0nz",
      "body": "Hey. No one should blame you for deciding to save yourself. You are in a health situation where it could be really risky to take care of a baby, and that's NOT your fault. Take care of yourself. Don't listen to fanatics.",
      "created_utc": 1737253491.0,
      "score": 1
    },
    {
      "id": "m7su4gx",
      "body": "[removed]",
      "created_utc": 1737208065.0,
      "score": 1
    },
    {
      "id": "m7u3voo",
      "body": "I am so sorry you are going through this and I know nothing I or anyone else says will change your feelings.  I am a mom of someone your age, can you talk to your mom?  No one loves you like your mom, even during a strained relationship or time.  You know that now because you recognize the baby you are now responsible for, I felt in your words the love.  YOU can get through this and seen….i am here if you want to talk.",
      "created_utc": 1737222742.0,
      "score": 0
    },
    {
      "id": "m7qj65t",
      "body": "I'm really sorry to hear that. 16 is in most places, a legal age to get a job. Is it possible that you could apply for work, literally anywhere, to support yourself and potentially your baby? It sounds like you want to keep your child, but don't know where to turn to. It might seem like you don't have any options, but you do, and there is power in having options. There is power within you for wanting change. The battle will be uphill, but it's possible.",
      "created_utc": 1737166090.0,
      "score": -23
    },
    {
      "id": "m7r7euj",
      "body": "[deleted]",
      "created_utc": 1737175849.0,
      "score": -22
    },
    {
      "id": "m7qu3ct",
      "body": "[removed]",
      "created_utc": 1737170240.0,
      "score": -31
    },
    {
      "id": "m7qtfdf",
      "body": "[deleted]",
      "created_utc": 1737169980.0,
      "score": -11
    },
    {
      "id": "m7qs0ks",
      "body": "[removed]",
      "created_utc": 1737169428.0,
      "score": -56
    },
    {
      "id": "m7v9gjm",
      "body": "Why are you aborting your baby if you love it?",
      "created_utc": 1737235631.0,
      "score": -7
    },
    {
      "id": "m7qsn7b",
      "body": "[deleted]",
      "created_utc": 1737169675.0,
      "score": -31
    },
    {
      "id": "m7uc7jr",
      "body": "[removed]",
      "created_utc": 1737225233.0,
      "score": -13
    },
    {
      "id": "m7shs7o",
      "body": "[deleted]",
      "created_utc": 1737202697.0,
      "score": -19
    },
    {
      "id": "m7wf1x4",
      "body": "Pro tip: RAINN sucks if you’re a male victim. They’ll tell you that what happened isn’t valid, hell in my case they called CPS on my family because they saw me as a possible pedo since apparently a man getting raped is a pedo afterwords.",
      "created_utc": 1737248815.0,
      "score": 6
    },
    {
      "id": "m7s071l",
      "body": "Because they prey on the vulnerable. Easy pickings.",
      "created_utc": 1737192319.0,
      "score": 98
    },
    {
      "id": "m7t8b2d",
      "body": "If I had to guess, it would be because they have never actually experienced a suicidal moment in their life.",
      "created_utc": 1737213145.0,
      "score": 23
    },
    {
      "id": "m7s571b",
      "body": "Also, respectfully if that's your God's views then it's probably not something we want part of anyway. Move along type shit.",
      "created_utc": 1737195545.0,
      "score": 36
    },
    {
      "id": "m7w1pm7",
      "body": "My Grandmother ( an old mennonite woman) told me after I spent some time in the hospital for mental health reasons that she didn't believe God would fault or be mad ( or send me to hell) if i did commit suicide. She said he knew my head was so messed up that I couldn't reason anything. Therefore, it could not be held against me. She said she came to this conclusion after having suicidal thoughts at age 13 and realized you just can't control things sometimes. It blew my mind when she told me this. I thought for sure she would lay into me about getting my head right.",
      "created_utc": 1737244448.0,
      "score": 6
    },
    {
      "id": "m7wj4t1",
      "body": "God has the worst fan base 😼",
      "created_utc": 1737250185.0,
      "score": 6
    },
    {
      "id": "m7ucm0x",
      "body": "[removed]",
      "created_utc": 1737225356.0,
      "score": -15
    },
    {
      "id": "m7uv53o",
      "body": "yes, this! social workers are the most kind, empathetic people i know. they will help you, op.",
      "created_utc": 1737231057.0,
      "score": 7
    },
    {
      "id": "m7wn228",
      "body": "Seriously. I wish people would just keep their religion to themselves. No one gives a fuck. I'm an atheist, and I don't go around telling people about it. I keep it to myself. I don't understand why religious people don't understand that.",
      "created_utc": 1737251499.0,
      "score": 7
    },
    {
      "id": "m7vhaey",
      "body": "[removed]",
      "created_utc": 1737237994.0,
      "score": -6
    },
    {
      "id": "m7u44bl",
      "body": "[removed]",
      "created_utc": 1737222813.0,
      "score": -15
    },
    {
      "id": "m7wnu6g",
      "body": "Yeah. I thought the whole thing with God was that he forgave you and doesn't judge. But some religious people act as if you make one \"mistake\" or \"sin,\" you'll burn for eternity. Makes no sense.",
      "created_utc": 1737251765.0,
      "score": 3
    },
    {
      "id": "m7r12ey",
      "body": "[removed]",
      "created_utc": 1737173067.0,
      "score": -75
    },
    {
      "id": "m7s0v64",
      "body": "\"It will get better I promise\". You don't know that so you can't promise that. People who say that to suicidal people are ignorant and condescending.",
      "created_utc": 1737192760.0,
      "score": 18
    },
    {
      "id": "m7vj0o7",
      "body": "Have you ever been suicidal? You are not in a head space to be able to reason. She's 16 hormones like crazy. She just got SA and pregnant from it. So add PTSD and pregnancy hormones, and you want her to calm down and relax and ask herself what's next? When you are that close to suicide you can not see the next day ahead, never mind 10 years. She can't see out of this moment so advice like this is absolutely useless and not helpful at all.",
      "created_utc": 1737238532.0,
      "score": 3
    },
    {
      "id": "m7uxhu1",
      "body": "shes thinking about suicide i dont think theres time or reason for thinking about what her future self would think because there will be no future as of now.",
      "created_utc": 1737231818.0,
      "score": 2
    },
    {
      "id": "m7refpp",
      "body": "[removed]",
      "created_utc": 1737179238.0,
      "score": 14
    },
    {
      "id": "m7us1ld",
      "body": "Are you serious?? She's struggling now coping emotionally and you suggest OP add a job?  Plus a baby.  I totally can understand where she's coming from.  Unless you have been or are in the same situation I would ask you to  refrain for saying stuff like that.",
      "created_utc": 1737230065.0,
      "score": 5
    },
    {
      "id": "m7se2iq",
      "body": "…..yeah, valuable to the churches adoption department, by about $200k! This church speak pisses me off! They’ll grab her baby, sell it and toss her to the streets. If OP was open to adoption, I’d hope she’d get help, going forward, navigating her young life….housing, food, medical insurance, schooling, and lots of love…like parental love. She’s old enough to smell BS, hence the anti religious sentiment, which I happen to agree with. She needs love and guidance to get her through this emotional time of her life , regardless of her decision and God’s not speaking about it, nor offering her the love and support she needs. Hmmm…I wonder why. 🌊",
      "created_utc": 1737200770.0,
      "score": 4
    },
    {
      "id": "m7sai33",
      "body": "[removed]",
      "created_utc": 1737198761.0,
      "score": 13
    },
    {
      "id": "m7v9bdj",
      "body": "[removed]",
      "created_utc": 1737235586.0,
      "score": 1
    },
    {
      "id": "m7qtvx5",
      "body": "[deleted]",
      "created_utc": 1737170159.0,
      "score": 2
    },
    {
      "id": "m7r5frx",
      "body": "[removed]",
      "created_utc": 1737174958.0,
      "score": 24
    },
    {
      "id": "m7sb4od",
      "body": "Maybe you and your boyfriend should offer to adopt?",
      "created_utc": 1737199124.0,
      "score": 9
    },
    {
      "id": "m7vhhla",
      "body": "It's probably a back and forth thing of love and hate. If you read OP was SA, so thinking of the baby may be a reminder of what happened. She could carry and adopt it out, but her mental state is so very fragile right now. Remember being 16 and all your hormones going crazy? Now add an extremely, extremely traumatic event that resulted in a pregnancy and now all the pregnancy hormones. None of which was her fault. So she also could have some ptsd from that. She needs a safe space and all the love and support anyone can give her.",
      "created_utc": 1737238057.0,
      "score": 6
    },
    {
      "id": "m7v9wl1",
      "body": "none of your business, move along",
      "created_utc": 1737235769.0,
      "score": 2
    },
    {
      "id": "m7tefah",
      "body": "[removed]",
      "created_utc": 1737215111.0,
      "score": 9
    },
    {
      "id": "m7vb1fa",
      "body": "you're ignorant and i hope whoever moderates this subreddit bans you for suggesting all of this just so a rape victim saves a fetus. op is a child. an underaged child. if she wants to abort, she can and there's nothing monsters like you can do to stop it.  \nif you want to say any more you need to go through me first, and i promise i'm not nice to monsters like you.",
      "created_utc": 1737236121.0,
      "score": 3
    },
    {
      "id": "m7wippa",
      "body": "I’m so sorry that happened to you, and you’re not the first man to say something like this. So horrible that’s how they treat male victims :(",
      "created_utc": 1737250045.0,
      "score": 7
    },
    {
      "id": "m7wmk9q",
      "body": "Op isn't a man",
      "created_utc": 1737251334.0,
      "score": 2
    },
    {
      "id": "m7tsv5v",
      "body": "It's crazy when you really think about it anytime anyone is remotely struggling with purpose ,grief or something similar the first thing some try to do is \"recruit\" you",
      "created_utc": 1737219463.0,
      "score": 27
    },
    {
      "id": "m7t91nb",
      "body": "It's not necessary their God's views, but it's what they believe their God's views are. So, really, they are just pushing their views on people. I grew up with a lot of people like this.",
      "created_utc": 1737213388.0,
      "score": 7
    },
    {
      "id": "m7ud842",
      "body": "I have had christians tell me that im a sinner and a horrible person that will go to hell for being suicidal. And several others have had the same experience, so i think that these people have a valid reason to be ''anti religious bigots''\n\nI have nothing against religion, in fact i love discussing religion with people! But im not fond of some religious people forcing down harmful BS to people in need like i have experienced.",
      "created_utc": 1737225543.0,
      "score": 14
    },
    {
      "id": "m7uvjsy",
      "body": "i'm religious, but not any abrahamic religion. it's not anti-religious bigotry when it's valid criticism of what religious people do. move along and cry elsewhere. this isn't about you",
      "created_utc": 1737231186.0,
      "score": 7
    },
    {
      "id": "m7v6c7j",
      "body": "Bigotry 🤣🤣🤣 that’s adorable",
      "created_utc": 1737234640.0,
      "score": 6
    },
    {
      "id": "m7vjb2w",
      "body": "As the product of rape and an adoptee, I can't say I recommend it, but if the thought of having an abortion just bothers her too much and that's what she wants to do, I support that decision. However, I'd warn that pregnancy is really hard on the body. There are ALWAYS permanent physical consequences, as well as the threat of death. Having to go thru it against your will and not because you chose to make that sacrifice? Well, that's torture.",
      "created_utc": 1737238624.0,
      "score": 8
    },
    {
      "id": "m7u57w2",
      "body": "[removed]",
      "created_utc": 1737223136.0,
      "score": 12
    },
    {
      "id": "m7r5k9a",
      "body": "[deleted]",
      "created_utc": 1737175015.0,
      "score": 3
    },
    {
      "id": "m7r661q",
      "body": "Idk who is arguing that life doesnt begin at conception: sperm and eggs are alive the whole time. The thing is that the baby dont got a brain or a heart until many weeks in",
      "created_utc": 1737175288.0,
      "score": -29
    },
    {
      "id": "m7t3xx1",
      "body": "I see it this way: people who say that, promise it because as long as it steers the person away from their dark place, it's true enough. And obviously empathy isn't ever going to be enough to put your healthy self into the shoes of a person with a mental disorder. Duh.",
      "created_utc": 1737211659.0,
      "score": 4
    },
    {
      "id": "m7wo42v",
      "body": "It's also against this sub's rules",
      "created_utc": 1737251860.0,
      "score": 3
    },
    {
      "id": "m7vjz4y",
      "body": "[removed]",
      "created_utc": 1737238830.0,
      "score": -2
    },
    {
      "id": "m7rtnhd",
      "body": "She said she loves the baby, and it seems like she's only aborting it because of money.",
      "created_utc": 1737188104.0,
      "score": -14
    },
    {
      "id": "m7uta1l",
      "body": "[removed]",
      "created_utc": 1737230454.0,
      "score": 2
    },
    {
      "id": "m7r4vrz",
      "body": "[removed]",
      "created_utc": 1737174712.0,
      "score": 6
    },
    {
      "id": "m7r64i2",
      "body": "[deleted]",
      "created_utc": 1737175269.0,
      "score": 1
    },
    {
      "id": "m7usxwf",
      "body": "Didn't op say she was raped? Yeah I really feel like I could go through nine months feeling there was a half devil fetus in me.  NOT!!!",
      "created_utc": 1737230347.0,
      "score": 5
    },
    {
      "id": "m7wpitg",
      "body": "Yeah. 1in6 is ok but they’re the ones who sent me to RAINN in the first place.",
      "created_utc": 1737252333.0,
      "score": 3
    },
    {
      "id": "m7wpfs0",
      "body": "I’m a man, just looking to give men who might see that and think it’s good a heads up.",
      "created_utc": 1737252305.0,
      "score": 4
    },
    {
      "id": "m7r6vkm",
      "body": "[removed]",
      "created_utc": 1737175609.0,
      "score": -34
    },
    {
      "id": "m7r731p",
      "body": "[removed]",
      "created_utc": 1737175703.0,
      "score": -4
    },
    {
      "id": "m7vkmb9",
      "body": "Unfortunately it's first-hand knowledge. If it weren't for my Mom holding me and talking me through a lot of nights, I wouldn't be here. If I can help one person the way she helped me, I'll do everything I can.",
      "created_utc": 1737239031.0,
      "score": 2
    },
    {
      "id": "m7v0rdo",
      "body": "[removed]",
      "created_utc": 1737232863.0,
      "score": 0
    },
    {
      "id": "m7r6dkt",
      "body": "[removed]",
      "created_utc": 1737175384.0,
      "score": 10
    },
    {
      "id": "m7v0w6i",
      "body": "I wasn't saying OP should do that, I'm telling the pro life people to put up or shut up. It's obvious OP shouldn't carry to term, I'm pro abortion and supportive of having this fetus aborted.",
      "created_utc": 1737232905.0,
      "score": 3
    },
    {
      "id": "m7wqocy",
      "body": "Ok. I just thought you were dumb and didn't read OP's post or something. It sounded like you were sating OP was a man",
      "created_utc": 1737252724.0,
      "score": -3
    },
    {
      "id": "m7r74ar",
      "body": "[deleted]",
      "created_utc": 1737175719.0,
      "score": 0
    },
    {
      "id": "m7r8g3l",
      "body": "It isnt until 2nd trimester that the brain becomes functional \n\nWe could ponder the ethics of it, but my personal opinion is that you should be able to abort at any point prior to birth without any given reason. I personally do not care if it's considered murder.",
      "created_utc": 1737176320.0,
      "score": 15
    },
    {
      "id": "m7r7qlj",
      "body": "Do you know what a pregnancy test is?",
      "created_utc": 1737175996.0,
      "score": -18
    },
    {
      "id": "m7vlj3f",
      "body": "[removed]",
      "created_utc": 1737239318.0,
      "score": 1
    },
    {
      "id": "m7v3pm3",
      "body": "[removed]",
      "created_utc": 1737233800.0,
      "score": 2
    },
    {
      "id": "m7v1pdh",
      "body": "Sorry i was a bit intense. Going through alot here rn.",
      "created_utc": 1737233164.0,
      "score": 1
    },
    {
      "id": "m7r7kv1",
      "body": "Because she was raped and has suicidal ideation because of it?!",
      "created_utc": 1737175924.0,
      "score": 20
    },
    {
      "id": "m7r79f1",
      "body": "[removed]",
      "created_utc": 1737175780.0,
      "score": -25
    },
    {
      "id": "m7vrzv8",
      "body": "Yes, I was very blessed. She knew just how to handle it, unfortunately from first-hand experience herself but she was thankful because it gave her the ability to save me",
      "created_utc": 1737241404.0,
      "score": 1
    },
    {
      "id": "m7v55gc",
      "body": "[removed]",
      "created_utc": 1737234260.0,
      "score": 1
    },
    {
      "id": "m7v1xbj",
      "body": "Don't worry about it, hope you make it through what's going on! ",
      "created_utc": 1737233233.0,
      "score": 2
    },
    {
      "id": "m7ttzah",
      "body": "[removed]",
      "created_utc": 1737219794.0,
      "score": -4
    },
    {
      "id": "m7u87i5",
      "body": "[removed]",
      "created_utc": 1737224029.0,
      "score": 4
    },
    {
      "id": "m7v4hyu",
      "body": "Thanks so much!!",
      "created_utc": 1737234051.0,
      "score": 1
    },
    {
      "id": "m7ux7q2",
      "body": "Putting the baby in adoption literally changes nothing, it still makes the child pay for the dudes actions by being thrown around foster care and the system plus it ruins this poor womans body even further. As the pregnancy goes on shes going to get more hormonal and shes probably going to be dead before she even gives birth if she doesnt abort it but youre telling her to just keep it? Not even including post partum depression, which might make her actually kill the newborn.",
      "created_utc": 1737231727.0,
      "score": 6
    },
    {
      "id": "m7u8bqr",
      "body": "[removed]",
      "created_utc": 1737224065.0,
      "score": 2
    },
    {
      "id": "m7u9nh6",
      "body": "[removed]",
      "created_utc": 1737224463.0,
      "score": 5
    }
  ]
}