{
  "id": "1ecm68a",
  "title": "I am commiting suicide in 10 days, I feel like I'm the worst person in the world.",
  "selftext": "I have been keeping a big secret for 4 years now. My family thinks I have been going to university for the past 4 years but little did they know, including my friends and relatives, that i dropped out in the middle of the first semester of my freshman year. I managed to keep it a secret from all of them by forging false documents and giving them assurance every time they ask me a question about how my academics was going. It also helps that the University is 2 hours away from my home so I actually rent near it. I go home every weekend thinking \"do they know already?\". I know a lot about my field as I practice it every now and then by working with a licensed engineer. I don't make a lot of money from it though but the things I learned that is connected to the degree program is what kept me from blanking when asked by my family about my academic life.\n\nI have run out of time. The graduation from the University is 10 days away and everyone thinks I am graduating. And I am somewhat happy, that I can finally end my life. I have been such a big disappointment for my parents. I am their only child. I cry everytime I imagine what my mom would feel after I do it. My girlfriend, who by the way also doesn't know anything broke up with me yesterday, which makes the goodbye part of it all very hard. I have planned everything out already, from what i'll use to when and where. I just wanted to vent some of the heaviness from my chest. I feel so sad about my parents and my (ex) girlfriend. I am gonna start writing my suicide letters tomorrow. Thank you guys.",
  "created_utc": 1721994777.0,
  "score": 534,
  "num_comments": 185,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ecm68a/i_am_commiting_suicide_in_10_days_i_feel_like_im/",
  "comments": [
    {
      "id": "lf1lpqf",
      "body": "As a parent, if my child told me what you said here, I would of course be concerned that they felt the need to keep it a secret for four years, but I'd also be impressed with what they've done in their field, and I'd do what I can to help them moving forward. \n\nThere are SO many awful, harmful things that a human can do...and lying about attending college is VERY VEEEEEEERY far down on that list. You didn't directly cause harm to anyone. You haven't ruined anyone's lives. \n\nI'm sorry to hear about the breakup. I know that's the shit cherry on the shit sundae. But you seem like a very driven, capable, thoughtful person, and the right person will be SO lucky to have you as a partner.",
      "created_utc": 1722006573.0,
      "score": 224
    },
    {
      "id": "lf1lknc",
      "body": "Dont get stuck on others' expectations. And don't get stuck on your own. They expect college, you expect death. Neither has to be true. And if the people in your life cause you such distress through disappointment... then kill this person you are now without being dead. You can still use the meat robot and the energy your body creates to change the world. I, as well, know what it's like to be done with life. My life ended many years ago. But now I have a daughter. So now this life is hers. One day it will end and I will be happy for it but until then I can use every iota of this self to change the things for others that hurt me so that they never hurt others again. I will fail at my task but at least some benefit can be had from this meager existence.",
      "created_utc": 1722006528.0,
      "score": 49
    },
    {
      "id": "lf0wx2v",
      "body": "You can always go back and finish those 2 years and i guess make something else up... or tell the truth.  2 years over a lifetime suicide not worth it.",
      "created_utc": 1721997674.0,
      "score": 121
    },
    {
      "id": "lf15mdm",
      "body": "I think they would prefer if you came clean about your lie than for you to commit suicide. You don’t even know how they feel about the whole thing. It won’t be easy and they will be shocked but this is something you can move past. Apologize and make up for it, don’t give up man!",
      "created_utc": 1722001071.0,
      "score": 86
    },
    {
      "id": "lf22lqd",
      "body": "You are not a bad person, you got overwhelmed and started doing things wrong. This can happen, you don't need to carry this with you everywhere you go. You can think of some better ways and try to do them. \n\nI feel there is still hope for you and you should try to pick yourself up",
      "created_utc": 1722012038.0,
      "score": 26
    },
    {
      "id": "lf1hxfe",
      "body": "Why not come clean?  College isn’t for everyone and it sounds like you have a great role that you enjoy, you’re just neck deep in a lie.  What you do with your life is your business, but like what happens if they just love you regardless of a degree?  What if they forgive you or don’t care that you lied?  It’s not even the worst lie.  Like you haven’t hurt anyone or done wrong, you just couldn’t tell them you picked a different path.  We are all guilty of that.  \n\nAnd if they hate you for it?  Who the hell cares.  I mean I get it, it suck’s when family sucks, but you have a job you admittedly like and you sound like a caring person, the world is your oyster in many ways.  Ultimately your happiness matters the most and if they truly love you, and they sound like they do if you know how sad your mom will be without you, they want you around and love you.",
      "created_utc": 1722005330.0,
      "score": 19
    },
    {
      "id": "lf0un1i",
      "body": "bro who cares if you have a diploma or not.",
      "created_utc": 1721996696.0,
      "score": 96
    },
    {
      "id": "lf2zsj5",
      "body": "Diplomas are overrated man. I've worked alongside people with Diplomas for years and the only difference is that I'm not in a metric fuck ton of debt.",
      "created_utc": 1722022774.0,
      "score": 19
    },
    {
      "id": "lf0t2s6",
      "body": "Honestly, I'm very impressed about how you kept up the lie for the whole career. If you wanted to live, you could make good business out of this ability. I mean it genuinely.",
      "created_utc": 1721996004.0,
      "score": 64
    },
    {
      "id": "lf1wb5c",
      "body": "I agree with these other comments there are a lot of worse things a person can do to their family besides lying to them bc you wanted their approval. It must have been hard carrying that weight on your shoulders for so long. In my experience if you try to live your life just seeking the approval of others you’ll never be happy and i dont think they would hate you for telling the truth. I dont think you sound like someone who is done with life, i think you have many things to live for and i understand it can be hard facing the truth after all this time. Don’t worry about disappointing others, the ones who truly care will be there for you and with time will forgive you. The thing about lying is that it breaks trust, but trust can built again. So please don’t give up. I’m sure your family will come to understand and you will find something that truly makes you happy.",
      "created_utc": 1722009992.0,
      "score": 10
    },
    {
      "id": "lf24ang",
      "body": "No my lovely. Don't do this. Tell your family. It will be such a weight lifted.",
      "created_utc": 1722012579.0,
      "score": 10
    },
    {
      "id": "lf25q7t",
      "body": "How did your parents think you were paying for university if they weren’t providing you the money?",
      "created_utc": 1722013034.0,
      "score": 8
    },
    {
      "id": "lf2cru6",
      "body": "i think they would rather know you lied than have their only child dead. especially if your mom is too old enough to have another kid. i know admitting it will be hard. the buildup to it will feel terrifying, but once you get it out it will feel like a weight off of your chest. assuming you have decent parents, they wouldn't be mad, they would be concerned about why you lied.",
      "created_utc": 1722015292.0,
      "score": 9
    },
    {
      "id": "lf31ehu",
      "body": "Bro I think you should talk to your parents about this they will understand taking your life is not easy mate",
      "created_utc": 1722023308.0,
      "score": 7
    },
    {
      "id": "lf3ep8m",
      "body": "Hey man i know it’s hard but telling your parents is the best. I’m sorry about your girlfriend that must be hard but you’ll be fine might be a slow recovery but it’ll be okay. Ending your life isn’t the right thing to do especially over college or what else is going on. Everything can be better but you need to take action in it. Please just communicate with your parents that’s the best thing to do believe it or not.",
      "created_utc": 1722027710.0,
      "score": 6
    },
    {
      "id": "lf18z4o",
      "body": "[removed]",
      "created_utc": 1722002269.0,
      "score": 6
    },
    {
      "id": "lf2302l",
      "body": "I'm certain your family would rather you tell the truth and unburden yourself of the insane guilt you feel instead of losing you as a whole, maybe the consequences will be hard to handle, I'm certain it won't be easy on you. But if your biggest concern is your family's opinion on you, they'd much rather know how you feel and why you felt the need to hide it for so long. You haven't ruined anyones life and you haven't ruined yours yet if you decide to back out, believe me when i say killing yourself can only be an option i can understand if you've lost all support and have no body who'd be willing to hear you and your reasons out. You may never know what your family, who clearly loves you and care about you and your academics, will feel until you confess. I recommend coming clean to only your immediate family and then expressing how much it'd burdened you over the years, and if possible, sign up for a couple therapy or counselling appointments regardless if they take it well or not. Chances are, they'll come to terms with it and love you the same still. College isn't for everyone and you clearly have something you enjoy doing that you can certainly make a far better life with once you manage to unburden yourself with this lie",
      "created_utc": 1722012165.0,
      "score": 5
    },
    {
      "id": "lf27izd",
      "body": "You objectively aren't the worst person in the world.\nI have failed a lot in life, but I am still treading water and so can you. \n\nI have been in situations where I thought I was going to lose everything, I have been humiliated, lost more than I thought possible. I do not regret holding on.\n\nTry to externalize yourself from the situation.\nTell the truth, and divorce yourself from the consequences.\n\nLife is like the tide, it goes up and down, and sometimes you get caught in the churn.\n\nPlease cut yourself some slack",
      "created_utc": 1722013609.0,
      "score": 6
    },
    {
      "id": "lf2eq4f",
      "body": "Or you can come clean and just move on with your life. You’ll look back at this when you’re older and see it was the best option. Your parents would much rather you just be honest and open about the last 4 years, than not have you around anymore, I can promise you that. Nothing like that is worth taking your life over, it’s a degree, who cares. College and a lie isn’t worth your entire life. I think you should make a call, and get some help, talking to a professional will be a good option right now. Might be a difficult call but things like that aren’t easy, there will be a time later on that you will look back at this thank yourself for getting the help. Feel free to reach out to me as well if you need to talk. You’ve got this.",
      "created_utc": 1722015928.0,
      "score": 4
    },
    {
      "id": "lf2g48f",
      "body": "But why do you want to? Lying about college doesn't make you a disappointment. You know what saved me? Joining the Air Force. They give you credentials plus you get school money. \n\nI have been in 11 years and is it scary at first? Of course. But Tech school was a blast. I made new friends. Learned so much and got paid. Do I still struggle? Of course. Ending your life will make things worse and you will miss out on what could have been.",
      "created_utc": 1722016374.0,
      "score": 6
    },
    {
      "id": "lf31i97",
      "body": "Uni is not for everyone my friend. This doesn't define your life, don't let this cruel world break you.",
      "created_utc": 1722023341.0,
      "score": 5
    },
    {
      "id": "lf42cum",
      "body": "[deleted]",
      "created_utc": 1722036445.0,
      "score": 5
    },
    {
      "id": "lf44gtz",
      "body": "Hey friend, hang on please. Your lie was fabricated in order to help your family feel better, not to hurt them. That inherently makes you a good person. Sure, you kept the lie up, but that just tells me how much you care. I’m sure that once you tell the truth, you’ll feel alot better and your family shouls understand.\n\nTake a deep breath. Give yourself a chance to laugh about past mistakes in the future, rather than ending it all and removing any chance. Trust me, one day this will be far behind you.\n\nYou can respond to this post, you may. I’ll respond as soon as I can.\n\nHang in there!",
      "created_utc": 1722037272.0,
      "score": 5
    },
    {
      "id": "lf4dgxg",
      "body": "Trust me.  They would rather you be alive and happy. Than anything else.     College isn’t the best all and end of it all.      Your life could go so many amazing ways.     Talk to them. Sit down with them.  Tell them how you feel.  It won’t be easy. But they do want you in their lives.   Trust me on this",
      "created_utc": 1722040901.0,
      "score": 3
    },
    {
      "id": "lf59ven",
      "body": "There is a Dutch documentary or episode on a show of a girl in the same situation that did kill herself. Everyone thinks it’s such a shame she didn’t just come clean and tell the truth.",
      "created_utc": 1722055700.0,
      "score": 3
    },
    {
      "id": "lf5m4xb",
      "body": "I've been there. I've done it. I somehow managed to get out of it. Didn't help that I fucked up BIG time again. in comparison, lying to parent about uni is NOTHING. \n\nThere is a way out. Trust that you will walk it. \n\nWhat you are feeling is not you, it's emotions/chemicals. Look deep inside to find out who u really are. Ride it out mate. I'm struggling right now too, let's make it.",
      "created_utc": 1722063158.0,
      "score": 5
    },
    {
      "id": "lf75mee",
      "body": "Please don't end it. I have a family member who did the same, when we found out it was s bit upsetting, but it was his life and his choice of direction. We were more upset we'd made him feel he couldn't tell us through fear of \"letting us down\" but absolutely nothing on how we would have felt had he ended his life over it. \n\nYears on and it's nothing more than a faint memory, or a light joke if ever it comes up. He's doing great for himself now. It really doesn't matter and although I understand for you right now it sucks as \"the big secret\" has to come out. I can promise you. It's not at all worth dying over. Please face the music, it will suck but pass much faster than you think. Your not a let down. Your just a person who felt they couldn't tell them and then it got so much harder with time passing. You got a job in a direction I hope YOU want for yourself. That's what matters here. \n\nSorry this is so long, it's just I had a flash of a possible outcome in our fsnily in your story and we are so grateful he's still with us. I want that for your family too x",
      "created_utc": 1722093131.0,
      "score": 4
    },
    {
      "id": "lf0zfjq",
      "body": "Come clean.",
      "created_utc": 1721998690.0,
      "score": 6
    },
    {
      "id": "lf3pvov",
      "body": "Please hold on. You're not as bad as you think you are, and I think there's more for you in this world.",
      "created_utc": 1722031658.0,
      "score": 3
    },
    {
      "id": "lfl01a5",
      "body": "I'm NOT gonna write my usual empathetic sentiments, although I would write a paragraph. BUT I'll just tell you this - imagine YOUR OWN SON confessing to you of this same lie. IF you're a loving parent, you will forgive and even help your son. IF you're not a loving parent, well, you will lash out at your child, will be saying \"oh, I'm ashamed of you, what will relatives say?\". If your parents love you, they will make sure not to \"torture\" or \"blame\" or \"punish\" you. Especially the fact that you lied not to disappoint them and protect THEIR feelings. In this best case scenario, you get to restart together with your loving parents and come clean and lead more honest life.   But if they will hate you, then, well, they are not loving parents to begin with. Which lead to best case scenario- you get to put down the weight of being a puppet of expectant family AND those damn relatives above middle-class\".  Honestly, I KNOW YOU, I FEEL YOU. I was on your shoes, my mom's side of family is double above of middle-class, idk maybe theyre like upper class(but act like upper middle class bc of religion). I'm first of many cousins and blood related siblings. Straight A's, humanitarian to mathematic to robotics achievements to show off my brain, then I got to TOO UNIVERSITY in my country, foundation year. FAILED.  KEPT SECRET until autumn started and THEY FOUND OUT.  They told me that \" you SHOULD HAVE TOLD US SOONER\". They told me to lie to my relatives that I'm still at uni, while I'll find another university to attend within year. I felt real depression that \"gap year\": 4 walls nowhere to go, all my friends are studying while I'm family disgrace at home. What SAVED me was my hatred towards this family for big expectations. They even made me lie.  This way lead to more inner discovery, i find out i never actually knew what i wanted from life . In YOUR CASE, if you have not loving parents , you WISH YOU KNEW SOONER. It was never your fault, you are living the way that you want, you got enjineering job already that gives you independence from toxic Household(if we assume that your parents will not accept your lie and blame you). I thought I loved my parents. Well I know I do still, but now I am not allowing them to put a generation worth of expectations to me, only the ones I am able to and WANT to carry  Remember, you are in so much better situation now, having some earnings. Get real work either by connections(I assume your family will consider giving you some job position through rich boss-relatives or either connections) or though that enjineering pal.  And if those ppl refuse to help you, and abandon you, then CONGRATS YOU HAVE NOTHING TO LOSE. By any means find any job, live and earn for yourself and find solitude and your own small happiness...which will be almost impossible, I understand. I understand that you DO LOVE Your parents and family. But if you have to SA YOURSELF for that love, that's not love, that's MENTAL ISSUE. Love you man, you are so young. This life is your only one, don't mess it up.\nYou ready to D/E because of failing EXPECTATIONS is a sign of big mental health, which is GOOD because ITS TREATABLE, BRO JUST DON'T DIE ON US. what if someone with EXACT situation will look through reddit to fund solution? You can REDEEM YOURSELF, ITS YOUR BREAKING POINT IN LIFE, TURN IT, TURN IT. What if one of your sibling are going through exact same thing? You say you love your family, then BE STRONG, PLEASE. I promise in 5 years you'll look at this story and smile thinking \"Gosh, why did I sweat so much over some small thing\". And I promise if your parents are sane people then you can keep your relationships and even get closer because of HONESTY, because of your bravery to be HONEST WITH THEM. bro I PROMISE you're overthinking outcomes in your head. You are AFRAID, you need hug and real support, and I promise EVERYONE IN COMMENTS WOULD give you that. But to get real hugs and support, you have to confess and open up IN REAL LIFE, and confess to your parents to remove this weight of guilt please. It's easier to write things in reddit than to go up to random person for support in real life. But maybe just go, if no friends, and yet afraid of parent, for example, to that pal who gives you enjineering job? Just speak out your heart? Please bro",
      "created_utc": 1722303091.0,
      "score": 3
    },
    {
      "id": "lf3y95n",
      "body": "My friend im scared of my parents to I've done stuff that got in me trouble I've been arrested and done some stupid shit but listen they will always love you no matter what silly stuff you do or will do but ending your life bc your scared of what your parents would think will break your parents. Telling them about how you haven't been to uni it may disappoint them but they will forgive you, you've gotten a job and started earning your own money they will be proud of you for that. You may not have gone to uni hut you have started a career for yourself, you basically took a short cut and did what you wanted to do anyway. You have so much to love for, you prove to your parents that going to uni wasn't a big deal bc it never was, stay alive stay strong and take a deep breath.",
      "created_utc": 1722034848.0,
      "score": 2
    },
    {
      "id": "lf4j8gf",
      "body": "Please don’t do it, your parents would rather be disappointed than sad for The rest of their life.",
      "created_utc": 1722043318.0,
      "score": 2
    },
    {
      "id": "lf4lg4b",
      "body": "Broo if anything you are fine without diplomas, i have a master’s degree in computer science (may 2024) from an ivy league but still cant a job today and worried about paying off my student loans. It makes me suicidal as well. Yes, am not gonna sugarcoat, it will take a while to rebuild trust, but they would rather that than their son gone. Trust me. I think the bigger picture is, as long as you can support yourself even without higher education, who even cares about overpriced college degrees.",
      "created_utc": 1722044261.0,
      "score": 2
    },
    {
      "id": "lf4mmbo",
      "body": "This does not make you the worst person in the world. Your brain is lying to you. See the bigger picture. You still have your whole life ahead of you and so many options.",
      "created_utc": 1722044755.0,
      "score": 2
    },
    {
      "id": "lf4p2st",
      "body": "Hmm sucks you're feeling like shit but that's pretty crazy you managed to pull that off. Put on a brave face and push through it. And don't feel bad, people have done much crazier things, and they will get over it.",
      "created_utc": 1722045794.0,
      "score": 2
    },
    {
      "id": "lf5pxc7",
      "body": "I remember once listening to an episode of This American Life about secrets. One guy called in with a similar story. On the day of his “graduation,” he said to his parents “It’ll be so boring. Let’s just go out to lunch.” He claimed that they still don’t know. \n\nIn all seriousness, I think it’s shitty that people here are minimizing your very understandable distress. But I promise that you can get past this.",
      "created_utc": 1722065705.0,
      "score": 2
    },
    {
      "id": "lf6286j",
      "body": "Are they so oppressive that you feel you owe them 4 years of university? Or why are you so embarrassed by this little lie? It sounds to me like you have the skills to live in this society: you said you're knowledgeable in your field, and your fear of disappointing people shows that you're able to build relationships that you want to preserve. This is a lot. If all that bothers you is this lie, you can cut off contact with your family and friends and move somewhere else where no one knows you, so you don't have to keep this secret any longer. If lying hurts you so much, put yourself in an environment where you don't ever have to lie, surround yourself with people who don't control you and don't except certain achievements from you. Why the fuck are you the worst person in the world just for not living up to your parents' expectations? If they wanted a \"successful\" child, they should have had ten children so the chance of someone graduating from university was higher.",
      "created_utc": 1722074477.0,
      "score": 2
    },
    {
      "id": "lfa1pew",
      "body": "Listen i have no idea who you are and this is the first time I'm going to comment on reddit. I was going to sleep but i don't know how i ended up here, it might be some weird intervention of some sort because i need to share my story with you.\n\nI HAD THIS EXACT PROBLEM, THIS EXACT SITUATION few years ago. You wont believe it but i also thought about ending it all just like this and i planned it out for a very long time. I made a foolery out of them. They believed me to be the perfect son , they took good care of me and they never knew that i didn't even continue my first year. I was thinking about overdosing on some pills but that day somehow something just changed everything in me and how i see things from another perspective. I started asking myself random questions like \"Would it be worse to be known as a liar and a loser forever or just some tiny insignificant few years because they will eventually find out after I'm gone?\"  So i started getting into the idea of \"well why don't i just waste another three more years and just be done with this misery instead of being a disappointment for life\"  maybe \"i could lie more?\" maybe \"i could just tell them the truth?\" These were better than the alternative of being known as a liar for eternity. I stopped miraculously what i was doing and decided to confront my parents and family about it.   \n  \nI visited them the next day and started telling them head on \"what would be more valuable my life or a graduation paper\"? They started laughing thinking i was joking, they had that look \"how is it even comparable\"? But i decided to press more and told them i needed a serious answer. They told me that \"no matter what happens, no matter the value of these materialistic things in our world it could never be worth a dime of your health let alone your life\".  When i heard that, i was in utter shock. I felt like a heavy weight was lifted off my shoulders, my brain suddenly felt lighter as if i was living an illusion, a programmed reality of some sort. When they confirmed it for me i completely just spilled the whole truth without even thinking. They weren't surprised , they weren't in shock, all i saw was a sigh of relief on their faces, i couldn't express it enough in words, but they were joyful and nervous at the same time that they could have lost me over a stupid paper and were so glad i choose this route instead of the other.   \n  \nI kid you not till this day i laugh about how i took it so seriously to the point i was going to end my life for it.  Please do not think for a second that I'm an unserious person or somehow depressed about another thing and used that as an excuse for suicide. I'm a very intense person that loves to be competitive most of the time. When i thought to myself that i let them down, my pride got shattered and hurt , i felt like trash, i seriously wanted the ground to open up and swallow me already.    \n  \nI completely understand the feeling you're in right now, being \"left out\" , \"left behind\" \"seen as a disappointment\", \"what would my highly educated and well sheltered family think of me\"? and so on. I  been there and the reason I'm laughing about it now is because i graduated last year, living the best moments of my life now knowing i didn't end it all that night. Seeing my mom smile like that everyday, thinking what would've happened if i actually committed that day. She would have never been a happy person ever again and the last thing she would be thinking about is her son's graduation paper.",
      "created_utc": 1722132848.0,
      "score": 2
    },
    {
      "id": "lfb9ec2",
      "body": "killing yourself is not the answer. you know how your parents will feel about the lie, but you dont know how they will feel about your lie. they might be a little bit upset for a couple of months, but after that they will move on. its only a small lie. we all make mistakes. we all learn from them. i dont know a single person that would rather have their son/uncle commit suicide over a small thing they have been hiding for a few years. if your parents found out, they would feel horrible and would want you back so so SO bad. if youre including the part about you not attending the university, they wouldnt care and would do anything to get you back. even if you feel like theyve raised you well and done so much for you, and you feel like youve done nothing, theres still so much time for you to do something for them. killing yourself will make them feel much worse, when lying about the university will make them upset only for a little while, but will respect you for your honesty. if your parents' friemds and other family members found out, they would feel horrible :( it would cause them a lifetime of \"what if's\" and the things they could have done to save you. \n\npeople say that nothing lasts forever, and that applies with the sadness, stress, and grief. many, many suicide survivors/suicidal people push forward and live a good life afterwards, so just keep on pushing and you are almost guaranteed to have a good life. also you are DEFINITELY not the worst person in the world, babes. there are child molestors, rapists, terrorists, genocidal people, fake manipulative people, serial killers, etc. you just made a small mistake that didnt harm anybody or anything. i cannot express how hard you shouldnt commit suicide.   \n  \na sort of weird message, but: you were the best sperm cell. you made it to the egg first out of the millions upon MILLIONS of other sperm cells. so if you were able to do that, then there must be a really good reason that you are here right now. your ancestors went through thousands of years of struggling to survive and find food and carry on a bloodline for you. so please dont do this to yourself and others. it may even cause intergenerational trauma if friemds and family tell future family members. you are here for a good purpose, and are as special as everybody else.   \n  \nits never as bad as it seems. theres so much stuff going on in the world, and this is just a small thing in a big solar galaxy. im sure your parents will understand and respect you. please just keep on going, im sure it will get better 🫂❤️",
      "created_utc": 1722157265.0,
      "score": 2
    },
    {
      "id": "lfeu2e5",
      "body": "Maybe it's not the advice you were looking for, but fake your suicide and run away. You've already forged documents, so i dont doubt you can forge a fake identity. Take the money you got with you, stage a fake death if you wish, and get a second chance in life. I mean, if you had already decided you wanted to do it, \"\"do it\"\" but while still getting a new chance at life, starting anew",
      "created_utc": 1722210026.0,
      "score": 2
    },
    {
      "id": "lgvbb10",
      "body": "To everyone, please help us pray for him. He actually did it. 😔 His body was found just this morning.",
      "created_utc": 1722993689.0,
      "score": 2
    },
    {
      "id": "lgvhmqj",
      "body": "Sadly he ended his life recently. Just came here to confirm he wrote this post. Rip OP",
      "created_utc": 1722996088.0,
      "score": 2
    },
    {
      "id": "lgvlktx",
      "body": "and you really did. I saw the news this morning. 😢",
      "created_utc": 1722997627.0,
      "score": 2
    },
    {
      "id": "lgvrrky",
      "body": "I live in the same town as OP. He's all over the news.. he committed.",
      "created_utc": 1723000138.0,
      "score": 2
    },
    {
      "id": "lgvwick",
      "body": "update: i knew him and he did commit suicide today.",
      "created_utc": 1723002205.0,
      "score": 2
    },
    {
      "id": "lgw5vhn",
      "body": "Kaluoy intawn. Kung mao jud ni iya post, I pray for his soul that even in death, he finds peace. I also want to pray for the people he left behind, especially his parents. Kasakit ba gyud ani. 💔",
      "created_utc": 1723006747.0,
      "score": 2
    },
    {
      "id": "lgwbkgy",
      "body": "wa unta ka nagpadala sa imong problems kuya, luoy kay imong parents ",
      "created_utc": 1723009939.0,
      "score": 2
    },
    {
      "id": "lgwera4",
      "body": "He committed the suicide. Its all over the news. This makes me really disturbed and sad.",
      "created_utc": 1723011853.0,
      "score": 2
    },
    {
      "id": "lgwh92x",
      "body": "What a sad day. He really did commit suicide.",
      "created_utc": 1723013417.0,
      "score": 2
    },
    {
      "id": "lgwiqqe",
      "body": "😭😭😭 It's so upset to the fact that he fully decide to death. He is gone now 😭 Idk how upset the parents are for . I can't imagine. 😭🤧 I can only tell, his lack of praying, confession to our almighty God.. 😭😭😭He should not allow himself to happen only God will. \n#RIP",
      "created_utc": 1723014349.0,
      "score": 2
    },
    {
      "id": "lgwlx5i",
      "body": "guys, he committed suicide and may his soul rest in pleace :(( I knew the news because we are from the same City :((",
      "created_utc": 1723016407.0,
      "score": 2
    },
    {
      "id": "lh2vymq",
      "body": "Oh god, that's horrendous 😔",
      "created_utc": 1723108123.0,
      "score": 2
    },
    {
      "id": "lf2dq6g",
      "body": "I pray God meets you where you are at and gives you the assurance that you need to know you are worth it and that there is a plan so much greater than your eyes can see. You are loved you are talented you are full of life and you have such a bright future ahead of you. Please hold onto the light and push through this dark spot and flourish into the next chapter of your life. God Loves you more than you know, don’t give up on yourself. Stay honest stay true and know you are loved. Please don’t end your story shorter than it should.",
      "created_utc": 1722015603.0,
      "score": 5
    },
    {
      "id": "lf3ahhs",
      "body": "This is so crazy to me when I read stuff like this and see how many people live their whole lives to please others and live a lie because they care so much about other peoples opinions of them. It’s so sad.\n\nHopefully you realize your life is yours to live and stop lying to impress people. \n\nOnce you stop caring what others think you’ll be free. If I lived my life to please others I’d want to off myself also. The only opinion that matters about yourself is your own. \n\n\nThis is such a strange reason to want to end your life. \n\nYou lied- so what. The worst part isn’t the lying, it’s that you can’t accept who you are and the decisions you’ve made for yourself.",
      "created_utc": 1722026318.0,
      "score": 2
    },
    {
      "id": "lf3rh7d",
      "body": "I was stuck in my bachelor's for 3 extra years as well, I was feeling so shit and also had to somewhat hide that my studies were not going well. I managed to graduate somehow, so can you. This is not some sort of crime, you didn't do anything bad, you were just hiding behind a lie. Once you reveal it, no matter how everyone is going to react, from that moment everything will become easier. You are already doing good enough cause you are working in the field. I feel like you need to be extra smart to play everyone for so long. You are just probably overwhelmed by the pressure.",
      "created_utc": 1722032254.0,
      "score": 1
    },
    {
      "id": "lf3u6z2",
      "body": "You should tell them, come clean to them, you may have make a mistake, but you can apologize, explain everything to them and you should be able to make up for it, and make everything better, it is solvable, friend.",
      "created_utc": 1722033288.0,
      "score": 1
    },
    {
      "id": "lf3w1kw",
      "body": "I want to die also But since my big brother died from kidney failure and I saw my family struggle from these all years of financial, mental struggles etc.  I don't wanna hurt them more. But I can't live anymore feel very lonely and  I'm struggling with finding a job so no help from  family also. \nCan anyone suggest something. I'm also getting addicted to unnecessary things.",
      "created_utc": 1722034004.0,
      "score": 1
    },
    {
      "id": "lf3zqav",
      "body": "You dropped out of the University in 1st semester & nobody bat an eye? What about fees?",
      "created_utc": 1722035425.0,
      "score": 1
    },
    {
      "id": "lf42mns",
      "body": "If you need someone to talk to I'm here ha",
      "created_utc": 1722036552.0,
      "score": 1
    },
    {
      "id": "lf4g1ck",
      "body": "idek if there’s anything we can say he isn’t replying to any comments or probably even looking at them..",
      "created_utc": 1722041968.0,
      "score": 1
    },
    {
      "id": "lf55eff",
      "body": "Oi! This too shall pass. Although like a kidney stone but trust me it will.",
      "created_utc": 1722053323.0,
      "score": 1
    },
    {
      "id": "lf5tm9k",
      "body": "A diploma is not worth your life",
      "created_utc": 1722068300.0,
      "score": 1
    },
    {
      "id": "lf613yp",
      "body": "Don’t die over how others feel. You can’t make everyone happy, what matters most is that when you dropped out you were true to yourself, how can being true to yourself be worth killing yourself over?",
      "created_utc": 1722073675.0,
      "score": 1
    },
    {
      "id": "lf6cj68",
      "body": "Dude, if you’re already working in an adjacent field, and earning enough to rent, you’re gonna be fine. Yes you’re going to deal with repercussions, but I GUARNTEE a year from now you’ll feel very differently. Trust me here. Suicide isn’t the answer, and it’s always darkest before the dawn. I’ve survived multiple attempts, and the pain caused to others through suicide/attempts far outweighs the pain that will be caused by you coming clean.\n\nBurn the notes you’ve written, and get the admission over and done. This is going to be a difficult time, but it’s not permanent, you can turn this around brother, we believe in you!",
      "created_utc": 1722080965.0,
      "score": 1
    },
    {
      "id": "lf6l9rp",
      "body": "I have watched friends lose their children. You will be killing them too.",
      "created_utc": 1722085208.0,
      "score": 1
    },
    {
      "id": "lf7dmd4",
      "body": "You’re not the worst person. You’re good (and I mean that in every sense). You can push past these feelings ",
      "created_utc": 1722095937.0,
      "score": 1
    },
    {
      "id": "lf7etkm",
      "body": "If you think your parents want your degree more than you ,you are wrong \nAnd nothing in the world is there that can't be explain,talk to them tell them your heart and how you feel ,yes it won't be easy but it won't be as hard on them ad loosing you \nYour life is way bigger than this",
      "created_utc": 1722096363.0,
      "score": 1
    },
    {
      "id": "lf86l5i",
      "body": "With hardship there is ease it’s coming I promise just hold out a little longer. Your perspective on your life isn’t true at all you’re ill rn you’re overwhelmed. If you’re going to die anyways tell them first tell someone you know I hope they give you a hug. I wish I could. You’re not an awful person you didn’t want to disappoint so badly and you’re so overwhelmed by it all. The world is better with you in it please don’t leave.",
      "created_utc": 1722106296.0,
      "score": 1
    },
    {
      "id": "lf8815v",
      "body": "I would be less disappointed as a friend or family if you lied to me then if you passed away. You made a mistake that isn’t good, but that’s part of being a human. By committing suicide, you are depriving the chance that you have to set things right in the future. I was in a similar boat recently. I lost my grandma, was fired, and had a hard breakup. I was convinced I was a terrible person and attempted suicide. I realized I needed more help and the problems I had as a person were caused by a deeper problem that needed help to fix. So you messed up, but don’t think that it defines who you are, it doesn’t. Don’t let it think you deserve to die, from one person who has made mistakes to another, you don’t deserve to die.",
      "created_utc": 1722106833.0,
      "score": 1
    },
    {
      "id": "lfwj4wk",
      "body": "Bro, I have 4 degrees and they’re worthless. Find a job you enjoy in a place you like living and do that.",
      "created_utc": 1722472794.0,
      "score": 1
    },
    {
      "id": "lgvi9x4",
      "body": "[removed]",
      "created_utc": 1722996340.0,
      "score": 1
    },
    {
      "id": "lgvu10v",
      "body": "Wala na po siya 😭😭😭😭",
      "created_utc": 1723001113.0,
      "score": 1
    },
    {
      "id": "lgw19mj",
      "body": "RIP dude. How I wish I could have met you personally since we were schoolmates :((",
      "created_utc": 1723004421.0,
      "score": 1
    },
    {
      "id": "lgygww2",
      "body": "RIP bro. Just heard the news",
      "created_utc": 1723046361.0,
      "score": 1
    },
    {
      "id": "lh9srp2",
      "body": "RIP man, i really hope your parents will one day be okay. i cant even imagine.",
      "created_utc": 1723209844.0,
      "score": 1
    },
    {
      "id": "lhf5rx7",
      "body": ":(( u were a kind soul",
      "created_utc": 1723288536.0,
      "score": 1
    },
    {
      "id": "lhybpm8",
      "body": "I miss you ga :<",
      "created_utc": 1723574954.0,
      "score": 1
    },
    {
      "id": "lijlbb7",
      "body": "I miss you ga :<",
      "created_utc": 1723889299.0,
      "score": 1
    },
    {
      "id": "lf32rw3",
      "body": "[removed]",
      "created_utc": 1722023760.0,
      "score": 1
    },
    {
      "id": "lf2crkm",
      "body": "Instead of taking that that pain... Use it to live your life... Yours isn't that bad... There's uglier out there you can't imagine...",
      "created_utc": 1722015290.0,
      "score": 1
    },
    {
      "id": "lf2e0u7",
      "body": "Dont do it",
      "created_utc": 1722015700.0,
      "score": 1
    },
    {
      "id": "lf3mv0o",
      "body": "Suicide has never been a solution, you can move away, start a new life and once you are stable, reconnect with your family",
      "created_utc": 1722030557.0,
      "score": -2
    },
    {
      "id": "lf66pfr",
      "body": "I made them look like a fool for years. I came from an upper middle-class family. aside from the supposed stipend i get from being on a top university (which i obviously wasn't getting anymore), i get a sizable amount of money as allowance from my parents too. Since i don't attend classes anymore, i got a once a week job from an engineering firm nearby for extra income. I feel so sad for my parents because they've been so good to me my whole life, and this is how i repay them. But the greatest blow to me is whenever i ask myself \"what would my mom feel about my death and how would she cope with it\". And the worst thing about all of this is the fact that i am an only child. After my death my parents would have no children anymore to keep themselves busy, i'm afraid they'd have a very very very hard time coping the death of their only child. I feel so sorry for them, for my (ex) girlfriend, and for everyone who believed in me. Death is the only solution to a virus like me.",
      "created_utc": 1722077535.0,
      "score": 20
    },
    {
      "id": "lf2jhbi",
      "body": "[removed]",
      "created_utc": 1722017456.0,
      "score": -140
    },
    {
      "id": "lf2utwk",
      "body": "It’s not 2 years it’s 4 years, dropped middle of first semester. Still not worth it if course",
      "created_utc": 1722021127.0,
      "score": 37
    },
    {
      "id": "lgx56nt",
      "body": "He already ended his life it is on the news",
      "created_utc": 1723028597.0,
      "score": 1
    },
    {
      "id": "lf66t5e",
      "body": "I am a bad person man, i know i am, i'm sorry",
      "created_utc": 1722077599.0,
      "score": -3
    },
    {
      "id": "lf4c5fi",
      "body": "I know this isn’t what you meant, but the first thing I thought of was helping people lie to their families that they’re going to college 😭",
      "created_utc": 1722040360.0,
      "score": 11
    },
    {
      "id": "lh2vg2k",
      "body": "He is not with us anymore he took his own life yesterday",
      "created_utc": 1723107781.0,
      "score": 1
    },
    {
      "id": "lf5sqxb",
      "body": "I assumed a country with free education",
      "created_utc": 1722067689.0,
      "score": 3
    },
    {
      "id": "lf65fx8",
      "body": "free education to all public universities here, and a stipend if you are on one of the top 10 universities, the uni i went to was both.",
      "created_utc": 1722076714.0,
      "score": 2
    },
    {
      "id": "lf4fqil",
      "body": "why do u want to end it?",
      "created_utc": 1722041842.0,
      "score": 1
    },
    {
      "id": "lf7calb",
      "body": "Hey man, i am so sorry yoi are in that situation too, but you deserbe to live. You never wronged anyone, unlike me.",
      "created_utc": 1722095472.0,
      "score": 0
    },
    {
      "id": "lf4ujdu",
      "body": "yeah, my family is from cebu, thankyou man",
      "created_utc": 1722048159.0,
      "score": 2
    },
    {
      "id": "lf6csvy",
      "body": "do you have a link or the title of the documentary? i think i would want to see it, thankyou",
      "created_utc": 1722081110.0,
      "score": 1
    },
    {
      "id": "lf7bdw6",
      "body": "Thankyou man, I do appreciate your sincerity and I am so sorry for what happened to your family member. But it is so hard man, when you feel like you don't deserve to live anymore, it's hard living the rest of my life if I decide to not end it after I blindsided my parents who did everything for me and loved me unconditionally to have a son like me, I don't know what else could keep me going at this point. I feel like it's a done deal on August 5.",
      "created_utc": 1722095154.0,
      "score": 1
    },
    {
      "id": "lgvbkv1",
      "body": "I know the kid. He was my student in his senior high school. Very tragic. Thank you for all the uplifting comments you gave him in his final days.",
      "created_utc": 1722993793.0,
      "score": 1
    },
    {
      "id": "lgvskt8",
      "body": "Hints of depression all over his posts. Wish someone would have checked on him. This is sad.",
      "created_utc": 1723000490.0,
      "score": 1
    },
    {
      "id": "lf40da4",
      "body": "Not OP but thanks a ton for writing all of this. This is pure Life-Fuel",
      "created_utc": 1722035676.0,
      "score": 3
    },
    {
      "id": "lf874d0",
      "body": "Also you have a job!! My parents are disappointed in me I’ve been unemployed for a year I can’t afford anything I’m living off of them. They hate my appearance too and the fact that I’m so shy. I hate it too. You’re nowhere near as pathetic as you think you are in my eyes you’re really amazing.",
      "created_utc": 1722106492.0,
      "score": 1
    },
    {
      "id": "lfl3qs6",
      "body": "Yes exactly ",
      "created_utc": 1722304544.0,
      "score": 2
    },
    {
      "id": "lgw3k9m",
      "body": "He did it sadly just got the bad news today 💔",
      "created_utc": 1723005556.0,
      "score": 2
    },
    {
      "id": "lfl22h1",
      "body": "Bro I am you, but I survived it. Just confess bro. My fam is upper class and I had situation like yours (I wrote separate comment above please read it). I promise it's fear in your heart, but you are only a human being, there is nothing like \"virus\"/\"defective\" human. But I know the feeling of big family/relatives putting pressure on you. They did so to ensure you their version of security and happiness. But if their way of living inflicjts pain and expectations inflicjt pressure in your, is it your fault? Do you have to d/e because of not being able to live according to their version of path to happiness?",
      "created_utc": 1722303889.0,
      "score": 2
    },
    {
      "id": "lfl4gnc",
      "body": "EXACTLY. You are also being selfish by trying to SA YOURSELF. Be a man and help put your family, you are ONLY CHILD, ONLY HOPE AND PROOF OF YOUR PARENTS LOVE. Bro, , both of your parents are alive and TOGETHER, you're damn happiest, and I guess you're just afraid to be a witness of breaking that happiness in your family...well let me say last thing- if you d/e, the happiness of your family will break DEFINITELY. but if you stay alive, you will create some fuss in family but you'll have more motivation to redeem that happiness in your family and even make it stronger. ",
      "created_utc": 1722304828.0,
      "score": 1
    },
    {
      "id": "lf6ey4b",
      "body": "tf is your problem? all this person is trying to say is that op isn't a bad person and that they dont have to kill themselves, and your respinse is \"yeah, right\"? Genuinely, wtf is your problem?",
      "created_utc": 1722082235.0,
      "score": 17
    },
    {
      "id": "lf6hd8w",
      "body": "What the hell is wrong with you?",
      "created_utc": 1722083414.0,
      "score": 13
    },
    {
      "id": "lfae0p7",
      "body": "The fuck man, oh ha ha look at me, I’m being funny by sarcastically saying that someone that is telling OP they’re not bad and don’t need to kill themselves ha ha ha. Shut up. Nobody laughed. It’s kinda of sick, ok a lot of sick, to say that, especially in a sub where we are trying to help people with suicidal thoughts. What if OP saw your comment and thought that u/VibratingColors was wrong? Oh fuck, that’s real helpful to the situation. I don’t know what kind of sick cynical humor you have but don’t be using it in this sub.",
      "created_utc": 1722138464.0,
      "score": 3
    },
    {
      "id": "lj0ux5w",
      "body": "What were the headlines? Where can I find them.?",
      "created_utc": 1724152610.0,
      "score": 1
    },
    {
      "id": "lf8ic0p",
      "body": "Probably no such thing",
      "created_utc": 1722110669.0,
      "score": 1
    },
    {
      "id": "lfl2fsx",
      "body": "YOU ARE NOT BAD bro :'(( Just, why put pressure on yourself like that :(. I promise if your parents love you they would HATE you thinking that they don't live you enough to protect you from your own self-destructive thoughts. Confess to them for their own sake, if not for your own, if you love them truly.",
      "created_utc": 1722304034.0,
      "score": 1
    },
    {
      "id": "lf7d6ej",
      "body": "Same😭😭😭 even after I've read your comment i was like \"is there any other meaning?\"",
      "created_utc": 1722095782.0,
      "score": 1
    },
    {
      "id": "lf7ymvx",
      "body": "Oh, damn. That’s actually dope.",
      "created_utc": 1722103394.0,
      "score": 1
    },
    {
      "id": "lfl3032",
      "body": "Bro Imagine it would be WAY WORSE if your parents were paying MILLION dollars for your education. You and your parents didnt lose anything!! Just think, there are students who pay more and drop out at the 4th year, they took real damage! Your case and situation is SO MUCH BETTER I promise you'll be laughing about these things with your parents after 10-15 years. Furthermore your fam is upper class so they can give you some job through connections so please just confess",
      "created_utc": 1722304255.0,
      "score": 1
    },
    {
      "id": "lf65the",
      "body": "Heartbreak ,illness ,regret ,guilt , depression,academic failure their is really nothing left for me to live for",
      "created_utc": 1722076961.0,
      "score": 2
    },
    {
      "id": "lfl3mvh",
      "body": "Bro I am from asian country so I assume the way parents put expectations on children education wise is similar. Bro, asian parents show their live this way by putting a lot of pressure now so you wouldn't struggle yourself later. But if you d/e then you are basically telling your parents that they don't love you enough to want you live. Do you really believe that? Do you really think your parents rather you under ground rotting than being upfront with them now?",
      "created_utc": 1722304502.0,
      "score": 2
    },
    {
      "id": "lgrdbyi",
      "body": "https://www.2doc.nl/documentaires/2022/11/schijnstudent.html",
      "created_utc": 1722946558.0,
      "score": 1
    },
    {
      "id": "lgrdfmf",
      "body": "And this one as well, but not sure if this one also covers the suicide case:\n\nhttps://www.2doc.nl/documentaires/2021/08/pretend-student.html",
      "created_utc": 1722946602.0,
      "score": 1
    },
    {
      "id": "lf7df7k",
      "body": "They love you, one-day they will be old and if you stay you will have the opportunity to more than give back what you feel they have paid to you. \n\nWhat keeps me here is that very thought. I can make up for it all. I can be worth it all. No matter the let downs I have myself in my regret list.\n\nI really don't want that to come off guilt trippy, I honestly don't mean it to. I just hope sincerely you stay here and see how life pans out. Love internet stranger.",
      "created_utc": 1722095868.0,
      "score": 1
    },
    {
      "id": "lf87t4e",
      "body": "Also sooooo many people drop out of university. It’s not for everyone. Even the people who graduate (me with difficulty I failed a year and went back) are struggling and are not managing half what you have and you don’t have debt. I don’t want the people around you expect from you, even if you fall short of their expectations you’re still so cool.",
      "created_utc": 1722106748.0,
      "score": 1
    },
    {
      "id": "lgvgmgv",
      "body": "u/Impressive-Media-823 Sad to say that OP ended his life. It's in the news now where I found out all about his reddit post on investigation.",
      "created_utc": 1722995702.0,
      "score": 3
    },
    {
      "id": "lgzcj3z",
      "body": "He is not with us anymore he took his own life. I was shockes to find he made a post here I wish those closest to him saw this post earlier",
      "created_utc": 1723055978.0,
      "score": 2
    },
    {
      "id": "lj2dot5",
      "body": "Facebook.",
      "created_utc": 1724172121.0,
      "score": 0
    },
    {
      "id": "lgzcp9s",
      "body": "He is not with us anymore sadly",
      "created_utc": 1723056031.0,
      "score": 1
    },
    {
      "id": "lf8l2ab",
      "body": "Well, I did mean to help others commit fraud, and I don't even mean it in a bad way, lol. After all, you have to have some skill to make this business profitable.",
      "created_utc": 1722111673.0,
      "score": 1
    },
    {
      "id": "lh8xlc1",
      "body": "😭😭😭😭",
      "created_utc": 1723194362.0,
      "score": 1
    },
    {
      "id": "lgxwaoz",
      "body": "He alrdy did it.🥲 its in the news",
      "created_utc": 1723039815.0,
      "score": 1
    }
  ]
}