{
  "id": "1iwf079",
  "title": "Facing 10-20 years of prison",
  "selftext": "All drug charges. I’m a 21 year old autistic dude that self medicates. Extremely hard for me to work and get out there in the world with my invisible disability. Absolute waste of taxpayer funds sending the swat team to my parent’s over a young disabled guy with drugs. \nI’m charged with 19 drug charges in NJ one being 10-20 years minimum sentence. \nMy public defender is talking about potential of drug court. If that doesn’t happen and I go to prison I really believe I would kill myself. It’s concerning , my thoughts since being put in jail. My one cell mate got in a fight and I was locked down during the Holidays by myself. Started hearing voices in the room and became insane. If the plea deal isn’t right and it goes to trial Im most likely pulling the plug .  This justice system isn’t fair and most likely going to fuck me. Incarceration isn’t for someone with my disability and charges ",
  "created_utc": 1740330750.0,
  "score": 758,
  "num_comments": 92,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1iwf079/facing_1020_years_of_prison/",
  "comments": [
    {
      "id": "medg5fd",
      "body": "I'm really sorry to hear that.  Thats fucking insane.",
      "created_utc": 1740332158.0,
      "score": 309
    },
    {
      "id": "meebaas",
      "body": "[removed]",
      "created_utc": 1740341123.0,
      "score": 217
    },
    {
      "id": "medior2",
      "body": "We're wildly unsuited for the modern world. Humans are cruel and unusual by nature. I'm trying to figure out why I would come to this planet if it *was* a choice I made before coming. If I could become this \"neurodivergent\" thing that is punished for adapting to my environment, why would any being put me here at all. To punish me?\nDon't get me wrong, the good moments are good when they are. But why must they be outweighed by the bad moments? To make me appreciate the good moments? Forget it. I'm tired.",
      "created_utc": 1740332896.0,
      "score": 209
    },
    {
      "id": "mefad56",
      "body": "Did you get a possession charge, possession with intent  to distribute or an actual distribution charge? What drug was it? How much of it did you have? I'm not trying to pry I'm just trying to figure out the nature of your case and why did you get 19 separate charges?  More than likely you will get this dropped to a simple possession and drug Court/probation. But I'll tell you ahead of time, drug court is incredibly strict and you have no room for error, I only knew one person out of a bunch of users that successfully completed drug court.",
      "created_utc": 1740351766.0,
      "score": 30
    },
    {
      "id": "medhz5l",
      "body": "Sucks, people get charged for personal drug consumption. Hopefully you don’t get that much time, you didn’t hurt anyone.",
      "created_utc": 1740332692.0,
      "score": 124
    },
    {
      "id": "medrgyf",
      "body": "Fellow autistic person here. Life for us is hell. There’s no way around it. I don’t know your exact story but I also use drugs to self medicate so I can empathize with your situation. The fact that you’re risking prison for a victimless “crime” is just not right. Possession which should not even be a crime imo, addiction is a symptom of mental illness and is a health matter, not a criminal one. You’re being failed by the world right now and I’m sorry this is happening",
      "created_utc": 1740335409.0,
      "score": 84
    },
    {
      "id": "mefrcdc",
      "body": "This system is designed to suppress marginalized folks who simply have non neurotypical brains primarily due to our environment. I’m sorry.",
      "created_utc": 1740357440.0,
      "score": 15
    },
    {
      "id": "mee9sat",
      "body": "what type of backwards state gives 10 years for using a substance? How ridiculous. I am so sorry this is happening to you and I wish you nothing but the best luck.",
      "created_utc": 1740340686.0,
      "score": 70
    },
    {
      "id": "meexg5h",
      "body": "im rlly fucking sorry you have to go thru ts. you shouldn’t be facing this much over drugs when awful people walk free. i wish i could help more, but i am wishing u nothing but the best. life isnt fair and the system is fucked up",
      "created_utc": 1740347730.0,
      "score": 11
    },
    {
      "id": "megqlef",
      "body": "Beyond insane that it’s even remotely possible to do that amount of time for personal drug use. There are murderers and rapists roaming the streets as we speak that were sentenced to half of what you’re facing. There is no such thing as justice in this country. The prison system is a business and you are a victim. I’m sorry.",
      "created_utc": 1740370170.0,
      "score": 11
    },
    {
      "id": "medn4oi",
      "body": "I'm sorry. I understand how hard the world is for autistic folks like us. People don't care about making the world more bearable for us but then they blame us when we take drastic measures to find solutions. So unfair, hope things get better",
      "created_utc": 1740334173.0,
      "score": 34
    },
    {
      "id": "medhs6s",
      "body": "All i can say is flee away to thailand or any 3rd world country 🙏",
      "created_utc": 1740332636.0,
      "score": 41
    },
    {
      "id": "megl9tz",
      "body": "I'm sorry.\n\nI hope someday in the future drug addicts/dealers can get help/rehab instead of being locked up for decades to fill the pockets of the private prison industry.\n\nChild rapists and murderers can get even shorter sentences than this, it's a truly fucked-up ''justice'' system.",
      "created_utc": 1740368072.0,
      "score": 7
    },
    {
      "id": "mei4hlo",
      "body": "Sending a swat unit to get you isn't a good sign. Means you were probably under surveillance for some time. Not sure what the charges were, but 19 charges is crazy. Idk how it is in NJ, I'm in MD, and they're pretty progressive on certain drug charges. Trying to help the addicts get clean, since locking them up just leads to OD when they eventually get out. Gotta have some paperwork showing your illness, showing them you're working on bettering yourself. Best of luck to you",
      "created_utc": 1740397554.0,
      "score": 6
    },
    {
      "id": "meed9r4",
      "body": "...humans are a plauge... the judge is not human tho....thats a monster.",
      "created_utc": 1740341702.0,
      "score": 26
    },
    {
      "id": "meht8hs",
      "body": "This is a real horror story I’m sorry and I hope somehow they can lower your sentence because let’s be real taking drugs isn’t a crime. Just a bunch of fuckin bitches who got bullied in Highschool trying to ruin you’re life, just always remember life can make a 180 change at any moment but you have to fight for it. First time drug offender has a better chance than you would think. Good luck, lawyer up and I hope those mfs give you a second chance.",
      "created_utc": 1740391066.0,
      "score": 5
    },
    {
      "id": "meewkb1",
      "body": "The war on drugs is a literal war against the people",
      "created_utc": 1740347461.0,
      "score": 16
    },
    {
      "id": "mefaruu",
      "body": "[deleted]",
      "created_utc": 1740351899.0,
      "score": 3
    },
    {
      "id": "mehiynk",
      "body": "Really wishing you the best of luck.",
      "created_utc": 1740384670.0,
      "score": 3
    },
    {
      "id": "mehkihw",
      "body": "Was this a distribution charge? I’m familiar with these types of charges & I have never heard of back up time like this for a CDS possession unless it was intent to distribute or subsequent offender",
      "created_utc": 1740385632.0,
      "score": 3
    },
    {
      "id": "mef34ws",
      "body": "The war on drugs is fucking lunacy. This has destroyed countless lives, literally over nothing. Most illegal drugs are safer than legal proscription drugs, but they do not offer a hefty profit for big pharma",
      "created_utc": 1740349477.0,
      "score": 10
    },
    {
      "id": "mefdbpz",
      "body": "You'll get probation most likely. They want you in the system. I'm sorry.",
      "created_utc": 1740352743.0,
      "score": 4
    },
    {
      "id": "megxdg0",
      "body": "I'm undiagnosed 24 year old autistic and I can feel your frustration.\n\nLife is hell for us and the corrupt justice system only adds salt to the wound.\n\nFacing prison time while autistic is so much worse and is one of my biggest fears.\n\nI'm so sorry and wish I could do more to help.",
      "created_utc": 1740373117.0,
      "score": 4
    },
    {
      "id": "meeiokq",
      "body": "very unlikely and you can be out on probation and they WILL factor in your disabilities and mental health, dw, but get outside counsel as well, i'm not familiar with NJ but they most lawyers have free consultation in NA in general. and charges for selling isnt the same as those for dealing but i do wanna know what those charges are.",
      "created_utc": 1740343318.0,
      "score": 2
    },
    {
      "id": "mehaodz",
      "body": "so sorry to read this.",
      "created_utc": 1740379818.0,
      "score": 2
    },
    {
      "id": "mehpg9r",
      "body": "Drug charges a lot of times they way early release. Just stay out of trouble and you could be out much sooner.",
      "created_utc": 1740388736.0,
      "score": 2
    },
    {
      "id": "meixpgo",
      "body": "Sounds like hell",
      "created_utc": 1740408892.0,
      "score": 2
    },
    {
      "id": "mekb42r",
      "body": "Im not really sure what to say brother, this is a very difficult situation. I can only share what I do when faced with tough odds. I usually get down on my knees and pray and it usually works out somehow.",
      "created_utc": 1740423103.0,
      "score": 2
    },
    {
      "id": "mellr77",
      "body": "hope they give your ass the death penalty",
      "created_utc": 1740436241.0,
      "score": 2
    },
    {
      "id": "men4ffg",
      "body": "[removed]",
      "created_utc": 1740454079.0,
      "score": 2
    },
    {
      "id": "mfek3y0",
      "body": "You may want to consider ghosting and seeking asylum or infiltrating another country.",
      "created_utc": 1740818944.0,
      "score": 2
    },
    {
      "id": "mqz8gjz",
      "body": "🍇a child? 6 months probation. Harmless drug possession? HOUSE SWATTED 20 YEARS PRISON NO PAROLE. Dont you just love the american justice system?",
      "created_utc": 1746575454.0,
      "score": 2
    },
    {
      "id": "mef9aep",
      "body": "After you get through this mess, and you will; move to the west coast and self-medicate as needed.  You can do this, don't give up.",
      "created_utc": 1740351420.0,
      "score": 3
    },
    {
      "id": "mefttkh",
      "body": "And what are said charges exactly? You're really facing a 10 year minimum for simple possession?",
      "created_utc": 1740358274.0,
      "score": 3
    },
    {
      "id": "meei9rt",
      "body": "I'm in a similar situation, luckily out on bail. A bunch of predatory thugs in blue were preying on people coming home from a music festival, and this disabled chronic pain patient with ADHD just happened to get caught in the drag net. Bankrupted ourselves paying criminal defense lawyers to hopefully get them to fuck off. Hoping the 4th amendment will protect us. Otherwise? It'll fall to the 2nd. No disgusting pig is ever going to lay its filthy paws on my wife or myself ever again, regardless of what they say.",
      "created_utc": 1740343194.0,
      "score": 1
    },
    {
      "id": "mfclq4m",
      "body": "Im genuinely confused why drug charges have such hefty penalties tbh. Aslong as someone is just using it on themselves and not hurting anybody, why in the world would that warrant prison time vs just getting them help to not have to rely on as much drugs/at all...",
      "created_utc": 1740788668.0,
      "score": 1
    },
    {
      "id": "mefo2d7",
      "body": "It was actually CP",
      "created_utc": 1740356337.0,
      "score": -2
    },
    {
      "id": "meg12yv",
      "body": "You cannot sue or ask for parole?",
      "created_utc": 1740360750.0,
      "score": 0
    },
    {
      "id": "mef5g2m",
      "body": "[deleted]",
      "created_utc": 1740350204.0,
      "score": -5
    },
    {
      "id": "meexg6l",
      "body": "I feel for you man. Is it possible your mom drank while she was pregnant with you? ASD looks a lot like FASD and it’s estimated 50% of the prison population was exposed to teratogen while in utero.",
      "created_utc": 1740347730.0,
      "score": -8
    },
    {
      "id": "mefg4pc",
      "body": "You can get through it you could still have 50 years of life left on release",
      "created_utc": 1740353680.0,
      "score": -7
    },
    {
      "id": "mefpx5k",
      "body": "Hopefully his state is somewhat progressive and can cut some slack regarding his being an addict. I dated a guy who'd been in and out of prison for 20 years and his second to last charge gave him the chance to clean up for 9 months at a rehab facility(before the last one caught up to him). Another guy I knew was able to get his drug and robbery charges lessened in exchange for a couple of months in rehab + probation",
      "created_utc": 1740356962.0,
      "score": 50
    },
    {
      "id": "memhrpu",
      "body": "It’s first degree charge",
      "created_utc": 1740446366.0,
      "score": 1
    },
    {
      "id": "medjd4n",
      "body": "OP, I really hope that everything will turn out okay for you in the end. Dying is scary, but the world is a lot scarier. I will be thinking of you.",
      "created_utc": 1740333091.0,
      "score": 49
    },
    {
      "id": "mejnlh1",
      "body": "I'm convinced that i fucked up in another world and this is now my hell or punishment. Its really the only thing that makes sense. ",
      "created_utc": 1740416514.0,
      "score": 8
    },
    {
      "id": "mefh8k2",
      "body": "Probably intent to distribute, given that it happens all the time with self-medication bought in bulk.",
      "created_utc": 1740354049.0,
      "score": 27
    },
    {
      "id": "memietf",
      "body": "All 3 of the charges you mentioned. Allegedly 1st degree LSD, Suboxone, Gabapentin, Cannabis, & Half a pill of Xanax charges . 19 charges because they built a case",
      "created_utc": 1740446580.0,
      "score": 5
    },
    {
      "id": "memilgb",
      "body": "This dude in jail had multiple sex offenses and was released before me",
      "created_utc": 1740446641.0,
      "score": 3
    },
    {
      "id": "mefb2nt",
      "body": "Second this bru this just humans and human laws, you don’t gotta comply, pack yo shit and gtfo",
      "created_utc": 1740351997.0,
      "score": 20
    },
    {
      "id": "meeyduv",
      "body": "Bumping this ^^ Life is too beautiful to end it… get out of the states!",
      "created_utc": 1740348017.0,
      "score": 16
    },
    {
      "id": "meewj53",
      "body": "Yes!!! Go to Nicaragua (I’m from there). You’ll love the beautiful  beaches from there , the weather, how friendly people are  and everything is super cheap.  Not even kidding, it’s a way better option than rotting in prison here !!! and if not Nicaragua , somewhere in Central America.",
      "created_utc": 1740347452.0,
      "score": 12
    },
    {
      "id": "meev2h5",
      "body": "Second this, hard. Get out of this hellhole! Capitalism was build to kill us autistics not ever help us. Flee and start again in a better country.",
      "created_utc": 1740347013.0,
      "score": 13
    },
    {
      "id": "memiufr",
      "body": "The big alleged charge is LSD",
      "created_utc": 1740446725.0,
      "score": 1
    },
    {
      "id": "meejfoz",
      "body": "Monsters, subhuman gangster trash. That's what they are and all they are. I've known a few in my community to commit suicide after situations like this. I was always thinking \"well, if you're going to die anyway, why not take the trash out to the curb on your way out\". They need to be afraid.",
      "created_utc": 1740343542.0,
      "score": 12
    },
    {
      "id": "mejow49",
      "body": "Two years might as well be life for some people. A lot of us live without much safety net. Even two years in prison you have to start over from zero again. I've done time too. 2 years now for me is the same as a death sentence",
      "created_utc": 1740416876.0,
      "score": 1
    },
    {
      "id": "memj0i4",
      "body": "1st degree LSD",
      "created_utc": 1740446780.0,
      "score": 1
    },
    {
      "id": "memj2cn",
      "body": "1st degree LSD everyone telling me im going to prison",
      "created_utc": 1740446797.0,
      "score": 1
    },
    {
      "id": "mepwzur",
      "body": "I’m on pre trial release",
      "created_utc": 1740499216.0,
      "score": 2
    },
    {
      "id": "menh227",
      "body": "That was my thought! Maybe on one of the computers?",
      "created_utc": 1740459041.0,
      "score": 0
    },
    {
      "id": "mefht6d",
      "body": "No one is *playing* with lifelong disability. We don't have a functioning medical system, instead we have [this](https://www.cnn.com/2016/03/23/politics/john-ehrlichman-richard-nixon-drug-war-blacks-hippie/index.html).",
      "created_utc": 1740354237.0,
      "score": 4
    },
    {
      "id": "mefjomc",
      "body": "Exceedingly humane.",
      "created_utc": 1740354859.0,
      "score": 1
    },
    {
      "id": "mege03l",
      "body": "It’s New Jersey so ehhhhhhhh",
      "created_utc": 1740365370.0,
      "score": 14
    },
    {
      "id": "memhwix",
      "body": "I don’t know about that when I had a DUI from a psychiatric injectable medication they wanted to pin the DUI and drop everything else",
      "created_utc": 1740446409.0,
      "score": 1
    },
    {
      "id": "memq33h",
      "body": "thats just fucked up. im wishing you nothing but the best man i hope everything turns out better than expected. just remember its not you, its the system and u dont deserve to be treated the way u did. dont give up i know it sounds corny and shit and u probably dont wanna even hear it but shit might get better",
      "created_utc": 1740449148.0,
      "score": 1
    },
    {
      "id": "memiqko",
      "body": "I don’t even know how I would flee I don’t have a passport Im a broke autist",
      "created_utc": 1740446689.0,
      "score": 2
    },
    {
      "id": "meejxc5",
      "body": "i already know id kms. But shout out to Luigi fr!",
      "created_utc": 1740343690.0,
      "score": 13
    },
    {
      "id": "meh3195",
      "body": "New Jersey isn't Texas.  There is a good chance he gets directed toward treatment.",
      "created_utc": 1740375786.0,
      "score": 11
    },
    {
      "id": "megg5p3",
      "body": "Hey, the first guy was in Montana and had one of our towns stricter judges, and the second was in Tennessee coming from a family kind of known for their problems. Sometimes you just get lucky",
      "created_utc": 1740366169.0,
      "score": 14
    },
    {
      "id": "men7dvk",
      "body": "Is there any way you can open a credit card to pay for the passport & ticket out?",
      "created_utc": 1740455152.0,
      "score": 1
    },
    {
      "id": "menpxq5",
      "body": "I think it’s less than $150",
      "created_utc": 1740463177.0,
      "score": 1
    },
    {
      "id": "mepwuqo",
      "body": "They won’t give me a passport with 19 drug charges on pre trial release. They definitely wouldn’t",
      "created_utc": 1740499174.0,
      "score": 2
    },
    {
      "id": "mf0jm8j",
      "body": "oh yeah I kinda forgot about that you are right , such a shame you don't have one",
      "created_utc": 1740628825.0,
      "score": 1
    }
  ]
}