{
  "id": "1ex06yl",
  "title": "\"suicide is a permanent solution to a temporary problem\"",
  "selftext": "I don't get it, it's a permanent solution which means you won't have any other problems. If it works it works, it's still a solution.",
  "created_utc": 1724171647.0,
  "score": 635,
  "num_comments": 131,
  "url": "https://www.reddit.com/r/SuicideWatch/comments/1ex06yl/suicide_is_a_permanent_solution_to_a_temporary/",
  "comments": [
    {
      "id": "lj306of",
      "body": "After my attempt one of the paramedics hit me with that line when I was in the ambulance,vso I said \"what if the problem is permanent\"",
      "created_utc": 1724179057.0,
      "score": 281
    },
    {
      "id": "lj30wx9",
      "body": "Saying \"suicide is a permanent solution to a temporary problem\" is a temporary solution to a permanent problem.",
      "created_utc": 1724179279.0,
      "score": 469
    },
    {
      "id": "lj3b2d7",
      "body": "Yeah that phrase is stupid, because suicide is literally the only permanent decision you can make, literally everything else in life is temporary. I personally interpret it as someone telling me that like 5 days before I die of old age I'll finally won't be mentally ill anymore.",
      "created_utc": 1724182435.0,
      "score": 97
    },
    {
      "id": "lj3qvln",
      "body": "Some problems aren't temporarily anyway. And some of us are just sick and tired of fighting non-stop.",
      "created_utc": 1724187345.0,
      "score": 75
    },
    {
      "id": "lj3s6d5",
      "body": "My problem is that I was born, tell me what's temporary about that.",
      "created_utc": 1724187743.0,
      "score": 139
    },
    {
      "id": "lj34g3g",
      "body": "It's a terrible phrase.  It is tremendously dismissive of the difficulties people can face in life to simply say \"meh, that's a temporary problem.\"\n\n\nA lot of people I've loved are gone from this life forever.  Someone who tells me that my grief is \"a temporary problem\" is a fucking scumbag.",
      "created_utc": 1724180355.0,
      "score": 80
    },
    {
      "id": "lj3t5n1",
      "body": "It's absolutely not a temporary problem for some of us. And if it is its only because death is an option",
      "created_utc": 1724188050.0,
      "score": 21
    },
    {
      "id": "lj4u5a8",
      "body": "It’s like telling a kid in a wheelchair to stand up for themselves.",
      "created_utc": 1724200812.0,
      "score": 20
    },
    {
      "id": "lj3vp4g",
      "body": "That *is* the whole point after all",
      "created_utc": 1724188860.0,
      "score": 19
    },
    {
      "id": "lj2q1je",
      "body": "Yeah, it annoys me when people say it. Like, idc if it's permanent, its a real effective solution when it works.",
      "created_utc": 1724175944.0,
      "score": 68
    },
    {
      "id": "lj478wo",
      "body": "When you are in physical pain everyday of your life. It's not a \"temporary problem\".",
      "created_utc": 1724192672.0,
      "score": 17
    },
    {
      "id": "lj3n3d3",
      "body": "I've always thought this was an inconsistent argument as well.  If there's one thing suicide isn't it's temporary.",
      "created_utc": 1724186177.0,
      "score": 16
    },
    {
      "id": "lj578wd",
      "body": "MY LIFE is the problem and its pretty damn permanent",
      "created_utc": 1724205620.0,
      "score": 14
    },
    {
      "id": "lj3jxa7",
      "body": "My problems are chronic and are not going to end. My problems are permanent. Suicide would help me",
      "created_utc": 1724185200.0,
      "score": 26
    },
    {
      "id": "lj4efz2",
      "body": "I always say, \"a solution is still a solution\". No matter which one you choose lol",
      "created_utc": 1724195143.0,
      "score": 10
    },
    {
      "id": "lj4rldh",
      "body": "Its such an arrogant line. Its what uneducated people say to people that are struggling. Some problems are permanent. And to act like they aren't is ridiculous.",
      "created_utc": 1724199881.0,
      "score": 11
    },
    {
      "id": "lj3vazq",
      "body": "And some problems people get suicidal for are indeed permanent. I’ve been suicidal because of my autism and my joint issues. None of those things are ever going to go away. Maybe my joint issues if I win the lottery and can find top notch experts who could understand what’s going on. But even then I’d be having a lifetime of PT and surgeries so my life wouldn’t really be normal, would it?",
      "created_utc": 1724188735.0,
      "score": 15
    },
    {
      "id": "lj4r2oj",
      "body": "Ayo i told my therapist that if all else fails its my backup plan😍",
      "created_utc": 1724199690.0,
      "score": 7
    },
    {
      "id": "lj5bi54",
      "body": "My problem is permanent I have fucking brain damage from the psych ward",
      "created_utc": 1724207205.0,
      "score": 7
    },
    {
      "id": "lj5d8bd",
      "body": "Well my so called temporary problem has been going on for 30 years now since I was 20. And at 50 I just want this to be done already.",
      "created_utc": 1724207865.0,
      "score": 7
    },
    {
      "id": "lj6ctlb",
      "body": "Aren't we looking for permanent solutions to temporary problems? Why would we want a temporary solution to any problem?\n\nThis is probably the dumbest thing you can tell a suicidal person because inadvertently you're telling them suicide is the answer.",
      "created_utc": 1724226388.0,
      "score": 7
    },
    {
      "id": "lj3pyx7",
      "body": "Who’s to say that the problems are temporary? But then, if life is finite, all problems are temporary.",
      "created_utc": 1724187064.0,
      "score": 12
    },
    {
      "id": "lj4rzcy",
      "body": "I'll say it again but my problem isn't temporary it's chronic.",
      "created_utc": 1724200023.0,
      "score": 7
    },
    {
      "id": "lj4wzuj",
      "body": "Yeah, I've always thought it was a dumb statement. Especially because when I hear it all I hear is that it IS a solution to problems that I can see no other solution for.",
      "created_utc": 1724201834.0,
      "score": 7
    },
    {
      "id": "lj551if",
      "body": "While I do feel some problems are temporarily like acne. But sometimes there are problems that don't go away. Like living.",
      "created_utc": 1724204811.0,
      "score": 4
    },
    {
      "id": "lj6dcmf",
      "body": "This is even sadder when you realise a character Robin Williams played said this ",
      "created_utc": 1724226735.0,
      "score": 5
    },
    {
      "id": "lj83wlg",
      "body": "It's not temporary. This world has been built for a  certain type of people. By them. For them.",
      "created_utc": 1724254547.0,
      "score": 5
    },
    {
      "id": "lj84fdq",
      "body": "I'm not prepared to live in shit anymore. I've had enough!",
      "created_utc": 1724254711.0,
      "score": 4
    },
    {
      "id": "lj9biz6",
      "body": "Idk I kinda want to end this nonsense. This saying is just a slogan something to get people to keep going. I’m very close to ending this. Just gonna form a plan and after that comes the curtain call.",
      "created_utc": 1724268014.0,
      "score": 3
    },
    {
      "id": "lja7s2b",
      "body": "I think it's just an empty phrase well meaning people say because they can't think of anything else. They don't understand what it's like when it's your life, it's your brain telling you to just end it.",
      "created_utc": 1724278158.0,
      "score": 4
    },
    {
      "id": "lj616vv",
      "body": "Problems are temporary because everybody dies sooner or later.",
      "created_utc": 1724219117.0,
      "score": 3
    },
    {
      "id": "lj68cls",
      "body": "As someone who's dealt with this shit for my entire life (just turned 32) this is not a \"temporary problem\".",
      "created_utc": 1724223467.0,
      "score": 3
    },
    {
      "id": "lj7fyj1",
      "body": "If severe mental illness such as psychosis ruins you and changes you to the worse, it’s not temporary",
      "created_utc": 1724246719.0,
      "score": 3
    },
    {
      "id": "lj7xxk1",
      "body": "clock that tea it is objectively the most efficient and effective solution to everything but they play dumb",
      "created_utc": 1724252696.0,
      "score": 3
    },
    {
      "id": "lj900m2",
      "body": "I hate it when people say that. Chronic lifelong depression is not a temporary problem. It's been with me over 40 years.",
      "created_utc": 1724264412.0,
      "score": 3
    },
    {
      "id": "lj9yzr5",
      "body": "Not all problems are temporary problems. That statement is coined for the temporary problems.",
      "created_utc": 1724275265.0,
      "score": 3
    },
    {
      "id": "ljgy0kq",
      "body": "Severe autism and a complete inability to survive in the world isn't a temporary problem, so I'll take a permanent solution thanks...",
      "created_utc": 1724373475.0,
      "score": 3
    },
    {
      "id": "ly2fnmt",
      "body": "The problems are permanent sadly",
      "created_utc": 1732088429.0,
      "score": 3
    },
    {
      "id": "lj5rgco",
      "body": "also its not temporary its just years and years of unceasing unrelenting anguish",
      "created_utc": 1724213969.0,
      "score": 2
    },
    {
      "id": "lj60dur",
      "body": "To me it resonates because the only guarantee in life is change and death. We have no way of knowing what our situation will be in the future and despite how hopeless I can feel if there is a possibility of change I don't want to cut that off by dying. I understand other people may not feel that way and there are things we suffer with that are likely to last with us our entire lives however the circumstances feelings and people can and do change.",
      "created_utc": 1724218659.0,
      "score": 2
    },
    {
      "id": "lj2jknd",
      "body": "i heard this in a movie once “my suicide directors cut”",
      "created_utc": 1724173949.0,
      "score": 1
    },
    {
      "id": "lj2olji",
      "body": "get some life insurance",
      "created_utc": 1724175501.0,
      "score": 1
    },
    {
      "id": "lj4lhgg",
      "body": "[removed]",
      "created_utc": 1724197634.0,
      "score": 1
    },
    {
      "id": "lj55vfc",
      "body": "[deleted]",
      "created_utc": 1724205115.0,
      "score": 1
    },
    {
      "id": "lj56v8o",
      "body": "The point is that the temporary problem goes away and gives way to whatever ever there was to experience in your life. The statement doesn’t make sense only if you think the problem isn’t temporary but that’s a diff convo",
      "created_utc": 1724205480.0,
      "score": 1
    },
    {
      "id": "lj6eq00",
      "body": "I care too much about my family to ever hurt myself but I don't care enough about myself to stop thinking about it. It's a really shitty mindset because I know how much value I have but I always trick myself of the opposite. Endlessly unbalanced",
      "created_utc": 1724227651.0,
      "score": 1
    },
    {
      "id": "lj6o4d5",
      "body": "I've been thinking this recently. Life hasn't been great to me lately and I feel like Im stuck. I'm just so tired of not having a normal peaceful day.",
      "created_utc": 1724233790.0,
      "score": 1
    },
    {
      "id": "lja0poc",
      "body": "Exactly like I won’t care if it wasn’t the right decision because i literally won’t be here to care ",
      "created_utc": 1724275819.0,
      "score": 1
    },
    {
      "id": "lja45m4",
      "body": "[removed]",
      "created_utc": 1724276936.0,
      "score": 1
    },
    {
      "id": "ljbo9rx",
      "body": "Sometimes logical minds are the most illogical when we don't understand our emotions",
      "created_utc": 1724297694.0,
      "score": 1
    },
    {
      "id": "ljh3kdz",
      "body": "Actually most of the time it’s a permanent problem, both my parents happen to be verbally abusive, my father left last year but won’t leave me alone, my mum on the other hand is insulting me constantly etc sooo",
      "created_utc": 1724375523.0,
      "score": 1
    },
    {
      "id": "lk4kzb0",
      "body": "Ong! Like tfym? ",
      "created_utc": 1724732795.0,
      "score": 1
    },
    {
      "id": "lk64cs2",
      "body": "Anyone who said that has clearly never had chronic pain.",
      "created_utc": 1724764180.0,
      "score": 1
    },
    {
      "id": "lplrajh",
      "body": "I never get this quote either. After suicide u have no more problems. So is it not the ultimate solution to all problems??",
      "created_utc": 1727670194.0,
      "score": 1
    },
    {
      "id": "lj38xsp",
      "body": "Tbh there's clear line between person who actually wanna commit it or not most of us here who never feel like do it mean you guys really understand why those people feel that way",
      "created_utc": 1724181765.0,
      "score": 1
    },
    {
      "id": "lj4vzi7",
      "body": "Maybe for us doing it will be a permanent solution, but for your family or loved ones it will not be permanent, added to the psychological problems that it causes to family members, well they will have to go to therapy, but if I always tell my therapist that it is the permanent solution for a problem that is not. But if you want to see it that way, it is the permanent solution.",
      "created_utc": 1724201472.0,
      "score": 0
    },
    {
      "id": "lj4t32w",
      "body": "[removed]",
      "created_utc": 1724200426.0,
      "score": -12
    },
    {
      "id": "lj2vlnf",
      "body": "[removed]",
      "created_utc": 1724177652.0,
      "score": -21
    },
    {
      "id": "lj5o4uo",
      "body": "[deleted]",
      "created_utc": 1724212389.0,
      "score": 66
    },
    {
      "id": "lj58y98",
      "body": "Exactly, my problem has been with me ever since I was 10 (when I just about gained consciousness of the world around me, or more precisely, the people and the problems within it). It’s been a long lot of years and years since then. And a lot of failed attempts as well.",
      "created_utc": 1724206254.0,
      "score": 30
    },
    {
      "id": "lj4i0jk",
      "body": "This",
      "created_utc": 1724196401.0,
      "score": 26
    },
    {
      "id": "lj4wgll",
      "body": "What sick loser thinks mental health is a temp problem",
      "created_utc": 1724201642.0,
      "score": 98
    },
    {
      "id": "lj4hfxi",
      "body": "Catch 22 moment",
      "created_utc": 1724196199.0,
      "score": 24
    },
    {
      "id": "lj394ty",
      "body": "Exactly",
      "created_utc": 1724181827.0,
      "score": 34
    },
    {
      "id": "lj5uomc",
      "body": "preach",
      "created_utc": 1724215606.0,
      "score": 6
    },
    {
      "id": "lj4gb5y",
      "body": "We all die in the end so like the whole 'being alive' -state is also temporary...",
      "created_utc": 1724195800.0,
      "score": 22
    },
    {
      "id": "ljmtdy2",
      "body": "Well, living inherently is a temporary concept.",
      "created_utc": 1724459077.0,
      "score": 1
    },
    {
      "id": "lj3rd8m",
      "body": "I'm so glad there's someone who has the same feelings as I. I miss those I lost so badly (both passed and not passed) that it fucking hurts in an unbearable amount. It's not getting better and I need to actively block my emotions to function, wouldn't exactly call that temporary. I will always feel awful because I cannot stop loving them.",
      "created_utc": 1724187493.0,
      "score": 15
    },
    {
      "id": "lj8tpbi",
      "body": "if someone ever tells me that phrase, and mean it, then im sorry, im going for their neck, no hesitation",
      "created_utc": 1724262495.0,
      "score": 3
    },
    {
      "id": "lj5zjvv",
      "body": "Oh, my favorite new quote.",
      "created_utc": 1724218189.0,
      "score": 7
    },
    {
      "id": "lj3k7xo",
      "body": "Yeah I understand but by this logic this is still temporary because you could accept them. But anyways suicide would help everyone honestly.",
      "created_utc": 1724185290.0,
      "score": 10
    },
    {
      "id": "lj8uliy",
      "body": "bro thats a waaay better phrase",
      "created_utc": 1724262766.0,
      "score": 4
    },
    {
      "id": "lj3qbgx",
      "body": "Well logically all problem are temporary cause you can just accept and endure the problem even if you don't put a solution on it, the solution is acceptance. But anyways suicide is better.",
      "created_utc": 1724187172.0,
      "score": 8
    },
    {
      "id": "lj2lznz",
      "body": "What I just said or suicide is a permanent solution to a temporary problem?",
      "created_utc": 1724174703.0,
      "score": 1
    },
    {
      "id": "lj2orog",
      "body": "Why?",
      "created_utc": 1724175553.0,
      "score": 3
    },
    {
      "id": "lj4lo8o",
      "body": "draw some art\\*",
      "created_utc": 1724197701.0,
      "score": 0
    },
    {
      "id": "lj560vx",
      "body": "Hope for what",
      "created_utc": 1724205169.0,
      "score": 7
    },
    {
      "id": "lja4eye",
      "body": "If I was truly suicidal I would have done it already without catching attention but at this point give me a way",
      "created_utc": 1724277021.0,
      "score": 1
    },
    {
      "id": "lj7zw1t",
      "body": "Who cares? That's the entire point of being dead, you're free of the consequences of your actions.",
      "created_utc": 1724253303.0,
      "score": 6
    },
    {
      "id": "lj4te5t",
      "body": "You don't get it",
      "created_utc": 1724200541.0,
      "score": 10
    },
    {
      "id": "lj68w0r",
      "body": "r/thanksimcured",
      "created_utc": 1724223809.0,
      "score": 4
    },
    {
      "id": "lj2w3m2",
      "body": "I am still here cause I can't handle pain so I am trying to find a accessible way to die that looks as painless and fast as a shotgun",
      "created_utc": 1724177806.0,
      "score": 21
    },
    {
      "id": "lj6bifa",
      "body": "Same",
      "created_utc": 1724225518.0,
      "score": 8
    },
    {
      "id": "ljbrzto",
      "body": "[deleted]",
      "created_utc": 1724299380.0,
      "score": 2
    },
    {
      "id": "lkab4mf",
      "body": "same\n\nplus type 1 diabetic",
      "created_utc": 1724815401.0,
      "score": 2
    },
    {
      "id": "lmjsbdu",
      "body": "You aren’t the problem. The world treating you terribly for those things isn’t the problem either.\n\nProblems arise from misalignment. The state of one thing not aligning with the state of another.\n\nThe real problem is that you are one way while the world demands that you be another. Remove either piece and there is no more problem.\n\nThis is why I fight to change the demands of the world. It doesn’t want me, it wants me to change, but I refuse to. Perhaps that means that my very existence will forever be conflict.",
      "created_utc": 1726024358.0,
      "score": 2
    },
    {
      "id": "lj6b17d",
      "body": "Your way of handling them will, you will have a big character arc where you come to accept these things as gifts and not curses, certainly not permanently depressing. I am all kinds of gender, I am likely on all parts of the spectrum, I wouldn't have my life any other way.",
      "created_utc": 1724225202.0,
      "score": 1
    },
    {
      "id": "ljbrxgy",
      "body": "[deleted]",
      "created_utc": 1724299349.0,
      "score": 1
    },
    {
      "id": "lj4ydu2",
      "body": "Mental health isn't inherently bad, it's just bad when it's dysfunctional.",
      "created_utc": 1724202344.0,
      "score": 35
    },
    {
      "id": "lj5z8lm",
      "body": "My entire family. Including me growing up, which is why at 31 I still haven't talked to my own mother in 20 years. She fucked up, don't get me wrong, but my family thrives in this shit. Except for, you know, me.",
      "created_utc": 1724218017.0,
      "score": 6
    },
    {
      "id": "lkllgqn",
      "body": "I guess, but good or bad it's very rarely temporary. \nDysfunction in mental health is mostly subjective based on what other people think works for them.",
      "created_utc": 1724979691.0,
      "score": 1
    },
    {
      "id": "lj4jujw",
      "body": "Yeah but it feels a bit long when you want to die constantly",
      "created_utc": 1724197051.0,
      "score": 25
    },
    {
      "id": "lj59cq9",
      "body": "Nah cause once you’re dead, you’re dead. That basically makes life a permanent problem. Because you’ll have it forever, all your life. That’s permanent to us. Maybe not to others, but it is to us. And if the problem is that we’re alive, then it’s a permanent problem for us. And ending our own existence would be the permanent solution.",
      "created_utc": 1724206403.0,
      "score": 6
    },
    {
      "id": "ljxle50",
      "body": "But it takes so fucking long to get finished...",
      "created_utc": 1724628052.0,
      "score": 1
    },
    {
      "id": "lj3sstv",
      "body": "I'm sorry.  I feel you.",
      "created_utc": 1724187938.0,
      "score": 9
    },
    {
      "id": "lj5o2bz",
      "body": "That's just a tempo... Shit, you got me there! What can I say, I always was a scumbag.\n\n\nAll dumb jokes aside, people come up with stupid sayings like that because they lack the empathy or sympathy to process what you're going through. All of us who have been around a bit have lost people, and the grief stays with you forever.",
      "created_utc": 1724212357.0,
      "score": 4
    },
    {
      "id": "lj3qkq4",
      "body": "If it takes death, either now or later, to make it stop. I see that as a “permanent problem”.",
      "created_utc": 1724187251.0,
      "score": 4
    },
    {
      "id": "lm8h51o",
      "body": "suicide is a permanent solution to a temporary problem",
      "created_utc": 1725859243.0,
      "score": 1
    },
    {
      "id": "lj2pb7t",
      "body": "at least if you die someone will get something",
      "created_utc": 1724175720.0,
      "score": 1
    },
    {
      "id": "lj4tp5l",
      "body": "[removed]",
      "created_utc": 1724200650.0,
      "score": -7
    },
    {
      "id": "lj2wsck",
      "body": "[removed]",
      "created_utc": 1724178017.0,
      "score": -11
    },
    {
      "id": "lj4znpr",
      "body": "Well said",
      "created_utc": 1724202817.0,
      "score": 9
    },
    {
      "id": "lj6bh2u",
      "body": "i know right?",
      "created_utc": 1724225494.0,
      "score": 3
    },
    {
      "id": "lj3qvdl",
      "body": "No no in the \"suicide permanent for temporary problems\" their solutions is acceptance not death.",
      "created_utc": 1724187343.0,
      "score": 1
    },
    {
      "id": "lj2v5ah",
      "body": "wouldn't matter most insurance won't pay out for suicides, especially if its within 5-6 months of getting it. you need a myriad of tests and therapy sessions to prove that you tried to get better to even have a slim chance for it to payout to the beneficiary.",
      "created_utc": 1724177511.0,
      "score": 0
    },
    {
      "id": "lj4uj2f",
      "body": "How?? No matter how I distract myself I always think about it",
      "created_utc": 1724200949.0,
      "score": 8
    },
    {
      "id": "lj5hu9i",
      "body": "If I could distract myself I wouldn't be on this sub, or anyone else here for that matter.",
      "created_utc": 1724209695.0,
      "score": 5
    },
    {
      "id": "lj50ood",
      "body": "You DON’T get it. That distraction shit doesn’t work for some people.",
      "created_utc": 1724203201.0,
      "score": 10
    },
    {
      "id": "lj2wvwp",
      "body": "Huh 15 why",
      "created_utc": 1724178048.0,
      "score": 5
    },
    {
      "id": "lj3rd6r",
      "body": "Acceptance is not a solution; it’s a bandaid, a mind fuck, it’s bullshitting yourself.",
      "created_utc": 1724187493.0,
      "score": 1
    },
    {
      "id": "lj2xtzc",
      "body": "2 years, it will pay",
      "created_utc": 1724178338.0,
      "score": 10
    },
    {
      "id": "lj3rjvo",
      "body": "Yes, I believe so too, I am just talking for the sentence, acceptance won't change anything",
      "created_utc": 1724187551.0,
      "score": 2
    },
    {
      "id": "lj2z9r2",
      "body": "hell of a waiting period to end it all.",
      "created_utc": 1724178775.0,
      "score": 8
    },
    {
      "id": "lj3rpla",
      "body": "Ah. Okay",
      "created_utc": 1724187599.0,
      "score": 2
    },
    {
      "id": "lj7hqun",
      "body": "already got my 2 years in, tbh most ppl aren't committed enough to pass away, I have serious problems committing to things in my life. TBH same reason I'm single, don't have the job I want, overweight and struggling is probably the same reasons it hard for me to commit to ending it",
      "created_utc": 1724247362.0,
      "score": 1
    }
  ]
}